[
  {
    "url": "https://www.theguardian.com/world/2023/oct/08/israel-hamas-gaza-palestinian-territories",
    "title": "Israel-Hamas war: what happened in first few days and what caused the conflict?",
    "text": "Offensive launched from Gaza represented large failure of Israeli intelligence and is likely to have long-lasting repercussions Shocked Israelis woke on the last day of the Jewish high holidays to the wail of sirens as Hamas and Islamic Jihad fired thousands of rockets from Gaza and armed militants broke down the hi-tech barriers surrounding the strip to enter Israel,shooting and taking hostages. Militants in boats also tried to enter Israel by sea. It was a staggering and unprecedented offensive by Hamas and Islamic Jihad, and a catastrophicintelligence failureby Israel – and both will have long-lasting repercussions and consequences. The Israeli prime minister, Benjamin Netanyahu, declared that Israel was at war and that Palestinians would pay a heavy price. Militants infiltrated Jewish communities near the border with Gaza, killing and seizing civilians and soldiers. Unverified videos showed terrified Israelis covered in blood, and with hands tied behind their backs, being taken by Palestinian gunmen. Many people rushed to safe rooms in their homes as the carnage unfolded around them. Hundreds of young people at an all-night dance festival in southern Israel found themselves under fire. “They were going tree by tree and shooting. Everywhere. From two sides. I saw people were dying all around,”said one survivor. Authorities later said that 260 bodies had been recovered. By nightfall on 7 October, the Israel Defence Forces (IDF) estimated there were still 200-300 Palestinian militants inside Israel. There were eight “points of engagement” where the IDF was trying to regain control from militants. Israel called up army reservists and launched a wave of airstrikes on the tiny strip, which is home to 2.3 million people. Netanyahu warned Palestinians in Gaza to “get out of there now” as he vowed to reduceHamashideouts to “rubble”, but there is nowhere for those in the blockaded territory to escape to. Warplanes targeted several buildings in the centre of Gaza City, includingPalestineTower, an 11-storey building that houses Hamas radio stations. Israel indicated it may launch a ground invasion and cut off electricity and fuel supplies toGaza. Video recorded in Gaza showed a mosque destroyed in Khan Yunis, in the southern Gaza Strip, and several large buildings in Gaza City in ruins. Palestinians in Gaza shared images of text messages sent by the Israeli military to people in the Beit Hanoun area in the north of the strip that ordered them to leave their homes before the airstrikes. At least 700 Israelis were killed and about 2,000 people were being treated in hospitals – 19 of them in critical condition – according to reports on 8 October. The IDF spokesperson Daniel Hagari said more than 400 Palestinian militants had been killed in southern Israel and the Gaza Strip, and dozens more had been captured. The Palestinian health ministry said on 8 October that at least 400 Palestinians had been killed, including 20 children, and nearly 2,000 wounded as a result of Israeli airstrikes in Gaza since the day before. Seven people were also killed by Israeli army fire in the West Bank, including a child, it said. Hamas reportedly took as many as 100 Israelis hostage – both soldiers and civilians, alive and dead. The exact reasons for the attack were not clear, but there had been growing violence for months between Israeli soldiers and settlers and Palestinians in the West Bank. Armed settlers had attacked Palestinian villages; militants in the West Bank had attacked soldiers and settlers, and there had been repeated IDF raids on Palestinian cities. In the week before the attack, some Jews had prayed inside the compound of al-Aqsa mosque in Jerusalem’s Old City. The area around the mosque is known to Muslims as Haram al-Sharif and is the third holiest place for Islam after Mecca and Medina in Saudi Arabia. To Jews, it is known as Temple Mount, and is venerated as the site of the biblical Jewish temple. Jews are not permitted to pray inside al-Aqsa compound; to do so is highly provocative. Hamas has called its current offensive Operation al-Aqsa Deluge. The longer backdrop is a 16-year blockade of Gaza by Israel and Egypt that has almost destroyed the strip’s internal economy and has caused hardship for the people living there. Extreme religious nationalists who are part of Israel’s rightwing coalition government have repeatedly called for the annexation of Palestinian territory. There has also been speculation that the offensive could have been encouraged by Iran as a means of scuppering moves by Saudi Arabia to normalise relations with Israel. Hamas must have planned this offensive for many months, and it is a mystery why Israeli intelligence appears to have had no idea it was coming. Israel’s surveillance of Gaza is intense. It monitors activity, communications and daily life via state-of-the-art surveillance equipment, including drones flying over the strip. It also relies on human intelligence via informants, many of whom are blackmailed or otherwise coerced into assisting Israel. The intelligence failure is monumental, and will shake the Israeli public’s faith in their government and army’s ability to protect civilians. “All of Israel is asking itself: where is the IDF, where are the police, where is the security?” said Eli Maron, a former head of the Israeli navy, on Channel 12. “It’s a colossal failure; the [defence] establishments have simply failed, with vast consequences.” The militant organisation that has ruled the Gaza Strip since 2007 has shown the world that it is a force to be reckoned with, but it is hard to see how there can be a positive outcome for Hamas or Gaza from the events this weekend. Israel is likely to use the full force of its military might to crush militant activity, not just in Gaza but also the West Bank and East Jerusalem. In the process, a huge number of Palestinian civilians are likely to be killed, and homes and infrastructure destroyed. The hostage-taking will also complicate Israel’s response and gives Hamas a significant bargaining chip. Gilad Shalit, an Israeli soldier held in Gaza by Hamas for five years, was finally released in 2011 in exchange for more than 1,000 Palestinian prisoners. If Iran is involved, it will hope the violence will scupper any deal between Israel and Saudi Arabia. Many people in Gaza just want to get on with their lives, free from the blockade and repeated wars and conflicts. They resent the restrictions imposed on them and the fear instilled in them by Hamas rulers. However, others are driven to take up arms by the lack of hope and the misery that is characteristic of life in Gaza. They see militant action as the only way of asserting themselves and fighting for a better future. Support for Hamas has not been tested since the last elections in Gaza in 2006. There has been overwhelming condemnation of Hamas and support for Israel’s right to defend itself.Joe Biden told Netanyahuthat the US “stands with the people of Israel in the face of these terrorist assaults … My administration’s support for Israeli’s security is rock solid and unwavering.” The UN security council held an emergency meeting on Sunday to discuss the crisis. Meanwhile, UN peacekeeping forces have been deployed along the Lebanon-Israel border to “maintain stability and help avoid escalation”. The Egyptian government said it was in talks with Saudi Arabia and Jordan to try to find a way to defuse the crisis. Egypt has been heavily involved in brokering ceasefires in the past.",
    "id": "gaza_15",
    "corpus": "gaza"
  },
  {
    "url": "https://www.theguardian.com/world/2023/oct/13/israel-darkest-day-24-hours-of-terror-hamas-gaza",
    "title": "Israel’s darkest day: the 24 hours of terror that shook the country",
    "text": " As dawn broke last Saturday over the 40-mile Gaza-Israel barrier, once confidently described as an “iron wall”, Hamas struck at the eyes and ears of Israel’s defence. It was shortly before 6.30am at the end of a Sukkot week of holiday when explosive devices, dropped from above by drones, made a mockery of past claims of impregnability by disabling the wall’s communication towers and its remote-controlled machine gun posts, while snipers picked off sensors and cameras, blinding Israeli defenders, left staring at blank screens, to what was in deadly motion. Unseen in the weak light of early morning and unheard under the roar of the first of about 2,200 rockets fired towards southern and central Israel,Hamasfighters used wire cutters to make discreet punctures in the 20ft-tall (6 metres) double fence barrier or detonated small explosive loads to create larger openings. It allowed their best trained men to scramble across on motorbikes and pickup trucks, their wheels churning up dust, as they embarked on a murderous search for the closest Israeli soldiers. The shock troops from the military wing of Hamas, known as the Qassam brigades, bristling with machine guns and rocket-propelled grenades, were followed by bulldozers and hundreds more armed men, many on foot, swarming through 30 breaches of the defensive line. Some of the Hamas militants, showing a taste for the spectacular, flew over on motorised paragliders – terror on wings. A total of 1,500 gunmen are believed to have crossed, under a sky lit by rocket fire. “We have decided to put an end to all of the occupation’s crimes,” announced Hamas’s military commander, Mohammed Deif. “The time is over for them to act without accountability. Thus, we announce the al-Aqsa deluge.” Over the last week, hours of footage has been shared on social media, taken from security cameras, car dashcams and the phones of terrorists and victims alike, providing an uncomfortably clear picture of how Israel’s darkest day unfolded. What has become evident is that those charged with protecting Israel were hopelessly unprepared. As of Friday,1,300residents of Israel have been killed, including 247 soldiers, while the Israeli government claims to have killed about 1,500 Hamas fighters on its territory andmore than 1,500people have died in the Gaza Strip. A surge of communications activity on militant networks inGazahad been picked up earlier that Saturday by Israeli intelligence. In combination with a general warning from the Egyptian security services of an impending event, the information could have saved lives. Two telephone consultations had been held overnight between Israel’s southern security services, the Israel Defence Forces Intelligence Corps, the operations division and southern command with the knowledge of the IDF chief of staff, Herzi Halevi, according to the Israeli newspaper Haaretz. It was decided that they were just picking up chatter around a paramilitary exercise and that the alert level need not raise. Three observation balloons used to monitor the Gaza border had broken down in the past few weeks and they had not been replaced. Israel had relaxed its guard. It was a catastrophic miscalculation. Plans and maps found on the bodies of Hamas fighters show that they knew the numbers of soldiers they might meet, how long it would take for local reinforcements to arrive, and from where. Their orders were to kill and to take hostages “for negotiations”. The closest machine gun posts were cleared withgrenadeswithin minutes of the wall being breached. At sea, a motorboat carrying Hamas commandos headed at pace to Zikim, an Israeli coastal town just north of the Gaza Strip that hosts the Bahad 4 base, where new IDF recruits were undergoing their basic training. The Israeli navy managed to cut off at least one of the boats but already by 7am the Zikim base had beenoverrunby land. The manning of such bases had been cut down over the years based on a misplaced confidence that the iron wall had their backs. “I deeply care for all of you,” wrote Cpl Naama Boni, a 19-year-old soldier serving in the 77th Battalion of the Armoured Corps, to friends and family. “I have a head injury, and a terrorist nearby might start shooting at me. I am currently with an injured soldier from the Golani Brigade, and there are no reinforcements available.” It was 7.30am. Boni would not survive. Zikim was one of 11 military bases to come under attack that morning, four of which were overrun. Video footage taken by Hamas fighters showed how young men and women were slain as they tried to hide in toilet cubicles, bedrooms and cupboards. As Boni in Zikim was typing out her last messages, a Hamas paraglider was cruising above the heads of 4,000 people dancing, drinking and laughing at the Supernova festival, south from her and 3.7 miles east of Gaza, close to the Re’im kibbutz. Small plumes of black smoke had appeared in the sky from defensive missiles used by the Israeli military to intercept rockets fired from Gaza. At first, few of the partygoers – who had been promised a “journey of unity and love” by organisers – were concerned by the smoke or by the man buzzing above them, perhaps reckoning it was all part of the event. Then the sirens went off. The music stopped. Almost immediately the crack of gunfire was heard. Terror followed. The local armed security was overwhelmed by fire from all directions. Stalking among the partygoers, Hamas gunmen ran amok, firing with abandon at “anything with a pulse”, one witness said. Some tried to get to their cars to escape but those who made it on to the main road faced armed menfarther down the line, guns raised, murder on their minds. Others attempted to flee in vehicles or by footacross the fieldson the other side of the main access road, aiming to reach the woods on the horizon. Sniper fire whistled around them. Some of the Hamas militants took chase, pursuing for miles from the festival site, through orchards and dusty fields, looking for a kill. Those easy to snatch, such as Noa Argamani, 25, and her boyfriend, Avinatan Or, were hustled away at gunpoint. “Don’t kill me! No, no, no,” Argamani pleaded as she was driven away on the back of a bike. Her boyfriend was marched down a dirt path, destination unknown. Video footagetimed at 9.23amcaptured just one horrific moment among many during the carnage: a Hamas gunman firing close to one young man before leading him away. A second Israeli, lying by a car, possibly injured and certainly playing dead, lifted his head momentarily. It was the last thing he would do. A second Hamas fightercasually shot a roundinto his prostrate body. Others later took his belongings. An estimated 260 partygoers were murdered. Tens more could be among the 150 Israeli hostages believed to have been taken back to Gaza during the day. A video emerged of Shani Louk, 23, lifeless in the back of a truck, spat upon by Hamas fighters, legs unnaturally bent and her hair matted with blood. It took minutes for Hamas to reach the closest Israeli settlements to the Gaza Strip, communal gatherings known as kibbutzim. The timings of the horror can be recounted precisely thanks to video released by a Telegram channel called South First Responders. A camera caught the arrival of two armed men at the Be’eri kibbutzat 6.55am. They attempted to lift the security gate but then hid themselves as a blue Mazda pulled up. The gate lifted, at which point those inside the car were shot dead. Later footageat 10.06amshows Hamas militants pulling two dead men from the car and looting their bodies. They were two of 118 to die in Be’eri. A mobile phone is taken. One corpse is laterthrown into the back of a white SUVand driven away. Where video footage is missing, gripping testimony fills the gap. In Nirim, another kibbutz, with a population of 400 people, Eldad Hess, a 38-year-old civil engineer, was woken at 6.30am by rockets. He and his wife, Goldi, took their two-year-old son, Uri, to the reinforced concrete shelter where their older children, Avigail, seven, and four-year-old Yotam, were sleeping, and swung the steel door shut. At first, Hess thought it was just another rocket attack – a “wake-up alarm” from Gaza to mark Sukkot. But the alarm on their phones would not stop vibrating. Then the family heard explosions. “Ten minutes later we heard automatic rifle shots outside the house,” he said. “I understood what was happening but in my heart I couldn’t believe what was happening.” A barrage of WhatsApp messages arrived from neighbours, confirming that shots – and shouting in Arabic – had been heard all over the kibbutz. Hess realised he needed to lock the door. The problem was that the door could still be opened from the outside – a precaution the family had taken to stop the children locking themselves in the shelter. “All I had to keep the door closed was my muscles and my will to live,” Hess said. A few minutes later, the family heard voices and shots inside the house. Multiple attempts were made by the Hamas fighters to get in. They failed – but killed the family’s nextdoor neighbours instead, including a 17-year-old girl. In Nir Oz kibbutz, a number of people, including Doron Asher Katz, 34, and her young daughters, and 85-year-old Yafa Adar, were taken hostage and paraded and videoed by their captors In Kfar Aza, the largest kibbutz in the northern area of the Gaza border, where 750 Israelis lived just 800 metres from the iron wall, reports emerged of babies being killed in their cots. On Friday, the Israeli government published images including one of the corpse of a baby. Its clothes were spattered in blood. With cellular communications at the wall down, the scale of the assault had not been immediately clear in Tel Aviv, but at 6.29am the prime minister, Benjamin Netanyahu, was updated on some worrying movements, and by 8.23am the state of Israel was on a war footing, with reservists called to arms. In Gaza there too was a dawning realisation. The operation had been kept to a tight circle. Few knew to what it amounted but the potential repercussions swiftly became obvious to the average man and woman on the street. “We were ecstatic. It’s like a dream that is hard to wake up from,” said Maha, 34, from Gaza City, in a call with Haaretz about the first reports of the incursion into Israel by Palestinian fighters. “But as the picture became clearer and I saw that there were Israeli prisoners, I realised that we were in a nightmare, in hell,” she said. The first Israeli strikes on Gaza were at 10.34am. It would be the first of thousands on a thin stretch of land containing 2.2 million people. “Citizens of Israel, we are at war. Not an operation, not a round – at war,” Netanyahu announced in a first statement to the nation at 11.35am. “The enemy will pay an unprecedented price.” Within two hours, 21 buildings said to house Hamas’s military operations had been flattened. Troops were sent to the south of Israel to rescue those in the settlements who had survived the Hamas onslaught. It would take days more to secure them. “There were burnt cars and broken windows,” Hess said of his family’s escape from their shelter in Nir Oz under Israeli protection late on Saturday. “What we saw was a war zone. There’s no other word for it. And then we had to run for our lives.” The US president, Joe Biden, gave Netanyahu full backing for his military response in a call at 6.08pm and publicly offered “all appropriate means of support”. The rhetoric from the Israeli government hardened by the hour. Netanyahu made a second statement to the nation at 10.16pm. Gaza was “the city of evil”, he said. “We will turn all the places where Hamas is organised and hiding into cities of ruins. I say to the residents of Gaza: get out of there now. We will act everywhere and with all our strength.” At 2.19am on Sunday, the prime minister told his nation that all of the sites used to launch the day’s attacks had been wiped from the earth. But Israel had just begun. The “offensive formation” phase was under way.",
    "id": "gaza_17",
    "corpus": "gaza"
  },
  {
    "url": "https://www.theguardian.com/world/2024/jan/23/deadliest-day-for-israeli-forces-gaza-war",
    "title": "Twenty-four soldiers killed in deadliest day for Israeli forces of Gaza war",
    "text": "Deaths come as talks of ceasefire increase and pressure rises on Netanyahu over leadership and handling of war effort Twenty-four Israeli soldiers were killed in Gaza on Monday, by far the biggest single-day Israeli death toll in the three-month war against Hamas, as talks about a ceasefire intensified and Palestinian casualties continued to climb. The deaths came amid fierce fighting around the southern city of Khan Younis, with dozens of Palestinians killed and wounded. The Israeli casualties are likely to increase domestic pressure onBenjamin Netanyahuover his leadership and handling of the war effort. An Israeli military spokesperson said 21 soldiers were killed in Maghazi refugee camp in centralGazawhen two buildings they had mined for demolition collapsed after militants fired grenades at a nearby tank. Reports in local media said explosives set by the soldiers detonated prematurely. Earlier, the military said three soldiers were killed in a separate attack in southern Gaza. A total of 221 soldiers have been killed in the offensive, which some analysts in Israel have said could continue for many months, even into next year. The high toll of Israeli troops in fighting comes at a time when Israel is beginning to see stirrings of discontent with Netanyahu’s war strategy, which aims to “crush” Hamas but which has not involved detailed discussion of what would come next for Gaza. Israel’s forces have encircled Khan Younis, where it believes Hamas leaders are sheltering in tunnels. The recent Israeli advances have taken them close to areas sheltering a million or more Palestinians forced out of other parts of the territory by fighting or the destruction of their homes and all essential infrastructure. Aid officials say Israeli blockades and the storming of hospitals in Khan Younis in the last 48 hours have left the wounded and dead beyond the reach of rescuers. The dead were being buried inside the grounds of Khan Younis’s main Nasser hospital because it was unsafe to leave to reach the cemetery. Footage filmed by the Palestinian journalist Hamdan El-Dahdouh showed persistent gunfire hitting the top of the main building. At the European hospital in southern Khan Younis, a resident brought in five corpses, piled on a mattress on a donkey cart, Reuters reported. “I found them face-down in the street,” Ahed Masmah said. Israeli officials say Hamas fighters operate in and around medical facilities, making them legitimate targets. Hospital staff and Hamas deny this. The Israeli offensive began after Hamas’s attacks into Israel on 7 October, when the group killed 1,200 people, mostly civilians, and abducted about 240 hostages. About half of these remain in Gaza, and dozens are thought to have died there. At least 25,295 Palestinians, mostly women and children, have been confirmed killed in the Israeli offensive, according to Palestinian authorities, and thousands more dead are thought to remain unidentified in the rubble. Almost 200 Palestinians were killed in the space of 24 hours, Palestinian officials said. Egypt and Qatar, which have brokered past agreements between Israel and Hamas, have been developing a proposal involving a series of phased ceasefires and releases. White House spokesman John Kirby on Tuesday said US Middle East envoy Brett McGurk was in Cairo for “active” discussions on securing the release of Israeli hostages and a humanitarian pause in the fighting, which he said the Biden administration would back. A total of 110 Israelis and other nationals were freed in return for 240 Palestinian women and children held in Israeli prisons as part of a week-long truce at the end of November. Several attempts at a ceasefire since have failed. On Sunday, Netanyahu rejected Hamas’s conditions for ending the war and releasing the hostages, which included the Islamist group retaining control of Gaza and Israel withdrawing completely. In response, a Hamas official in Qatar said Netanyahu’s refusal to end the military offensive in Gaza meant there was “no chance for the return of the captives”. A senior Egyptian official said Israel had proposed a two-month ceasefire in which the hostages would be freed in exchange for the release of Palestinians imprisoned by Israel, and senior Hamas leaders in Gaza would be allowed to relocate to other countries. The official, who was not authorised to brief media and spoke on condition of anonymity, said Hamas had rejected the proposal. Asked about media reports that a ceasefire deal was being discussed, an Israeli government spokesperson, Eylon Levy, said the war’s goals were unchanged. “The destruction of Hamas’s governing and military capabilities in the Gaza Strip and the return of all the hostages,” he said. “There will be no ceasefire that leaves the hostages in Gaza and Hamas in power.” Support for the war remains high among Israelis, but opinion polls show support has cratered for Netanyahu and his far-right coalition. Weekly Saturday night rallies demanding the release of hostages still held in Gaza have been supplemented in recent weeks by growing calls for elections. Humanitarian officials made new appeals for further aid to be allowed to reach Gaza. “The situation in Gaza is of course slipping every day into a much more catastrophic situation,” Abeer Etefa, the World Food Programme’s senior Middle East spokesperson, told a press briefing. “I think the risk of having pockets of famine in Gaza is very much still there.” The conflict in Gaza has been accompanied by an escalation in violence elsewhere in the Middle East, especially where armed groups allied to Iran operate, including Lebanon, Iraq, Syria and Yemen.",
    "id": "gaza_22",
    "corpus": "gaza"
  },
  {
    "url": "https://www.foxnews.com/world/hamas-launches-first-attack-israel-since-ceasefire-collapse",
    "title": "Hamas launches first attack on Israel since ceasefire collapse",
    "text": "This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided byFactset. Powered and implemented byFactSet Digital Solutions.Legal Statement. Mutual Fund and ETF data provided byRefinitiv Lipper. ‘Fox News @ Night’ panelists Noa Tishby and retired Rear Adm. Mark Montgomery discuss the latest in negotiations to end the Israel-Hamas war and the conflict between Russia and Ukraine. Hamas has claimed responsibility for rockets fired at Israel on Thursday. \"This launch is the resistance's first response to the zionist entity's violation of the ceasefire, which resulted over 710 martyrs in the last three days. It also comes after the IOF's renewed ground invasion into Beit Lahia this morning, and the failure of the mediators and the world to curb the IOF's aggression,\" according to reports. Strikes launched by Israelkilled at least 58 Palestinians throughout the Gaza Strip overnight and into Thursday, according to hospitals via the Associated Press. The Jewish State resumed attacks across Gaza earlier this week, breaking a ceasefire, which reportedly killed over 400 Palestinians – mostly women and children – on Tuesday, according to the Hamas-run Gaza health ministry. Israel's military indicated that it intercepted a missile fired by Yemen's Iran-backed Houthi rebels early Thursday before it entered Israel's airspace, the AP reported. ISRAEL LAUNCHES NEW GROUND OPERATION IN GAZA Israeli Prime Minister Benjamin Netanyahu gives statements to the media inside The Kirya, which houses the Israeli Defense Ministry, after their meeting in Tel Aviv on Oct. 12, 2023.(Jacquelyn Martin/Pool/AFP via Getty Images) \"Hamas refused offer after offer to release our hostages. In the past two weeks, Israel did not initiate any military action, in the hope that Hamas would change course. Well, that didn't happen. While Israel accepted the offer of President Trump's special envoy Steve Witkoff, Hamas flatly refused to do so,\" Israeli Prime Minister Benjamin Netanyahu said in a video shared to X on Tuesday. \"This is why I authorized yesterday, the renewal of military action against Hamas.\" \"Israel does not target Palestinian civilians. We target Hamas terrorists,\" he declared. \"And when these terrorists embed themselves in civilian areas, when they use civilians as human shields, they're the ones who are responsible for all unintended casualties.\" Israellaunched its waron Hamas in response to the terrorist group's heinous attack on Oct. 7, 2023. CEASEFIRE OVER AS ISRAEL STRIKES GAZA AFTER HAMAS REFUSED TO RELEASE HOSTAGES, OFFICIALS SAY Sen.John Fetterman, D-Pa., a staunch supporter of Israel, continued to express his support while visiting the foreign nation this week. \"Hamas does not want peace. I unapologetically, 100% stand with Israel, and demand the release of all remaining hostages. Sending this from Israel,\" Fetterman said on X on Tuesday. NETANYAHU GIFTS FETTERMAN A SILVER-PLATED BEEPER AFTER HE PRAISED ISRAEL'S LEBANON PAGER OPERATION CLICK HERE TO GET THE FOX NEWS APP Rep. Jared Moskowitz, D-Fla., said on X on Wednesday, \"Hamas could end this war right now if it released the hostages held in Gaza. It could’ve done so months ago, but instead it’s brought devastation by prolonging this conflict. America must lead the world in pressuring Hamas to end this war and bring the hostages home.\" Alex Nitzberg is a writer for Fox News Digital. Fox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\" By entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time. Subscribed You've successfully subscribed to this newsletter! This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided byFactset. Powered and implemented byFactSet Digital Solutions.Legal Statement. Mutual Fund and ETF data provided byRefinitiv Lipper. ",
    "id": "gaza_23",
    "corpus": "gaza"
  },
  {
    "url": "https://www.foxnews.com/world/before-after-images-show-devastating-destruction-gaza",
    "title": "Before and after images show devastating destruction in Gaza",
    "text": "This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided byFactset. Powered and implemented byFactSet Digital Solutions.Legal Statement. Mutual Fund and ETF data provided byRefinitiv Lipper. Fox News chief foreign correspondent Trey Yingst reports from Tel Aviv two years after Hamas’ Oct. 7 terror attack as President Trump pushes for a Gaza peace deal. Former National Security Advisor Robert O’Brien weighs in. New satellite images reveal the extent of the destruction in theGaza Stripafter enduring more than two years of Israeli strikes during the war with Hamas. Planet Labs PBC released the images on Tuesday, showing the Palestinian enclave before theIsrael-Hamas warbroke out on Oct. 7, 2023, and after the war began. An estimated 192,812 – about 78% – of all structures in Gaza have been damaged or destroyed, according to a United Nations Satellite Center report from July. Where homes, buildings and fields once stood in the southern city of Rafah, there were now craters and barren wastelands. NETANYAHU, ON 2-YEAR MARK OF OCT. 7 HAMAS TERROR ATTACK, SAYS ISRAEL 'NOT BROKEN,' VOWS TO BRING HOSTAGES HOME A satellite image shows Rafah before the war on Aug. 20, 2023.(Planet Labs PBC via Reuters) A satellite image shows Rafah during the war on Aug. 30, 2025.(Planet Labs PBC via Reuters) In Jabaliya, a city north of Gaza City, areas once green were turned to dust and dirt around decimated structures. Satellite image shows Jabaliya the day after the outbreak of the current war on Oct. 8, 2023.(Planet Labs PBC via Reuters) Satellite image shows Jabaliya during the war on Sept. 27, 2025.(Planet Labs PBC via Reuters) In northeast Gaza, the city Beit Hanoun appeared leveled. Before the war, tens of thousands of people were estimated to have lived in the city. A satellite image shows Beit Hanoun before the war on June 5, 2023.(Planet Labs PBC via Reuters) A satellite image shows Beit Hanoun during the war on Sept. 21, 2025.(Planet Labs PBC via Reuters) Israel's retaliatory offensive has displaced around 90% of Gaza's population of some 2 million, often multiple times, and restrictions on humanitarian aid have contributed to a severe hunger crisis, with experts saying Gaza City is experiencing famine. The war has already killed over 67,000 Palestinians, according to Gaza's Health Ministry, part of the Hamas-run government, which does not say how many were civilians or combatants. It says women and children make up around half the dead. REPORTER’S NOTEBOOK: ISRAELI HOSTAGE FAMILIES PLEAD, PEACE FALTERS, AND WAR GRINDS ON IN GAZA The Israel-Hamas war began after Hamas terrorists launched a surprise attack on southernIsrael, storming army bases, farming communities and an outdoor music festival, killing some 1,200 people, mostly civilians, including women, children and older adults. Hamas abducted 251 others, most of whom have since been released in ceasefires or other deals. Forty-eight hostages remain inside Gaza, around 20 of them believed by Israel to be alive. Hamas has said it will release them only in exchange for a lasting ceasefire and an Israeli withdrawal. CLICK HERE TO GET THE FOX NEWS APP Israeli Prime MinisterBenjamin Netanyahuhas vowed to continue the war until all the captives are returned and Hamas has been removed. The Associated Press contributed to this report. Fox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\" By entering your email and clicking the Subscribe button, you agree to the Fox NewsPrivacy PolicyandTerms of Use, and\n        agree to receive content and promotional communications from Fox News. You understand that you can\n        opt-out at any time. Subscribed You've successfully subscribed to this newsletter! This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided byFactset. Powered and implemented byFactSet Digital Solutions.Legal Statement. Mutual Fund and ETF data provided byRefinitiv Lipper. ",
    "id": "gaza_25",
    "corpus": "gaza"
  },
  {
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-500-days-numbersc244fe24769dbfabcbcdfb10487ce106",
    "title": "500 days of the Israel-Hamas war, by the numbers",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Relatives and supporters of Israelis held hostage in the Gaza Strip, block a freeway during a protest demanding their release from Hamas captivity as they mark 500 days of the Israel-Hamas war in Tel Aviv, Israel, Monday, Feb. 17, 2025. (AP Photo/Oded Balilty) Relatives and supporters of Israelis held hostage in the Gaza Strip, block a freeway during a protest demanding their release from Hamas captivity as they mark 500 days of the Israel-Hamas war in Tel Aviv, Israel, Monday, Feb. 17, 2025. (AP Photo/Oded Balilty) Relatives and supporters of Israelis held hostage in the Gaza Strip, block a freeway during a protest demanding their release from Hamas captivity as they mark 500 days of the Israel-Hamas war in Tel Aviv, Israel, Monday, Feb. 17, 2025. (AP Photo/Oded Balilty) Relatives and supporters of Israelis held hostage in the Gaza Strip, block a freeway during a protest demanding their release from Hamas captivity as they mark 500 days of the Israel-Hamas war in Tel Aviv, Israel, Monday, Feb. 17, 2025. (AP Photo/Oded Balilty) Relatives and supporters of Israelis held hostage in the Gaza Strip, block a freeway during a protest demanding their release from Hamas captivity as they mark 500 days of the Israel-Hamas war in Tel Aviv, Israel, Monday, Feb. 17, 2025. (AP Photo/Oded Balilty)           Monday is the 500th day of the war triggered byHamas’ Oct. 7, 2023 attackinto southern Israel. A tenuous ceasefire in the Gaza Strip has held for nearly a month. But the current phase of the truce is set to expire in early March and it is unclear if the sides will extend it, begin negotiations for a more lasting ceasefire or resume fighting. Here are some numbers that show the scale of death anddevastation. Sources include the Israeli government, the Gaza Health Ministry and U.N. agencies. People killed in Israel on Oct. 7, 2023: Around 1,200 Hostages taken into Gaza: 251 Hostages remaining in Gaza: 73, including 3 taken before Oct. 7, 2023 Hostages in Gaza believed to be dead: 36, including one from before Oct. 7, 2023 Palestinians killed in Gaza: Over 48,200 (This figure from the Gaza Health Ministry does not distinguish between combatants and civilians, but the ministry says more than half of the dead were women and children) Palestinians wounded in Gaza: Over 111,600 Israeli soldiers killed since Oct. 7, 2023: 846 Rockets fired at Israel from Gaza since Oct. 7, 2023: Over 10,000 Percentage of Gaza’s population displaced: Around 90% Palestinians who have crossed into northern Gaza since the ceasefire began: 586,000 Israelis displaced by attacks from Gaza and Hezbollah in Lebanon at their peak: Over 75,500 Housing units damaged or destroyed in Gaza: Over 245,000 Primary roads damaged or destroyed in Gaza: Over 92% Health facilities damaged or destroyed in Gaza: Over 84% ___ Follow AP’s war coverage athttps://apnews.com/hub/israel-hamas-war      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "gaza_28",
    "corpus": "gaza"
  },
  {
    "url": "https://apnews.com/today-in-history/october-7",
    "title": "Today in History: October 7, surprise attacks spark Israel-Hamas War",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Palestinians walk away from a kibbutz, near the border fence with the Gaza Strip, while carrying out a deadly cross-border attack in southern Israel on Saturday, Oct. 7, 2023. (AP Photo) On Oct. 7, 2023, Hamas-led militants launched air and ground attacks on Israel, killing nearly 1,200 and taking more than 250 hostages. The attacks, followed hours later by Israeli counterattacks, marked the beginning of the current Israel-Hamas War. In 1765, the Stamp Act Congress convened in New York to draw up colonial grievances against England. Workers are photographed on a flywheel assembly line at the Ford Motor Company’s Highland Park, Mi., plant in 1913. The use of a moving line reduced a car’s assembly time from 12 hours to 93 minutes. (Ford Motor Company via AP)  In 1913, the first moving assembly line began operation at the Ford Motor Company factory in Highland Park, Michigan. In 1916, in the most lopsided victory in college football history, Georgia Tech defeated Cumberland University 222-0 in Atlanta. Passengers stand on the top deck aboard the Italian luxury liner “Achille Lauro” as the ship is docked at Port Said, Egypt, on October 10, 1985. (AP Photo/Michel Lipchitz)  In 1985, Palestinian gunmen hijacked the Italian cruise ship Achille Lauro (ah-KEE’-leh LOW’-roh) in the Mediterranean Sea. (The hijackers shot and killed Leon Klinghoffer, a Jewish-American tourist in a wheelchair, and pushed him overboard, before surrendering on Oct. 9.) Mexican President Carlos Salinas de Gortari, left, greets Canadian Prime Minister Brian Mulroney, right, and U.S. President George Bush, Oct. 7, 1992 in San Antonio, Texas. (AP Photo/Marcy Nighswander)  In 1992, trade representatives of the United States, Canada and Mexico initialed the North American Free Trade Agreement during a ceremony in San Antonio, Texas, in the presence of President George H.W. Bush, Canadian Prime Minister Brian Mulroney and Mexican President Carlos Salinas de Gortari. In this Saturday, Oct. 9, 1999 file photo, a cross made of stones rests below the fence in Laramie, Wyo. where a year earlier, gay University of Wyoming student Matthew Shepard was tied and pistol whipped into a coma. He later died. The killers, police said, targeted him because he was gay. Congress passed anti-hate crimes legislation bearing his name in 2009. (AP Photo/Ed Andrieski)  In 1998, Matthew Shepard, a gay college student, was beaten and left tied to a wooden fencepost outside of Laramie, Wyoming; he died five days later (Russell Henderson and Aaron McKinney are serving life sentences for Shepard’s murder). Ordnance carrying the writing “Pentagon U.S.A.” is wheeled to an aircraft aboard the American aircraft carrier USS Enterprise deployed in the northern Indian Ocean, Sunday, Oct. 7, 2001. (AP Photo/Jockel Finck)  In 2001, the war in Afghanistan started as the United States and Britain launched air attacks against military targets and Osama bin Laden’s training camps in the wake of the September 11 attacks. Arnold Schwarzenegger celebrates his victory in the California gubernatorial recall election at his election night headquarters in Los Angeles, Tuesday, Oct. 7, 2003. (AP Photo/Chris Carlson)  In 2003, California voters recalled Gov. Gray Davis and elected Arnold Schwarzenegger their new governor.     Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "gaza_29",
    "corpus": "gaza"
  },
  {
    "url": "https://apnews.com/article/israel-hamas-war-news-10-28-2023-c9bd7ecc5f4a9fe9d46486f66675244c",
    "title": "Netanyahu says the Gaza war has entered a new stage and will be ‘long and difficult’",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Israel has expanded its ground operation in Gaza, sending in tanks and infantry backed by massive strikes from the air and sea. (Oct. 28) An Israeli mobile artillery unit is seen in a position near the Israel-Gaza border, Israel, Saturday, Oct. 28, 2023. Israel on Saturday expanded its ground operation in Gaza with infantry and armored vehicles backed by “massive” strikes from the air and sea, including the bombing of Hamas tunnels, a key target in its campaign to crush the territory’s ruling group after its bloody incursion in Israel three weeks ago. (AP Photo/Tsafrir Abayov) Israeli Prime Minister Benjamin Netanyahu speaks during a press conference with Defense Minister Yoav Gallant and Cabinet Minister Benny Gantz in the Kirya military base in Tel Aviv, Israel, Saturday, Oct. 28, 2023. (Abir Sultan/Pool Photo via AP) Destroyed buildings caused by the ongoing Israeli airstrikes on Gaza City, Saturday, Oct. 28, 2023. (AP Photo/Abed Khaled) Palestinians arrive to collect drinking water during the ongoing Israeli bombardment of the Gaza Strip in Rafah on Saturday, Oct. 28, 2023. (AP Photo/Hatem Ali) Smoke and explosions caused by Israeli bombardment are seen on the horizon in northern Gaza, Saturday, Oct. 28, 2023. (AP Photo/Abed Khaled) A Palestinian cooks food for people displaced in the ongoing Israeli bombardment of the Gaza Strip in Rafah on Saturday, Oct. 28, 2023.AP Photo/Hatem Ali) Israelis take cover in an underground car tunnel as a siren warns of incoming rockets fired from the Gaza Strip, during a protest calling for the return of more than 220 people captured by Hamas militants, in Tel Aviv, Israel, Saturday, Oct. 28, 2023. (AP Photo/Bernat Armangue) Israelis take cover in an underground car tunnel as a siren warns of incoming rockets fired from the Gaza Strip, during a protest calling for the return of more than 220 people captured by Hamas militants, in Tel Aviv, Israel, Saturday, Oct. 28, 2023. (AP Photo/Bernat Armangue) Palestinians pass by the destruction after the Israeli bombardment of the Gaza Strip in Rafah on Saturday, Oct. 28, 2023. (AP Photo/Hatem Ali) A Palestinian wounded in the Israeli bombardment of the Gaza Strip waits for treatment in a hospital in Rafah on Saturday, Oct. 28, 2023. (AP Photo/Hatem Ali) Palestinians pass by the destruction after the Israeli bombardment of the Gaza Strip in Rafah on Saturday, Oct. 28, 2023. (AP Photo/Hatem Ali) Israelis light candles at a vigil paying tribute to the victims of the unprecedented deadly Hamas attack on southern Israel on Oct. 7, and calling for the return of the more than 220 people captured by Hamas militants and taken to Gaza, in Jerusalem, Saturday, Oct. 28, 2023. (AP Photo/Mahmoud Illean) Palestinian supporters shout slogans as they cross the Brooklyn Bridge during a demonstration demanding a cease-fire on Saturday, Oct. 28, 2023, in New York. (AP Photo/Andres Kudacki) An Israeli mobile artillery unit is seen in a position near the Israel-Gaza border, Israel, Saturday, Oct. 28, 2023. Israel on Saturday expanded its ground operation in Gaza with infantry and armored vehicles backed by “massive” strikes from the air and sea, including the bombing of Hamas tunnels, a key target in its campaign to crush the territory’s ruling group after its bloody incursion in Israel three weeks ago. (AP Photo/Ohad Zwigenberg) People look at a memorial for the more than 220 people captured by Hamas militants, in Tel Aviv, Israel, Saturday, Oct. 28, 2023. (AP Photo/Bernat Armangue) Israeli Iron Dome air defense system fires to intercept a rocket fired from the Gaza Strip, in central Israel, Saturday, Oct. 28, 2023. (AP Photo/Oded Balilty)                                  JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu told the nation Saturday night that the military has opened a “second stage” inthe waragainst Hamas by sending ground forces into Gaza and expanding attacks from the ground, air and sea. Casting the war as a fight for his country’s very survival, he warned that the assault would only intensify ahead of a broad ground invasion into the territory. “There are moments in which a nation faces two possibilities: to do or die,” Netanyahu said. “We now face that test and I have no doubt how it will end: We will be the victors. We will do and we will be the victors.” The bombardment — described by Gaza residents as the most intense of the war —knocked out most communications in the territorylate Friday and largely cut off the besieged enclave’s 2.3 million people from the world. Communications were restored to many people in Gaza early Sunday, according to the telecoms company, Internet-access advocacy groupNetBlocks.organd confirmation on the ground. Highlighting the ongoing attacks, the Israeli military released grainy images showing tank columns moving slowly in open areas of Gaza, many apparently near the border, and said warplanes bombed dozens ofHamas tunnels and underground bunkers. The underground sites are a key target in Israel’s campaign to crush the territory’s ruling group after itsbloody incursioninto Israel three weeks ago.  The escalation ratcheted up domestic pressure on Israel’s government to secure the release of dozens of hostages seized in the Oct. 7 rampage by Hamas, when militants stormed from Gaza into nearby Israeli towns and gunned down civilians and soldiers. The unprecedented attack during a major Jewish holiday initiated a war between Israel and Hamas that couldspread into a broader Mideast conflict. Desperate family members met with Netanyahu on Saturdayand expressed support for an exchange for Palestinian prisoners held in Israel, a swap floated by the top Hamas leader in Gaza. Netanyahu told the nationally televised news conference that Israel is determined to bring back all the hostages, and maintained that the expanding ground operation “will help us in this mission.” He said he couldn’t reveal everything that is being done due to the sensitivity and secrecy of the efforts. “This is the second stage of the war, whose objectives are clear: to destroy the military and governmental capabilities of Hamas and bring the hostages home,” he said in his first time taking questions from journalists since the war began. He didn’t address calls for a cease-fire, but in a speech peppered with references to centuries of Jewish history and military conflicts, made clear his view that Israel’s future depends on its success against “enemy” forces. “Our heroic soldiers have one supreme goal: to destroy the murderous enemy and ensure our existence in our land. We have always said, ‘Never again,’” he said. “‘Never again’ is now.” Netanyahu also acknowledged that the Oct. 7 “debacle,” in which more than 1,400 people were killed, would need a thorough investigation, adding that “everyone will have to answer questions, including me.” The Israeli military said it was gradually expanding its ground operations inside Gaza, while stopping short of calling it an all-out invasion. “We are proceeding with the stages of the war according to an organized plan,” said the chief military spokesman, Rear Adm. Daniel Hagari. The comments hinted at a strategy of a staged escalation, instead of a massive and overwhelming offensive. Early in the war, Israel amassed hundreds of thousands of troops along the border. Until now, troops had conducted brief nightly ground incursions before returning to Israel. Despite the Israeli offensive, Palestinian militants have continued firing rockets into Israel, with the constant sirens in southern Israel a reminder of the threat. The Palestinian death toll in Gaza rose Saturday to just over 7,700 people since the war began, with 377 deaths reported since late Friday,according to the Gaza Health Ministry. Most of those killed have been women and minors, the ministry said. Ministry spokesman Ashraf al-Qidra told reporters that the disruption of communications has “totally paralyzed” the health network. Residents had no way of calling ambulances, and emergency teams were chasing the sounds of artillery barrages and airstrikes. A Palestinian sits in his damaged home after an Israeli airstrike in Khan Younis, southern Gaza Strip, Friday, Oct. 27, 2023. (AP Photo/Fatima Shbair)  An estimated 1,700 people remain trapped beneath the rubble, according to the health ministry, which has said it bases its estimates on distress calls it received. Some civilians were using their bare hands to pull injured people from the rubble and loading them into personal cars or donkey carts. In a video posted by local news media, Palestinians sprinted down a street with a wounded man covered in the dust of a building’s collapse. “Ambulance! Ambulance!” the men shouted as they shoved the stretcher into a truck and shouted, “Go! Go!” Some Gaza residents traveled by foot or car to check on relatives and friends. “The bombs were everywhere, the building was shaking,” said Hind al-Khudary, a journalist in central Gaza and one of a few people with cellphone service. “We can’t reach anyone or contact anyone. I do not know where my family is.” Israel says its strikes target Hamas fighters and infrastructure and that the militants operate from among civilians, putting them in danger. The World Health Organization appealed to “the humanity in all those who have the power to do so to end the fighting now” in Gaza. “There are more wounded every hour. But ambulances cannot reach them in the communications blackout. Morgues are full. More than half of the dead are women and children,” it said. Palestinians say the war also robbed them ofthe funeral ritesthat long have offered mourners some dignity and closure. Overcrowded cemeteries have compelled families to dig up long-buried bodies and deepen the holes. More than 1.4 million people across Gaza have fled their homes, nearly half crowding into U.N. schools and shelters, following repeated warnings by the Israeli military that they would be in danger if they remained in northern Gaza. A large number of residents have not evacuated to the south, in part because Israel has also bombarded targets in so-called safe zones where conditions are increasingly dire. Food and water supplies were running out. Israel knocked out electricity early in the war. Humanitarian workers say the trickle of aid Israel has allowed to enter from Egypt in the past week is a tiny fraction of what is needed.Gaza hospitals have been scrounging for fuelto run emergency generators that power incubators and other life-saving equipment. The U.N. agency for Palestinian refugees, which runs a network of shelters and schools for nearly half the displaced Gaza residents, has lost contact with most staff, spokeswoman Juliette Touma said, and coordinating aid efforts was now “extremely challenging.” The intensified air and ground campaign raised new concerns about hostages dragged into Gaza. On Saturday, hundreds of relatives gathered in Tel Aviv and demanded that the government put the return of their loved ones ahead of military objectives. In comments likely to inflame these tensions, Hamas’ top leader in Gaza, Yehia Sinwar, said the Palestinian militant groups “are ready immediately” to release all hostages if Israel releases all Palestinians held in Israeli prisons. Hagari, the Israeli military spokesman, dismissed the offer as “psychological terror.” In Cairo, Egyptian President Abdel Fattah el-Sissi said his government was working to de-escalate the conflict through talks with the warring parties to release prisoners and hostages. On Saturday, he spoke with U.N. Secretary-General Antonio Guterres, his office said. Guterres in a statement said he was “surprised by an unprecedented escalation of the bombardments and their devastating impacts” in Gaza. Among many, impatience was growing. Turkish President Recep Tayyip Erdogan told hundreds of thousands of people at a pro-Palestinian rally in Istanbul that his country was preparing to proclaim Israel a “war criminal” for its actions in Gaza. He did not give details. Israel’s foreign minister said he ordered the return of Israel’s diplomatic mission from Turkey to reassess ties. The overall number of deaths in Gaza and Israel far exceeds the combined toll of all four previous Israel-Hamas wars,estimated at around 4,000. The conflict has threatened to ignite a wider war across the region. Arab nations — including U.S. allies and ones that have reached peace deals or normalized ties with Israel — have raised increasing alarm over a potential ground invasion. ___ Magdy reported from Cairo. Associated Press writers Samya Kullab in Baghdad and Josef Federman in Jerusalem contributed to this report. ___ Full AP coverage:https://apnews.com/hub/israel-hamas-war.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "gaza_30",
    "corpus": "gaza"
  },
  {
    "url": "https://apnews.com/article/israel-gaza-hamas-war-palestinians-photogallery-0d3960dc03ddd8b4fe3d81111cf177a0",
    "title": "AP PHOTOS: Death, destruction and despair reigns a month into latest Israel-Gaza conflict",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Palestinians celebrate by a destroyed Israeli tank at the Gaza Strip fence east of Khan Younis southern Saturday, Oct. 7, 2023. The militant Hamas rulers of the Gaza Strip carried out an unprecedented, multi-front attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations by air, land, and sea and catching the country off-guard on a major holiday. (AP Photo) Palestinian militants drive back to the Gaza Strip with the body of Shani Louk, a German-Israeli dual citizen, on Saturday, Oct. 7, 2023. The militant Hamas rulers of the Gaza Strip carried out an unprecedented, multi-front attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations by air, land, and sea and catching the country off-guard on a major holiday. (AP Photo/Ali Mahmud) Police officers evacuate a woman and a child from a site hit by a rocket fired from the Gaza Strip in Ashkelon, southern Israel, Saturday, Oct. 7, 2023. (AP Photo/Tsafrir Abayov) Palestinians transport a captured Israeli civilian, center, from Kibbutz Kfar Azza into the Gaza Strip on Saturday, Oct. 7, 2023. The militant Hamas rulers of the Gaza Strip carried out an unprecedented, multi-front attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations by air, land, and sea and catching the country off-guard on a major holiday. (AP Photo) Palestinians transport a captured Israeli civilian, center, from Kfar Azza kibbutz into the Gaza Strip on Saturday, Oct. 7, 2023. The militant Hamas rulers of the Gaza Strip carried out an unprecedented, multi-front attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations by air, land, and sea and catching the country off-guard on a major holiday. (AP Photo) Rockets are fired toward Israel from the Gaza Strip on Saturday, Oct. 7, 2023. (AP Photo/Fatima Shbair) Israeli soldiers walk by civilians killed by Hamas militants in Sderot, Israel, on Saturday, Oct. 7, 2023. (AP Photo/Ohad Zwigenberg) Blood is seen splattered in a child’s room following a massive Hamas militant attack in Kibbutz Nir Oz, Israel, Thursday, Oct. 19, 2023. Nir Oz is one of more than 20 towns and villages in southern Israel that were ambushed in the sweeping assault by Hamas on Oct. 7. (AP Photo/Francisco Seco) Palestinians transport a captured Israeli civilian, center, from Kibbutz Kfar Azza into the Gaza Strip on Saturday, Oct. 7, 2023. The militant Hamas rulers of the Gaza Strip carried out an unprecedented, multi-front attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations by air, land, and sea and catching the country off-guard on a major holiday. (AP Photo) Civilians killed by Hamas militants lie covered in Sderot, Israel, on Saturday, Oct. 7, 2023. (AP Photo/Ohad Zwigenberg) Israelis killed by Hamas militants lie on the road near Sderot, Israel, on Saturday, Oct. 7, 2023. (AP Photo/Ohad Zwigenberg) Israeli soldiers walk by a civilian killed by Hamas militants in Sderot, Israel, on Saturday, Oct. 7, 2023. Hamas militants in the Gaza Strip infiltrated Saturday into southern Israel and fired thousands of rockets into the country while Israel began striking targets in Gaza in response. (AP Photo/Ohad Zwigenberg) Israelis inspect a damaged residential building after it was hit by a rocket fired from the Gaza Strip, in Ashkelon, Israel, Monday, Oct. 9, 2023. (AP Photo/Erik Marmor) Smoke rises from an explosion following an Israeli airstrike in the Gaza Strip, as seen from southern Israel, Monday, Oct. 23, 2023. (AP Photo/Ariel Schalit) Palestinians carry the body of a dead child who was found under the rubble of a destroyed house after Israeli airstrikes on Gaza City, Tuesday, Oct. 24, 2023. (AP Photo/Abed Khaled) Palestinians inspect the rubble of destroyed buildings following Israeli airstrikes on the town of Khan Younis, southern Gaza Strip, Thursday, Oct. 26, 2023. (AP Photo/Mohammed Dahman) Fire and smoke rise following an Israeli airstrike in Gaza City, Saturday, Oct. 7, 2023. (AP Photo/Fatima Shbair) Palestinians evacuate wounded in the Israeli bombardment of Rafah, southern Gaza Strip, Tuesday, Oct. 17, 2023. (AP Photo/Hatem Ali) Palestinians react after removing a dead body from the rubble of a building after an Israeli airstrike in Jebaliya refugee camp, Gaza Strip, Monday, Oct. 9, 2023. (AP Photo/Ramez Mahmoud ) Palestinians wounded in Israeli strikes are brought to Shifa Hospital in Gaza City on Wednesday, Oct. 11, 2023. (AP Photo/Ali Mahmoud) Palestinians evacuate a building hit in an Israeli bombardment of the Gaza Strip in Rafah on Sunday, Oct. 22, 2023. (AP Photo/Hatem Ali) Palestinians evacuate two wounded boys out of the destruction following Israeli airstrikes on Gaza City, Wednesday, Oct. 25, 2023. (AP Photo/Abed Khaled) Rockets are fired from the Gaza Strip toward Israel over destroyed buildings following Israeli airstrikes on Gaza City, central Gaza Strip, Thursday, Oct. 19, 2023. (AP Photo/Mohammed Dahman) EDS NOTE: GRAPHIC CONTENT - Palestinians carry a dead child that was found under the rubble of a destroyed house following an Israeli airstrike in Gaza City, Saturday, Nov. 4, 2023. (AP Photo/Abed Khaled) Wounded Palestinians lie on the floor in al-Shifa hospital in Gaza City, central Gaza Strip, after arriving from al-Ahli hospital following an explosion there, Tuesday, Oct. 17, 2023. The Hamas-run Health Ministry says an Israeli airstrike caused the explosion that killed hundreds at al-Ahli, but the Israeli military says it was a misfired Palestinian rocket. (AP Photo/Abed Khaled) An Israeli firefighter kneels to compose himself after he and his colleagues extinguished cars set on fire by a rocket fired from the Gaza Strip in Ashkelon, Israel, Monday, Oct. 9, 2023. (AP Photo/Ohad Zwigenberg) Kenzi al Madhoun, a four-year-old who was wounded in an Israeli bombardment, lies at Al Aqsa Hospital in Deir al Balah City, Gaza Strip, Wednesday, Nov. 1, 2023. (AP Photo/Abdel Kareem Hana) Fire and smoke rise following an Israeli airstrike in Gaza City, Sunday, Oct. 8, 2023. (AP Photo/Fatima Shbair) Israeli soldiers move a tank at a staging area near the border with the Gaza Strip in southern Israel on Sunday, Oct. 15, 2023. (AP Photo/Ohad Zwigenberg) Palestinians inspect the rubble of the Yassin Mosque destroyed after it was hit by an Israeli airstrike at Shati refugee camp in Gaza City, early Monday, Oct. 9, 2023. (AP Photo/Adel Hana) Israelis evacuate a site struck by a rocket fired from the Gaza Strip, in Ashkelon, southern Israel, Monday, Oct. 9, 2023. (AP Photo/Ohad Zwigenberg) An Israeli soldier walks by a house destroyed by Hamas militants in kibbutz Be’eri on Wednesday, Oct. 11, 2023. The kibbutz was overrun by Hamas militants from Neraby Gaza Strip Saturday when they killed and captured many Israelis. (AP Photo/Baz Ratner) Israelis take cover from the incoming rocket fire from the Gaza Strip in Ashkelon, southern Israel, Wednesday, Oct. 11, 2023. (AP Photo/Leo Correa) An Israeli soldier mistakenly thinks he hears an air raid siren and jumps to the ground to take cover in kibbutz Be’eri, Israel, Wednesday, Oct. 11, 2023. The kibbutz was overrun by Hamas militants from Neraby Gaza Strip Saturday when they killed and captured many Israelis. (AP Photo/Ohad Zwigenberg) Eli Albag cries over the photograph of his daughter Liri during a protest demanding the release of dozens of Israelis who were abducted during last week’s unprecedented Hamas attack, in Tel Aviv, Israel, Saturday, Oct. 14, 2023. (AP Photo/Francisco Seco) An Israeli soldier hugs his partner near the border with the Gaza Strip, southern Israel, Friday, Oct. 20, 2023. The Israeli military has beefed up ground forces near the Gaza Strip ahead of an expected ground invasion as the latest war between Israel and Hamas militants completes its second week. (AP Photo/Ohad Zwigenberg) Photos of Israelis missing and held captive in Gaza are displayed on a wall in Tel Aviv, Israel, Wednesday, Oct. 18, 2023. The Israeli army says some 200 people were kidnapped and taken to Gaza in Hamas’ cross-border attack on Israel on Oct. 7. (AP Photo/Ohad Zwigenberg) A Palestinian girl reacts as a child is carried from the rubble of a building after an airstrike in Khan Younis, Gaza Strip, Saturday, Oct. 21, 2023. (AP Photo/Fatima Shbair) A wounded Palestinian woman runs away following Israeli airstrikes that targeted her neighborhood in Gaza City on Monday, Oct. 23, 2023. (AP Photo/Abed Khaled) A firefighter and a paramedic deliver oxygen to an injured cat rescued from a building struck by a rocket fired from Gaza, in Tel Aviv, Israel, Friday, Oct. 27, 2023. (AP Photo/Oded Balilty) Israeli security forces inspect charred vehicles burned in the bloody Oct. 7 cross-border attack by Hamas militants outside the town of Netivot, southern Israel. The cars were collected and placed in an area near the Gaza border after the attack, in which 1,400 people were killed and some 240 people were taken hostage. (AP Photo/Ariel Schalit) Palestinians look for survivors following Israeli airstrike in Nusseirat refugee camp, Gaza Strip, Tuesday, Oct. 31, 2023. (AP Photo/Doaa AlBaz) Residents of Kibbutz Kfar Azza bind their hands and wear blindfolds during a rally in solidarity with friends and relatives held hostage in the Gaza Strip, in Tel Aviv, Israel, Thursday, Nov. 2, 2023. Hamas militants overran the small farming community during a bloody cross-border raid from Gaza on Oct. 7. Eighteen residents were kidnapped and taken to Gaza, among them seven children, the youngest three years old. (AP Photo/Oded Balilty) An injured Palestinian boy cries as rescuers try to pull him out of the rubble of a destroyed building following an Israeli airstrike in Bureij refugee camp, Gaza Strip, Thursday, Nov. 2, 2023. (AP Photo/Mohammed Dahman) Israelis take cover in a shelter as a siren sounds a warning of incoming rockets fired from the Gaza strip, in Ashkelon, Israel, Tuesday, Oct. 10, 2023. AP Photo/Ohad Zwigenberg) A boy lights candles in the form of the Star of David in honor of victims of the Hamas attacks during a vigil at the Dizengoff square in central Tel Aviv, Israel, Wednesday, Oct 18, 2023. (AP Photo/Petros Giannakouris) Rockets are fired toward Israel from the Gaza Strip on Sunday, Oct. 8, 2023. (AP Photo/Fatima Shbair) The Israeli Iron Dome air defense system fires to intercept a rocket fired from the Gaza Strip, in central Israel, Sunday, Nov. 5, 2023. (AP Photo/Oded Balilty) A man walks past a newly painted graffiti that reads Hamas equal ISIS, in Tel Aviv, Israel, Monday, Oct. 30, 2023. On Oct. 7, more than 1,400 people, primarily Israeli civilians, were killed and some 230 captured in an unprecedented, cross-border attack by Hamas militants from the Gaza Strip. (AP Photo/Oded Balilty) Antonio Macías’ mother cries over her son’s body covered with the Israeli flag at Pardes Haim cemetery in Kfar Saba, near Tel Aviv, Israel, Sunday, Oct. 15, 2023. Macias was killed by Hamas militants while attending a music festival in southern Israel earlier this month. (AP Photo/Francisco Seco) Palestinians mourn their relatives killed in the Israeli bombardment of the Gaza Strip in front of the morgue in Deir al Balah, Wednesday, Nov. 1, 2023. ( AP Photo/Fatima Shbair) Mourners gather around the five coffins of the Kotz family during their funeral in Gan Yavne, Israel, Tuesday, Oct. 17, 2023. The family was killed by Hamas militants on Oct. 7 at their house in Kibbutz Kfar Azza near the border with the Gaza Strip. More than 1,400 people were killed and some 200 captured in an unprecedented, multi-front attack by the militant group that rules Gaza. (AP Photo/Ohad Zwigenberg) EDS NOTE: GRAPHIC CONTENT - Palestinians stand around the bodies of children killed in the Israeli bombardment of the Gaza Strip in a morgue in Khan Younis, Thursday, Oct. 19, 2023. (AP Photo/Fatima Shbair) Israeli forensic experts work on bodies of Israelis killed by Hamas militants in the National Center for Forensic Medicine in Tel Aviv, Israel, Wednesday, Oct. 18, 2023. (AP Photo/Ohad Zwigenberg) Mourners gather around the graves of British-Israelis Lianne Sharabi and her two daughters, Noiya,16, and Yahel,13, during their funeral in Kfar Harif, Israel, Wednesday, Oct. 25, 2023. Lianne Sharabi and her two daughters were killed by Hamas militants on Oct. 7 in kibbutz Be’eri near the border with the Gaza Strip. More than 1,400 people were killed and some 200 captured in an unprecedented, multi-front attack by the militant group that rules Gaza. (AP Photo/Ariel Schalit) Palestinians mourn their relatives killed in the Israeli bombardment of the Gaza Strip in a morgue in Khan Younis, Sunday, Oct. 29, 2023. ( AP Photo/Fatima Shbair) Friends and relatives of Yonat Or carry her coffin during her funeral at Kibbutz Palmachim, Israel, on Sunday, Oct. 29, 2023. Or was killed by Hamas militants on Oct. 7, in Kibbutz Be’eri near the border with the Gaza Strip. More than 1,400 people were killed and some 220 captured in an unprecedented, multi-front attack on Israel by the militant group that rules Gaza. (AP Photo/Ariel Schalit) Israeli soldiers and Shlomit Lipshitz, center, mother of Staff Sgt. Lavi Lipshitz salutes over her son’s grave during his funeral in the Mount Herzl Military Cemetery in Jerusalem, Wednesday, Nov. 1, 2023. Lipshitz was killed during a ground operation in the Gaza Strip. Israeli ground forces have been operating in Gaza in recent days as Israel presses ahead with its war against Hamas militants. (AP Photo/Ohad Zwigenberg) Mourners embrace during the funeral of Meni and Ayelet Godard, in Kibbutz Palmachim, Israel, Sunday, Oct. 29, 2023. The Israeli couple were killed by Hamas militants on Oct. 7 in kibbutz Be’eri near the border with the Gaza Strip. More than 1,400 people were killed and some 220 captured in an unprecedented, multi-front attack on Israel by the militant group that rules Gaza. (AP Photo/Ariel Schalit) Israeli tanks head towards the Gaza Strip border in southern Israel on Thursday, Oct.12, 2023. (AP Photo/Ohad Zwigenberg) Palestinians displaced by the Israeli bombardment of the Gaza Strip sit by a fire in a UNDP-provided tent camp in Khan Younis, Tuesday, Oct. 31, 2023. (AP Photo/Fatima Shbair) An Israeli man wearing a prayer shawl prays next to houses destroyed by Hamas militants in Kibbutz Be’eri, Israel, Sunday, Oct. 22, 2023. The kibbutz was overrun by Hamas militants from the nearby Gaza Strip on Oct. 7, when they killed and captured many Israelis. (AP Photo/Ariel Schalit) Palestinian woman collects seawater to wash clothes at the beach in Deir al Balah, Gaza Strip, on Thursday, November 2, 2023. (AP Photo/Fatima Shbair) Palestinians walk by the buildings destroyed in the Israeli bombardment on al-Zahra, on the outskirts of Gaza City, Friday, Oct. 20, 2023. (AP Photo/Ali Mahmoud)                                                                                                                                 Death, destruction and despair. For the past month it has reigned on both sides of the border separating Israel and the Gaza Strip. Grief is in the tears of Israelis burying the 1,400 people — mostly civilians, including babies — slain byHamas militants who stormed into Israel on Oct. 7. It is in the anguished screams of Palestinians as the bodies of some of the more than10,000 people reportedly killed by Israeli airstrikes— 40% of them children — are pulled from the wreckage of shattered homes. Images are heart-wrenching and horrific. Palestinians transport a captured Israeli civilian, center, from Kibbutz Kfar Azza into the Gaza Strip on Saturday, Oct. 7, 2023. The militant Hamas rulers of the Gaza Strip carried out an unprecedented, multi-front attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations by air, land, and sea and catching the country off-guard on a major holiday. (AP Photo)  Anelderly Israeli woman is spirited awayfrom a kibbutz to Gaza on the back of a motorcycle, sandwiched between a driver and a militant pointing a rifle to the sky. Israeli soldiers walk past at least nine bodies strewn on a sidewalk next to a bus shelter with bags and belongings scattered around them. A child’s bunk bed is covered in blood. Early scenes of Palestinian men raising their arms in victory atop an Israeli tank set ablaze during the raid quickly give way to ones of devastation:whole blocks of Gaza reduced to black-and-white wastelandsas relentless missile strikes light up the night sky in balls of flame and glowing clouds of smoke. The decapitated dome of Yassin Mosque rests atop the collapsed roof of the house of worship, one of many destroyed in Gaza. In the aftermath of explosions, men dig with bare hands in mountains of shattered concrete blocks in the search for survivors. Palestinians evacuate two wounded boys out of the destruction following Israeli airstrikes on Gaza City, Wednesday, Oct. 25, 2023. (AP Photo/Abed Khaled)  Two wounded boys, one with a trickle of blood running from his scalp, cry as they grasp each while being rushed for help on a stretcher. A rescuer standing near the teeth of a giant backhoe lifts up the limp body of a dead little girl. Two bare feet poke out from under a slab of concrete and rebar next to pair of dirt-covered legs that dangle from the rubble. Thedead are not forgotten. In Israel, the flag-drapedcoffins of five members of a familywhose bodies were found embracing each other in death are laid to rest side-by-side after a military funeral attended by hundreds. In Gaza, adults crowd around the corpses of seven small Palestinian children lying next to each other wrapped in plastic and covered in sheets in the Khan Younis morgue. They would appear to be sleeping if not for the bloodstains on their faces. Palestinian militants drive back to the Gaza Strip with the body of Shani Louk, a German-Israeli dual citizen, on Saturday, Oct. 7, 2023. The militant Hamas rulers of the Gaza Strip carried out an unprecedented, multi-front attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations by air, land, and sea and catching the country off-guard on a major holiday. (AP Photo/Ali Mahmud)  Police officers evacuate a woman and a child from a site hit by a rocket fired from the Gaza Strip in Ashkelon, southern Israel, Saturday, Oct. 7, 2023. (AP Photo/Tsafrir Abayov)  Palestinians transport a captured Israeli civilian, center, from Kibbutz Kfar Azza into the Gaza Strip on Saturday, Oct. 7, 2023. (AP Photo)  Palestinians transport a captured Israeli civilian, center, from Kfar Azza kibbutz into the Gaza Strip on Saturday, Oct. 7, 2023. (AP Photo)  Rockets are fired toward Israel from the Gaza Strip on Saturday, Oct. 7, 2023. (AP Photo/Fatima Shbair)   Israeli soldiers walk by a civilian killed by Hamas militants in Sderot, Israel, on Saturday, Oct. 7, 2023. (AP Photo/Ohad Zwigenberg)  Israelis inspect a damaged residential building after it was hit by a rocket fired from the Gaza Strip, in Ashkelon, Israel, Monday, Oct. 9, 2023. (AP Photo/Erik Marmor)  Smoke rises from an explosion following an Israeli airstrike in the Gaza Strip, as seen from southern Israel, Monday, Oct. 23, 2023. (AP Photo/Ariel Schalit)  Palestinians carry the body of a dead child who was found under the rubble of a destroyed house after Israeli airstrikes on Gaza City, Tuesday, Oct. 24, 2023. (AP Photo/Abed Khaled)  Palestinians inspect the rubble of destroyed buildings following Israeli airstrikes on the town of Khan Younis, southern Gaza Strip, Thursday, Oct. 26, 2023. (AP Photo/Mohammed Dahman)  Fire and smoke rise following an Israeli airstrike in Gaza City, Saturday, Oct. 7, 2023. (AP Photo/Fatima Shbair)  Palestinians evacuate wounded in the Israeli bombardment of Rafah, southern Gaza Strip, Tuesday, Oct. 17, 2023. (AP Photo/Hatem Ali)  Palestinians react after removing a dead body from the rubble of a building after an Israeli airstrike in Jebaliya refugee camp, Gaza Strip, Monday, Oct. 9, 2023. (AP Photo/Ramez Mahmoud )  Palestinians wounded in Israeli strikes are brought to Shifa Hospital in Gaza City on Wednesday, Oct. 11, 2023. (AP Photo/Ali Mahmoud)  Palestinians evacuate a building hit in an Israeli bombardment of the Gaza Strip in Rafah on Sunday, Oct. 22, 2023. (AP Photo/Hatem Ali)  Rockets are fired from the Gaza Strip toward Israel over destroyed buildings following Israeli airstrikes on Gaza City, central Gaza Strip, Thursday, Oct. 19, 2023. (AP Photo/Mohammed Dahman)  EDS NOTE: GRAPHIC CONTENT - Palestinians carry a dead child that was found under the rubble of a destroyed house following an Israeli airstrike in Gaza City, Saturday, Nov. 4, 2023. (AP Photo/Abed Khaled)  Wounded Palestinians lie on the floor in al-Shifa hospital in Gaza City, central Gaza Strip, after arriving from al-Ahli hospital following an explosion there, Tuesday, Oct. 17, 2023. (AP Photo/Abed Khaled)  An Israeli firefighter kneels to compose himself after he and his colleagues extinguished cars set on fire by a rocket fired from the Gaza Strip in Ashkelon, Israel, Monday, Oct. 9, 2023. (AP Photo/Ohad Zwigenberg)  Kenzi al Madhoun, a four-year-old who was wounded in an Israeli bombardment, lies at Al Aqsa Hospital in Deir al Balah City, Gaza Strip, Wednesday, Nov. 1, 2023. (AP Photo/Abdel Kareem Hana)  Fire and smoke rise following an Israeli airstrike in Gaza City, Sunday, Oct. 8, 2023. (AP Photo/Fatima Shbair)  Israeli soldiers move a tank at a staging area near the border with the Gaza Strip in southern Israel on Sunday, Oct. 15, 2023. (AP Photo/Ohad Zwigenberg)  Palestinians inspect the rubble of the Yassin Mosque destroyed after it was hit by an Israeli airstrike at Shati refugee camp in Gaza City, early Monday, Oct. 9, 2023. (AP Photo/Adel Hana)  Israelis evacuate a site struck by a rocket fired from the Gaza Strip, in Ashkelon, southern Israel, Monday, Oct. 9, 2023. (AP Photo/Ohad Zwigenberg)  An Israeli soldier walks by a house destroyed by Hamas militants in kibbutz Be’eri on Wednesday, Oct. 11, 2023. (AP Photo/Baz Ratner)  Israelis take cover from the incoming rocket fire from the Gaza Strip in Ashkelon, southern Israel, Wednesday, Oct. 11, 2023. (AP Photo/Leo Correa)  An Israeli soldier mistakenly thinks he hears an air raid siren and jumps to the ground to take cover in kibbutz Be’eri, Israel, Wednesday, Oct. 11, 2023. (AP Photo/Ohad Zwigenberg)  Eli Albag cries over the photograph of his daughter Liri during a protest demanding the release of dozens of Israelis who were abducted during last week’s unprecedented Hamas attack, in Tel Aviv, Israel, Saturday, Oct. 14, 2023. (AP Photo/Francisco Seco)  An Israeli soldier hugs his partner near the border with the Gaza Strip, southern Israel, Friday, Oct. 20, 2023. (AP Photo/Ohad Zwigenberg)  Photos of Israelis missing and held captive in Gaza are displayed on a wall in Tel Aviv, Israel, Wednesday, Oct. 18, 2023. (AP Photo/Ohad Zwigenberg)  A Palestinian girl reacts as a child is carried from the rubble of a building after an airstrike in Khan Younis, Gaza Strip, Saturday, Oct. 21, 2023. (AP Photo/Fatima Shbair)  A wounded Palestinian woman runs away following Israeli airstrikes that targeted her neighborhood in Gaza City on Monday, Oct. 23, 2023. (AP Photo/Abed Khaled)  Israeli security forces inspect charred vehicles burned in the bloody Oct. 7 cross-border attack by Hamas militants outside the town of Netivot, southern Israel. The cars were collected and placed in an area near the Gaza border after the attack, in which 1,400 people were killed and some 240 people were taken hostage. (AP Photo/Ariel Schalit)  Palestinians look for survivors following Israeli airstrike in Nusseirat refugee camp, Gaza Strip, Tuesday, Oct. 31, 2023. (AP Photo/Doaa AlBaz)  Residents of Kibbutz Kfar Azza bind their hands and wear blindfolds during a rally in solidarity with friends and relatives held hostage in the Gaza Strip, in Tel Aviv, Israel, Thursday, Nov. 2, 2023. (AP Photo/Oded Balilty)  An injured Palestinian boy cries as rescuers try to pull him out of the rubble of a destroyed building following an Israeli airstrike in Bureij refugee camp, Gaza Strip, Thursday, Nov. 2, 2023. (AP Photo/Mohammed Dahman)  Israelis take cover in a shelter as a siren sounds a warning of incoming rockets fired from the Gaza strip, in Ashkelon, Israel, Tuesday, Oct. 10, 2023. AP Photo/Ohad Zwigenberg)  A boy lights candles in the form of the Star of David in honor of victims of the Hamas attacks during a vigil at the Dizengoff square in central Tel Aviv, Israel, Wednesday, Oct 18, 2023. (AP Photo/Petros Giannakouris)  Rockets are fired toward Israel from the Gaza Strip on Sunday, Oct. 8, 2023. (AP Photo/Fatima Shbair)  The Israeli Iron Dome air defense system fires to intercept a rocket fired from the Gaza Strip, in central Israel, Sunday, Nov. 5, 2023. (AP Photo/Oded Balilty)  A man walks past a newly painted graffiti that reads Hamas equal ISIS, in Tel Aviv, Israel, Monday, Oct. 30, 2023. (AP Photo/Oded Balilty)  Antonio Macías’ mother cries over her son’s body covered with the Israeli flag at Pardes Haim cemetery in Kfar Saba, near Tel Aviv, Israel, Sunday, Oct. 15, 2023. Macias was killed by Hamas militants while attending a music festival in southern Israel earlier this month. (AP Photo/Francisco Seco)  Palestinians mourn their relatives killed in the Israeli bombardment of the Gaza Strip in front of the morgue in Deir al Balah, Wednesday, Nov. 1, 2023. ( AP Photo/Fatima Shbair)  Mourners gather around the five coffins of the Kotz family during their funeral in Gan Yavne, Israel, Tuesday, Oct. 17, 2023. (AP Photo/Ohad Zwigenberg)   Mourners gather around the graves of British-Israelis Lianne Sharabi and her two daughters, Noiya,16, and Yahel,13, during their funeral in Kfar Harif, Israel, Wednesday, Oct. 25, 2023. Lianne Sharabi and her two daughters were killed by Hamas militants on Oct. 7 in kibbutz Be’eri near the border with the Gaza Strip. (AP Photo/Ariel Schalit)  Palestinians mourn their relatives killed in the Israeli bombardment of the Gaza Strip in a morgue in Khan Younis, Sunday, Oct. 29, 2023. ( AP Photo/Fatima Shbair)  Friends and relatives of Yonat Or carry her coffin during her funeral at Kibbutz Palmachim, Israel, on Sunday, Oct. 29, 2023. Or was killed by Hamas militants on Oct. 7, in Kibbutz Be’eri near the border with the Gaza Strip. (AP Photo/Ariel Schalit)  Israeli soldiers and Shlomit Lipshitz, center, mother of Staff Sgt. Lavi Lipshitz salutes over her son’s grave during his funeral in the Mount Herzl Military Cemetery in Jerusalem, Wednesday, Nov. 1, 2023. Lipshitz was killed during a ground operation in the Gaza Strip. (AP Photo/Ohad Zwigenberg)  Mourners embrace during the funeral of Meni and Ayelet Godard, in Kibbutz Palmachim, Israel, Sunday, Oct. 29, 2023. The Israeli couple were killed by Hamas militants on Oct. 7 in kibbutz Be’eri near the border with the Gaza Strip. (AP Photo/Ariel Schalit)  Israeli tanks head towards the Gaza Strip border in southern Israel on Thursday, Oct.12, 2023. (AP Photo/Ohad Zwigenberg)  Palestinians displaced by the Israeli bombardment of the Gaza Strip sit by a fire in a UNDP-provided tent camp in Khan Younis, Tuesday, Oct. 31, 2023. (AP Photo/Fatima Shbair)  An Israeli man wearing a prayer shawl prays next to houses destroyed by Hamas militants in Kibbutz Be’eri, Israel, Sunday, Oct. 22, 2023. (AP Photo/Ariel Schalit)  Palestinian woman collects seawater to wash clothes at the beach in Deir al Balah, Gaza Strip, on Thursday, November 2, 2023. (AP Photo/Fatima Shbair)  Palestinians walk by the buildings destroyed in the Israeli bombardment on al-Zahra, on the outskirts of Gaza City, Friday, Oct. 20, 2023. (AP Photo/Ali Mahmoud)  ___ Full AP coverage athttps://apnews.com/hub/israel-hamas-war     Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "gaza_31",
    "corpus": "gaza"
  },
  {
    "url": "https://apnews.com/article/gaza-israel-hamas-ceasefire-334ecc4420fe3b6fce9f7a27ca886b65",
    "title": "Mediators herald Gaza ceasefire and hostage deal. Israel says final details are in flux",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Biden says his administration and Trump’s team were “speaking as one” on the Gaza deal. “This deal was developed and negotiated under my administration,” he said, “but its terms will be implemented for the most part by the next administration.” Israel and Hamas agreed to a ceasefire deal to pause the devastating war in the Gaza Strip, multiple officials announced Wednesday, raising the possibility of winding down the deadliest and most destructive fighting between the bitter enemies. Three officials from the U.S. and one from Hamas confirmed that a deal had been reached, while the office of Israeli Prime Minister Benjamin Netanyahu said final details were still being ironed out. People celebrated in the streets of Deir al-Balah in the Gaza Strip on Wednesday following the announcement by mediators that a ceasefire deal had been reached between Israel and Hamas. Relatives and friends of people killed and abducted by Hamas and taken into Gaza, react to the ceasefire announcement as they take part in a demonstration in Tel Aviv, Israel, Wednesday, Jan. 15, 2025. (AP Photo/Ohad Zwigenberg) Palestinians celebrate the announcement of a ceasefire deal between Hamas and Israel in Deir al-Balah, central Gaza Strip, Wednesday, Jan. 15, 2025. (AP Photo/Abdel Kareem Hana) President Joe Biden, center, with Vice President Kamala Harris, left, and Sec. of State Anthony Blinken, right, speaks in the Cross Hall of the White House on the announcement of a ceasefire deal in Gaza and the release of dozens of hostages after more than 15 months of war, Wednesday, Jan. 15, 2025, in Washington. (AP Photo/Evan Vucci) Relatives and friends of people killed and abducted by Hamas and taken into Gaza, react to the ceasefire announcement as they take part in a demonstration in Tel Aviv, Israel, Wednesday, Jan. 15, 2025. (AP Photo/Oded Balilty) Palestinians celebrate the announcement of a ceasefire deal between Hamas and Israel in Deir al-Balah, central Gaza Strip, Wednesday, Jan. 15, 2025. (AP Photo/Abdel Kareem Hana) Israeli Prime Minister Benjamin Netanyahu speaks during a news conference in Jerusalem, Sept. 2, 2024. (AP Photo/Ohad Zwigenberg, File) Relatives and friends of people killed and abducted by Hamas and taken into Gaza, take part in a demonstration in Tel Aviv, Israel, Wednesday, Jan. 15, 2025. (AP Photo/Oded Balilty) Palestinians celebrate the announcement of a ceasefire deal between Hamas and Israel in Deir al-Balah, central Gaza Strip, Wednesday, Jan. 15, 2025. (AP Photo/Abdel Kareem Hana) A boy looks at the bodies of Palestinians killed in the Israeli bombardment of the Gaza Strip as they are brought for burial at Al-Aqsa Hospital in Deir al-Balah, Wednesday, Jan. 15, 2025. (AP Photo/Abdel Kareem Hana) Rockets fired from Gaza and intercepted by Israel’s Iron Dome anti-missile system over Israeli skies are seen from Gaza City, on May 13, 2023. (AP Photo/Fatima Shbair, File) Palestinians celebrate the imminent announcement of a ceasefire deal between Hamas and Israel in Khan Younis, central Gaza Strip, Wednesday, Jan. 15, 2025.(AP Photo/(AP Photo/Mariam Dagga) Relatives and friends of people killed and abducted by Hamas and taken into Gaza, take part in a demonstration in Tel Aviv, Israel, Wednesday, Jan. 15, 2025. (AP Photo/Ohad Zwigenberg) Palestinians inspect the site of an Israeli strike in Deir Al-Balah in the central Gaza Strip, Wednesday, Jan. 15, 2025. (AP Photo/Abdel Kareem Hana) People visit the site of the Nova music festival, where hundreds of revelers were killed and abducted by Hamas and taken into Gaza, on the one-year anniversary of the attack near Kibbutz Reim, southern Israel, on Oct. 7, 2024. (AP Photo/Ariel Schalit, File) A Palestinian man mourns a relative killed in the Israeli bombardment of the Gaza Strip at a hospital morgue in Deir al-Balah on Aug. 28, 2024. (AP Photo/Abdel Kareem Hana, File) Palestinians walk through the destruction in the wake of an Israeli air and ground offensive in Khan Younis, southern Gaza Strip, on Jan. 7, 2025. (AP Photo/Abdel Kareem Hana, File) Destroyed buildings are seen through the window of an airplane from the U.S. Air Force overflying the Gaza Strip, on March 14, 2024. (AP Photo/Leo Correa, File)                                      ▶Follow AP’s live coverage of the Israel-Hamas ceasefire agreement DOHA, Qatar (AP) — Israel and Hamas have agreed to pausethe devastating warin the Gaza Strip, mediators announced Wednesday, raising the possibility of winding downthe deadliestandmost destructivefighting between the bitter enemies. Thethree-phase ceasefire dealpromises the release of dozens of hostages held by militants in Gaza and hundreds of Palestinian prisoners in Israel, and to allow hundreds of thousands of people displaced in Gaza to return to what remains of their homes. It would also flood desperately needed humanitarian aid into theterritory ravagedby 15 months of war, mediators said. Relatives and friends of people killed and abducted by Hamas and taken into Gaza, react to the ceasefire announcement as they take part in a demonstration in Tel Aviv, Israel, Wednesday, Jan. 15, 2025. (AP Photo/Ohad Zwigenberg)  Palestinians celebrate the announcement of a ceasefire deal between Hamas and Israel in Deir al-Balah, central Gaza Strip, Wednesday, Jan. 15, 2025. (AP Photo/Abdel Kareem Hana)  The prime minister of Qatar, Sheikh Mohammed bin Abdulrahman Al Thani, said the ceasefire would go into effect Sunday and that its success would depend on Israel and Hamas “acting in good faith in order to ensure that this agreement does not collapse.” He spoke in the Qatari capital of Doha, the site of weeks of painstaking negotiations. U.S. President JoeBiden touted the dealfrom Washington, saying the ceasefire would stay in place as long as Israel and Hamas remain at the negotiating table over a long-term truce. Biden credited months of “dogged and painstaking American diplomacy” for landing the deal, noting that his administration and President-elect Donald Trump’s team had been “speaking as one” in the latest negotiations. Israeli Prime Minister Benjamin Netanyahu said late Wednesday that the ceasefire agreement with Hamas was still not complete and final details were being worked out. An Israeli official familiar with the talks who spoke on condition of anonymity said those details center on confirming the list of Palestinian prisoners to be freed. Any agreement must be approved by Netanyahu’s Cabinet.   Israeli Prime Minister Benjamin Netanyahu speaks during a news conference in Jerusalem, Sept. 2, 2024. (AP Photo/Ohad Zwigenberg, File)  Netanyahu thanked Trump and Biden for “advancing” the ceasefire agreement, but did not explicitly say whether he has accepted it, saying he would issue a formal response only “after the final details of the agreement, which are currently being worked on, are completed.”  His measured reaction may reflect domestic politics. Netanyahu’s governing coalition depends on the support of two hard-line factions whose leaders have threatened to leave the government over the planned release of Palestinian prisoners. Although opposition leaders have vowed to support the ceasefire deal, the loss of his hard-line allies could lead to the collapse of the coalition and trigger early elections. Early Thursday morning, Netanyahu’s office issued a statement accusing Hamas of backtracking on an earlier understanding that he said would give Israel a veto over which prisoners accused of murder would be released. Netanyahu said he told the negotiators to stand firm on the earlier agreement. Hamas did not immediately respond. Earlier, Israeli President Isaac Herzog called on Netanyahu’s government to approve the ceasefire in a nationally televised speech. Hamas said in a statement the ceasefire was “the result of the legendary resilience of our great Palestinian people and our valiant resistance in the Gaza Strip.”  Palestinians walk through the destruction in the wake of an Israeli air and ground offensive in Khan Younis, southern Gaza Strip, on Jan. 7, 2025. (AP Photo/Abdel Kareem Hana, File)  Mediators from Egypt, Qatar and the U.S. are to meet in Cairo on Thursday for talks on implementing the deal, according to a senior U.S. official who was not authorized to comment publicly and spoke on the condition of anonymity. Once the first phase of the deal takes effect, it is expected to deliver an initial six-week halt to fighting along with the opening of negotiations on ending the war altogether. Over those six weeks, 33 of the nearly 100 hostages are to be reunited with their loved ones after months in captivity with no contact with the outside world, though it’s unclear if all are alive. It remained unclear exactly when and how many displaced Palestinians would be able to return to their homes, and whether the agreement would lead to a complete end to the war and the full withdrawal of Israeli troops from Gaza — key Hamas demands for releasing the remaining captives. Many longer-term questions aboutpostwar Gazaremain, including who will rule the territory or oversee the daunting task of reconstruction after a brutal conflict that hasdestabilized the broader Middle Eastandsparked worldwide protests. Hamas triggered the war with its Oct. 7, 2023, cross-border attack, which killed some 1,200 in Israel and took 250 others hostage. Israel responded with a fierce offensive that has killed over 46,000 Palestinians, according to local health officials, who do not distinguish between civilians and militants but say women and children make up more than half of those killed. More than 100 hostages were freed from Gaza in a weeklong truce in November 2023.  Palestinians celebrate the announcement of a ceasefire deal between Hamas and Israel in Deir al-Balah, central Gaza Strip, Wednesday, Jan. 15, 2025. (AP Photo/Abdel Kareem Hana)  The U.S., along with Egypt and Qatar, have brokered months of indirect talks between the bitter enemies that finally culminated in this latest deal. It comes after Israel and the Lebanese militant group Hezbollahagreed to a ceasefirein November, after more than a year of conflict linked to the war in Gaza. U.N. and international relief organizations estimate some 90% of Gaza’s 2.3 million people have been displaced, often multiple times. They say tens of thousands of homes have been destroyed and hospitals are barely functioning. Experts have warned thatfamine may be underway in northern Gaza. Abed Radwan, a Palestinian father of three, called the ceasefire deal “the best day in my life and the life of the Gaza people. ... Thank God. Thank God.” Radwan, who has been displaced from the town of Beit Lahiya for over a year and has been sheltering in Gaza City, said he hopes to return and to rebuild his home. As he spoke to AP by phone, his voice was overshadowed by the celebrations of fellow Gazans.  Relatives and friends of people killed and abducted by Hamas and taken into Gaza, react to the ceasefire announcement as they take part in a demonstration in Tel Aviv, Israel, Wednesday, Jan. 15, 2025. (AP Photo/Oded Balilty)  “People are crying here. They don’t believe it’s true,” he said. In Israel, hundreds of demonstrators gathered outside Israel’s military headquarters in Tel Aviv, calling for a deal to be completed. Many held posters of hostages, others hoisted candles in the air. As the deal was announced, some people were unaware it had gone through. Sharone Lifschitz, whose father Oded is being held in Gaza, told the AP by phone she was stunned and grateful but won’t believe it until she sees all the hostages come home. “I’m so desperate to see them, if by some miracle my father has survived,” she said. The Hostage Families Forum, which has long pressed Israeli leaders to make a deal that would bring the captives home, said it welcomed Wednesday’s announcement with joy and relief. “After 460 days of our family members being held in Hamas tunnels, we are closer than ever to reuniting with our loved ones,” it said in a statement. Biden, who has provided crucial military aid to Israel but expressed exasperation over civilian deaths in Gaza, announcedthe outline of the three-phase ceasefire agreementon May 31. The agreement eventually agreed to followed that framework. He said the first phase would last for six weeks and include a “full and complete ceasefire,” a withdrawal of Israeli forces from densely populated areas of Gaza and the release of a number of hostages, including women, older adults and wounded people, in exchange for the release of hundreds of Palestinian prisoners. Humanitarian assistance would surge, with hundreds of trucks entering Gaza each day. The second and most difficult phase would include the release of all remaining living hostages, including male soldiers, and Israeli forces would withdraw from Gaza. The third phase calls for the start of major reconstruction of Gaza, which faces decades of rebuilding from devastation caused by the war. Hamas had been demanding assurances of a permanent end to the war and complete withdrawal of all Israeli forces from Gaza. Israel, meanwhile, has repeatedly said it would not halt the war until it destroys Hamas’ military and governing capabilities. With Biden’sdays in office numberedand Trump set to take over, both sides had been under pressure to agree to a deal. President Joe Biden, center, with Vice President Kamala Harris, left, and Sec. of State Anthony Blinken, right, speaks in the Cross Hall of the White House on the announcement of a ceasefire deal in Gaza and the release of dozens of hostages after more than 15 months of war, Wednesday, Jan. 15, 2025, in Washington. (AP Photo/Evan Vucci)  Trump celebrated the agreement, posting on his Truth Social social media platform: “WE HAVE A DEAL FOR THE HOSTAGES IN THE MIDDLE EAST. THEY WILL BE RELEASED SHORTLY. THANK YOU!” Jonathan Panikoff, director of the Scowcroft Middle East Security Initiative at the Atlantic Council, said Biden deserves praise for continuing to push the talks. But Trump’s threats to Hamas and his efforts to “cajole” Netanyahu deserve credit as well. “The ironic reality is that at a time of heightened partisanship even over foreign policy, the deal represents how much more powerful and influential U.S. foreign policy can be when it’s bipartisan,” Panikoff said. Hezbollah’s acceptance of a ceasefire in Lebanon after it had suffered heavy blows, and the overthrow of President Bashar Assad in Syria, were both major setbacksfor Iran and its alliesacross the region, including Hamas, which was left increasingly isolated. Israel has come under heavy international criticism, including from its closest ally, the United States, over the civilian toll in Gaza. Israel says it has killed around 17,000 militants — though it has not provided evidence to support the claim. It also blames Hamas for the civilian casualties, accusing it of using schools, hospitals and residential areas for military purposes. The International Court of Justiceis investigating allegations brought by South Africa that Israel has committed genocide. The International Criminal Court, a separate body also based in The Hague,has issued arrest warrantsfor Netanyahu, his former defense minister and a Hamas commander for war crimes and crimes against humanity linked to the war. Israel and the United States have condemned the actions taken by both courts. Netanyahu also facedgreat domestic pressureto bring home the hostages. Their families have become a powerful lobbying group with wide public support backed by months of mass protests urging the government to reach a deal with Hamas. Relatives of Israelis held hostage by Hamas in the Gaza Strip and their supporters protest outside of the hotel where U.S. Secretary of State Antony Blinken is staying during a visit with Israeli leadership in Tel Aviv, on Oct. 22, 2024. (AP Photo/Maya Alleruzzo, File)  Israeli authorities have already concluded that more than a third of the roughly 100 remaining people held captive are dead, and there are fears that others are no longer alive. A series of videos released by Hamas showing surviving hostages in distress, combined with news that a growing number of abducted Israelis have died, put added pressure on the Israeli leader. Hamas,a militant group that does not accept Israel’s existence, has come under overwhelming pressure from Israeli military operations, including the invasion of Gaza’s largest cities and towns and the takeover of the border between Gaza and Egypt. Its top leaders,including Yahya Sinwar, who was believed to have helped mastermind the Oct. 7, 2023, attack, have been killed. But its fighters have regrouped in some of the hardest-hit areas after the withdrawal of Israeli forces, raising the prospect of a prolonged insurgency if the war continues. Netanyahu has vowed to continue the war until Hamas’ military and governing capabilities are destroyed. But it has never been clear what that would entail or if it’s even possible, given the group’s deep roots in Palestinian society, its presence in Lebanon and the occupied West Bank, and its exiled leadership. Both sides still face many difficult and unanswered questions. As the war winds down, Netanyahu will face growing calls for postwar investigations that could find him at least partially responsible forthe security failures of Oct. 7— the worst in Israel’s history. His far-right governing partners, who opposed a ceasefire deal, could also bring down the coalition and push the country into early elections. There is still no plan for who will govern Gaza after the war. Israel has said it will work with local Palestinians not affiliated with Hamas or the Western-backed Palestinian Authority. But it’s unclear if such partners exist, and Hamas has threatened anyone who cooperates with Israeli forces. The United States has tried to advance sweeping postwar plans fora reformed Palestinian Authorityto govern Gaza with Arab and international assistance. As part of those plans, the U.S. hopes Saudi Arabia wouldnormalize relations with Israelin return for U.S. security guarantees and aid in setting up a civilian nuclear program. Destroyed buildings are seen through the window of an airplane from the U.S. Air Force overflying the Gaza Strip, on March 14, 2024. (AP Photo/Leo Correa, File)  But those plans depend on credible progress toward the creation of a Palestinian state, something Netanyahu and much of Israel’s political class oppose. Netanyahu has said Israel will maintain open-ended security control over Gaza as well as the occupied West Bank, territories captured by Israel in the 1967 war that the Palestinians want for their future state. ___ Federman reported from Jerusalem. Magdy reported from Cairo. Fatma Khaled in Cairo, Sam Mednick in Tel Aviv, Wafaa Shurafa in Deir al-Balah, Gaza Strip, and Aamer Madhani, Zeke Miller, Matthew Lee and Ellen Knickmeyer in Washington, contributed.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "gaza_38",
    "corpus": "gaza"
  },
  {
    "url": "https://www.independent.co.uk/news/world/middle-east/raed-saed-dead-hamas-gaza-israel-strikeb2883969.html",
    "title": "Hamas commander behind October 7 attacks ‘killed by Israel in Gaza’",
    "text": "Notifications can be managed in browser preferences. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Swipe for next article Hamas commander Raed Saed was one of the architects of the October 7 attacks Removed from bookmarks I would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice The Israeli military killed senior Hamas commander Raed Saed, one of the architects of the October 7, 2023, attacks on Israel, several media outlets reported on Saturday. He was killed in a strike on a car in Gaza City on Saturday, sources said The attack killed four people and wounded at least 25 others, according to Gaza health authorities. There was no immediate confirmation from Hamas or medics that Saed was among the dead. The Israeli military said it had targeted a senior Hamas commander in Gaza City, without giving a name or details. If Saed was killed, it would be the highest-profile assassination of a senior Hamas figure since aceasefire deal came into effect in October. An Israeli defence official said Saed had been targetted in the attack, describing him as the head of Hamas' weapons manufacturing force. Hamas sources have also described him as the second-in-command of the group's armed wing, after Izz eldeen Al-Hadad. Saed used to head Hamas' Gaza City battalion, one of the group's largest and best-equipped, those sources said. The Israeli military said that earlier two soldiers were injured by an explosive device that \"detonated during an operation to clear the area\" of militant infrastructure. It was not immediately clear whether the two incidents were related. The war in Gaza began after Hamas-led militants killed 1,200 people, most of them civilians, and seized 251 hostages in an attack on southern Israel on October 7, 2023. Israel's retaliatory offensive has killed more than 70,700 Palestinians, most of them civilians, health officials in Gaza say. The October 10 ceasefire has enabled hundreds of thousands of Palestinians to return to Gaza City's ruins. Israel has pulled troops back from city positions, and aid flows have increased. But violence has not completely halted. Palestinian health authorities say Israeli forces have killed at least 386 people in strikes in Gaza since the truce. Israel says three of its soldiers have been killed since the ceasefire began, and it has attacked scores of fighters. Join thought-provoking conversations, follow other Independent readers and see their replies Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in",
    "id": "gaza_39",
    "corpus": "gaza"
  },
  {
    "url": "https://www.independent.co.uk/news/world/middle-east/two-years-israel-october-7-b2840385.html",
    "title": "For the past two years in Israel, every day has been October 7",
    "text": "Notifications can be managed in browser preferences. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Swipe for next article In a highly personal piece, author and filmmakerGary Cohenwrites about what it feels like to live in Israel two years on after the Hamas atrocities and see the world forget the 1,200 innocent people who lost their lives Today is October 7. Yesterday was October 7. Tomorrow will be October 7. For the past two years inIsrael, every day has been October 7. We are suspended in time until every hostage is returned and this war ends. Only then can we finally move on with our lives. From here, it appears the world has either forgotten or chosen to dismiss the atrocities of that infamous day, perfectly exemplified by the BBC’s highest-paid presenter at the time, Gary Lineker, who once referred to October 7 as “theHamasthing”. Well, the “Hamas thing” is not a thing. It is the greatest disaster ever to befall the Jewish state. The largest and most savage slaughter of Jews since the Holocaust. Taken as a percentage of the population, it is also the biggest terror attack in modern history. To put that in perspective, in the UK it would equate to more than 8,000 dead, 30,000 injured and close to 2,000 kidnapped. Can you imagine such a thing happening, say, at Glastonbury and the surrounding area? What would Britain’s reaction be, I wonder. Today, Israel is demonised and delegitimised and October 7 is paid little more than lip service. Truth and morality are inverted. False narratives and Jew-hatred are embraced. The brutal attack on aManchester Synagoguewas an inevitable consequence. There is a profound lack of understanding, let alone empathy or sympathy, for what Israelis truly endured on October 7 and in its aftermath. From the outset, the inclination among many was to cast doubt on the massacre, despiteHamaslive-streaming its atrocities to the world. Some preferred simply to deny it altogether. If it never happened, the world wouldn't have to deal with it. And clearly, the world did not want to deal with it. Perhaps those outside Israel can’t fathom the scale and savagery of the attack, or the collective trauma and reverberations that continue. As the saying goes, “you had to be there”. If you were, you’d know what it’s like to watch them bury two of your daughter’s closest friends. Two beautiful souls, who grew up in your house, who went to a music festival to dance, but never made it home. One of them, her body so badly broken she had to be buried in a coffin. Jews are normally buried in a shroud. You’d know what it was to hug their parents tight, then look them in the eye, knowing no words can suffice. My daughter sold her Nova ticket the night before. She wasn’t feeling well. I cannot shake the thought that she could so easily have been with her friends. When the rockets started at 6.29am, and chaos erupted, her friends made it to the car and tried to head home. Police stopped them, warning that there were terrorists on the road ahead. No one realised the scale of the attack or how many terrorists had entered Israel. The police recommended they take cover in one of the nearby bus-stop shelters. The terrorists found them. It was a bloodbath. They never stood a chance. Out of forty crammed into the shelter, only eleven escaped with their lives. I watched my daughter and her friends trawl through the most horrific videos of Hamas atrocities on Telegram, as so many Israelis did in the immediate aftermath, desperately searching for any trace of their loved ones among the carnage. Those images can never be unseen. I sat with the third friend who had been with them in the shelter, a survivor and witness to the slaughter. He survived lying under a pile of dead bodies in a pool of blood for over seven hours, defying never-ending blasts of machine gun fire and exploding grenades. When I tell him how glad everyone is to see him alive, and that he made it home. I see in his eyes, he’s not so sure. It’s impossible to grasp the collective trauma of a country so small and intimate, where everyone knows everyone, and everything that happens, happens to us all. The degrees of separation in Israel are two, three at most, not the commonly accepted six. We have been forced to grasp the evil of men who restrained women, binding their hands and feet often behind their backs, prior to their abduction or killing. We have had to process images of them with their legs spread or bent over, their bodies carrying stab wounds, burns, lacerations and abrasions. Who can imagine a human being who rapes his victim, shoots her in the head, and continues to violate her? How do you believe the cruelty of those who murder children in front of their parents,and parents in front of their children, before burning entire families alive? You don’t want to think about the images of an infant riddled with bullets, soldiers beheaded, young people set alight. These people, these monsters, the ones you cannot imagine, cannot process, and don’t want to think about… They are our neighbours. On October 7, over 5,000 of them broke into our homes and committed these atrocities. This is our reality. Notslogans. Not propaganda. Flesh and blood. Lives ended, families torn apart. Survivors, and indeed a whole country scarred for life. We don’t indulge in victimhood. We don’t have that luxury. We bury our dead, tend to our wounded, take a breath, and carry on. Communities razed to the ground are being rebuilt. Parents and family members who lost loved ones work tirelessly to free the remaining hostages. They lead the fight for the rights of survivors and the bereaved against endless government bureaucracy. For many, the Netanyahu government is part of the problem, not the solution. Survivors and their families feel betrayed by a leadership that shirks responsibility for the gross failures of October 7. It is a government that plays politics with their suffering, the plight of the hostages, and the ongoing war in Gaza. But we are also dumbfounded by the world’s reaction. We struggle to comprehend how the slaughter could be so easily dismissed. How women’s groups could refuse to acknowledge the rape and sexual violence committed by Hamas. How the hostages held in Hamas dungeons, starved and tortured, could be forgotten, the yellow ribbons quietly tied to railings to remember them, loudly cut down. We watch, bewildered, as, from the very beginning, week after week, crowds across the West pour into the streets, not to mourn the slaughter of innocent Israelis and foreign nationals, but to call for Israel’s destruction and the death of Jews. In any other reality, the murder of hundreds of young people at a music festival would unite the music world in empathy and remembrance. In the wake of the massacre at the Nova Festival, during a concert in Vegas, Bono changed the lyrics to the first verse of U2’s “Pride”, dedicating the performance to the victims. But this was one rare display of humanity towards the Israelis who lost their lives that day. By Glastonbury the victims of the Nova festival weren’t remembered, instead, the UK’s largest music festival provided a platform to those promoting hatred towards Jews. On the kibbutzim that were attacked, so many of those murdered were at the heart of the peace movement, people who had spent their lives advocating for Palestinian rights and a two-state solution. These were Israelis who dreamed of coexistence, but were butchered like sheep. Thirty-nine children, as young as three months old, were slaughtered. This is evil beyond comprehension. Perhaps simply too much for the world to digest, where looking away is just easier. There are mountains to climb. The psychological toll is immense. One survivor and eight family members of those murdered at the Nova festival, have taken their own lives. Most are somehow finding their way back to life, to work, to classrooms and more. Soldiers fighting at the front, attend funerals of fallen comrades, then return straight to the battlefield. Reservists are exhausted, their families too. Yet they continue to serve. Hamas has promised to repeat October 7 “again and again.” We take them at their word. This is our truth. We want our children back. We want our people safe. We have an obligation to bring the hostages home, to protect our families, defend our homes, and restore some semblance of normality. Golda Meir said it best: “If we have to have a choice between being dead and pitied, and being alive with a bad image, we’d rather be alive and have the bad image.” That is why we fight and Hamas must be eradicated, so it can never again pour across our border to rape, mutilate and butcher. There can be no rockets, no more threats of any kind. Gaza suffers terribly. Nobody denies it. According to the Hamas health ministry, 66,000 Gazan lives have been lost, but Hamas could end this war today. They could have done so at any time in the past two years, by releasing all hostages and laying down arms. How many innocent lives could have been saved? Instead, Hamas chose to brutalise, exploit, and sacrifice ordinary Gazans. For many here, it’s a bitter irony that the clearest path to ending this nightmare comes not from Jerusalem, but from abroad. Ordinary Israelis find themselves looking to Washington, not their own government, for leadership. That speaks volumes. The deal on the table could offer ordinary Gazans a way out, a chance to escape the brutality and oppression of Hamas, to rebuild their homes and their lives. Gaza lies in ruins, the result of a brutal and costly war. The task before them is immense. But it offers hope; rebuilding over continued conflict and destruction. Today, in Israel, peace activists are questioning their core beliefs. The depth of the hatred toward Israelis and Jews, means the majority of Israelis no longer believe peace with the Palestinians is possible, at least not with this generation. The day after, for both Israelis and Palestinians, will be long and hard. However, predicting the future in the Middle East is the pursuit of fools. If you live in this part of the world, you best be an optimist, but one that lives in reality, while hoping and working for something better. When the hostages are home, when this war ends, when Israelis finally emerge from the trauma of October 7, the longest and darkest chapter in our history, only then can the healing begin. And when that day comes, from our perspective, it will not be thanks to the international community, but rather in spite of it. You can read more from Gary Cohen on his substack:https://gc22.substack.com/about Join thought-provoking conversations, follow other Independent readers and see their replies Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in",
    "id": "gaza_40",
    "corpus": "gaza"
  },
  {
    "url": "https://www.the-independent.com/news/world/middle-east/gaza-october-7-anniversary-ceasefiretalks-israel-b2840342.html",
    "title": "Two years of unprecedented bloodshed in Gaza: ‘Our greatest hope is that this nightmare will end’",
    "text": "Notifications can be managed in browser preferences. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Swipe for next article Two years on from the brutal Hamas killings of October 7 and Israel’s retaliatory bombings, life in Gaza has been a hellscape of death and famine, reportNedal Hamdounain Gaza and chief international correspondentBel Trew Removed from bookmarks I would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice For two years, the people ofGazahave endured one of the most devastating bombardments and humanitarian catastrophes of our time. Israel’s offensive and siege of the enclave, launched in the bloody aftermath ofHamas’s October 7 attacks, has killed more than 67,000 people, including at least 19,000 children, according to local officials. A United Nations-backed global hunger monitor has concluded that thebombingand blockade have led tofamine spreading across the strip. Nearly the entire population of 2.3 million have beenforced to flee – often multiple times– and more than 90 per cent ofGaza’s homes have been damaged or destroyed, according to the UN. The situation is so dire that a UN commission of inquiry concluded last month thatIsrael has committed, and continues to commit, genocide in Gaza –a charge theIsraeligovernment vehemently denies. On the two-year anniversary of the start of this unprecedented bloodshed, families in Gaza describe a “glimmer of hope” as negotiators from Hamas andIsraelmeet in Egypt to try and reach a ceasefire and hostage release deal, off the back of US president Donald Trump’s 20-point peace plan. As Basel al-Saqa, 32 a father of two, tellsThe Independentfrom his tent in southern Gaza: “A ceasefire means that the land that has burned for so long can breathe again.” As the world hopes for a breakthrough, families describe their struggle over the last two years and their desperation for an end to the nightmare. Dr Mohammed Abu Salmiya, director of Al-Shifa hospital, the largest medical complex in Gaza. Dr Abu Salmiya not only manages one of the most important hospitals in Gaza, which Israeli forces have repeatedly bombed, besieged and raided, but he says he has been arrested, detainedand abused by Israel for months. His staff members and colleagues, like Dr Adnan al-Bursh, the celebrated head of orthopaedics, died in Israeli detention in 2024, reportedly from torture. But despite this, after being released back into Gaza last year, Dr Abu Salmiya has remained at the helm of al-Shifa, rebuilding it from the ashes in Gaza City, which has become the epicentre of Benjamin Netanyahu’s widely condemned new offensive. Israel has repeatedly denied targeting Gaza’s medical facilities. But Israeli attacks on Gaza’s hospitals and medics are so acute that a UN Commission of Inquiryconcluded at the end of 2024that Israel has committedwarcrimes and the crime against humanity of extermination as it pursued “a concerted policy to destroy Gaza’s healthcare system”. Al-Shifa first became the focus of ferocious assault early on in the war, after Israel accused Hamas of using it as a main military command and control centre despite providing little credible evidence. It was raided, besieged and then emptied by the end of 2023. Dr Abu Salmiya was arrested alongside other doctors and detained for seven months. When released, he spoke of torture and abuse behind bars. “When we returned there was nothing recognisable. But we restored the emergency department, the dialysis department, and opened 300 beds, a 13-bed intensive care unit, and operating room,” he says. Since then he describes “ferrying premature newborns” around the complex as it was bombed and as they were chased by quadcopters. Now he worries about the future as the violence has not abated despite talks for a truce underway in Egypt. “During the last four days it has been impossible. We found no food, no drink, no bread. We survived on a few dates – staff and patient,” he adds. “After Israel invaded Gaza City recently we were shocked. Now, our fears are that the occupation will come and destroy the hospital again.” Buthaina al-Attar, 26, is a mother of four children, displaced from northern Gaza. Buthaina lived through the unimaginable horror of being pregnant during a UN-declared famine and giving birth in a hospital as it was bombed. The danger was so acute that the day after her emergency C-section in May, the starved mother was stitched up and forced to flee the hospital on foot, with only limited pain relief. The United Nations has reported that due to Israel’s repeated bombardment and full blockades on Gaza that spark widespread famine, a quarter of all pregnant women are acutely malnourished, with risk of miscarriages. Images of emaciated babies and children, their bones cutting through their skin, have been shared, shocking the world. Buthaina says she survived on a single plate of rice and scraps of pasta she shared with her children, but hunger devastated her health and stunted the growth of her baby. When he was born, he weighed just 2kg, less than half the average weight of a newborn in the UK. “It was a moment filled with fear, terror, and anxiety,” she recalls, describing giving birth under fire. As her baby was delivered by emergency C-section at Al-Awda Hospital in northern Gaza, an Israeli tank shell struck the obstetrics and gynaecology department. Minutes later, a four-storey building next to the hospital was also targeted. “Glass and rubble from the blast fell onto the hospital,” she says. “At that point, the doctor told us we had to leave because the situation was too dangerous. The ambulances were overwhelmed.” Barely recovered from major surgery, she had to leave on foot: “I walked like a toddler taking her first steps, suffering from severe pain.” Buthaina spent days on the move, trying to find a tent or any kind of shelter. Sick with a severe infection from surgery and malnourished, she couldn’t breastfeed and had no access to baby formula. Twenty days after her son was born, her mother – who had been helping with the children – returned to northern Gaza to try to find food. She never came back. The family still doesn’t know what happened; whether she was taken or killed. Now, Buthaina is desperate for a ceasefire: “We need a ceasefire as soon as possible. So that we can return to normal life and raise our children away from war, hunger and thirst.” Fatima Abu Nadi, 35, is a journalist working for the Kuwaiti newspaper Al-Mujtama. For nearly two years, Fatima has not only reported on thewarin Gaza, but lived it – suffering multiple losses, including the killing of her father. According toAmnesty International, Israeli strikeshave killed more than 240 journalists and media workerssince Israel launched its heaviest-ever bombardment of Gaza in October 2023, following Hamas militants’ deadly attacks in southern Israel. The global rights group added that no conflict in modern history has seen a higher number of journalists killed, making Gaza the deadliest place on earth for reporters. Fatima began the war working for a French news agency, which abruptly dropped her and cut communication while she was reporting on rising malnutrition in Nasser Hospital in central Gaza in November 2023, amid growing chaos and an unfolding famine. With no salary and no severance, she struggled to support 15 family members. Basic necessities, like baby nappies for her nephew, were costing $100 (£74.50). The job loss came just a month after her father was killed in an Israeli airstrike in the northern Gaza Strip. At the time, Fatima and her family had been displaced to Rafah. Her father had insisted on staying behind to protect their property. She said his body was so badly mutilated by the strike that medics shielded the family from seeing the photos. “He was a part of my soul, and I lost it,” she says. “He supported me in my master’s, my education, and in the beginning of my journalism career.” Despite the difficulties, she remains a journalist: honouring his last request to her, made in their final phone call days before his death, to continue her work and to help others. But after surviving so many displacements, one night recently she collapsed. She sobbed uncontrollably until her mother found her and tried to calm her down. “These moments are beyond capacity, energy, and patience,” she says. “I’ve stopped crying, but my heart still aches.” “Now we are on the second anniversary of the war. Our greatest hope is that it will end,” she says. Join thought-provoking conversations, follow other Independent readers and see their replies Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in",
    "id": "gaza_41",
    "corpus": "gaza"
  },
  {
    "url": "https://www.independent.co.uk/news/gaza-israeli-palestinians-hamas-gaza-strip-b2888111.html",
    "title": "Israeli fire kills at least 5 Palestinians in Gaza, a hospital in the enclave says",
    "text": "Notifications can be managed in browser preferences. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Swipe for next article Removed from bookmarks I would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice Israelitroops fired over the ceasefire line in the northernGaza Stripon Friday, killing at least fivePalestinians, including a baby, according to a local hospital that received the casualties. The killings came as the tenuous Israel-Hamastruce has stalled in recent weeks. The five died in Tuffah, an eastern neighborhood in Gaza City, said Rami Mhanna, managing director of Shifa Hospital. Israel’s military said troops identified “a number of suspicious individuals … in command structures west of the Yellow Line,” and fired at them. The incident is under review and the military \"regrets any harm to uninvolved individuals,” it added. The Yellow Line divides the Israeli-held part of Gaza from the rest of the territory, and was drawn under the U.S.-brokered ceasefire agreement that went into effect in October. Also Friday, U.S. President Donald Trump’s Mideast envoy Steve Witkoff was planning to host in Florida top officials from Middle Eastern countries mediating the Gaza ceasefire, according to a U.S. official. The talks are an effort to push the ceasefire into its second, much more complex phase. The first phase began in October, days after the two-year anniversary of the initial Hamas-led attack on Israel that killed around 1,200 people. All but one of the 251 hostages taken that day have been released, alive or dead, in exchange for Palestinian prisoners and detainees. The war in Gaza has killed more than 70,660 Palestinians, roughly half of them women and children, according to the territory’s Health Ministry, which does not distinguish between militants and civilians in its count. The ministry, which operates under the Hamas-run government, is staffed by medical professionals and maintains detailed records viewed as generally reliable by the international community. Though the ceasefire, now in its third month, has mostly held, its progress has slowed amid accusations of violations by both sides. The second phase of the deal is supposed to involve even bigger challenges — the deployment of an international stabilization force, a technocratic governing body for Gaza, the disarmament of Hamas and further Israeli troop withdrawals from the territory. ___ Find more of AP’s Israel-Hamas coverage at https://apnews.com/hub/israel-hamas-war Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in",
    "id": "gaza_42",
    "corpus": "gaza"
  },
  {
    "url": "https://www.independent.co.uk/news/hamas-palestinian-israel-gaza-city-committee-to-protectjournalists-b2840727.html",
    "title": "These numbers show how 2 years of war have devastated Palestinian lives in Gaza",
    "text": "Notifications can be managed in browser preferences. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Swipe for next article Removed from bookmarks I would like to be emailed about offers, events and updates from The Independent. Read ourPrivacy notice Numbers alone cannot capture the toll the Israel-Hamaswar has taken on the Gaza Strip. But they can help us understand how thoroughly the conflict has upended the lives of 2.1 millionPalestiniansliving in the territory and decimated the territory’s 365 square kilometers (140 square miles). Out of every 10 people, one has been killed or injured in anIsraelistrike. Nine are displaced. At least three have not eaten for days. Out of every 100 children, four have lost either one or both parents. Out of every 10 buildings that stood in Gaza prewar, eight are either damaged or flattened. Out of every 10 homes, nine are wrecked. Out of every 10 acres of cropland, eight are razed (more than three out of every four hectares). The war began when Hamas militants launched a surprise attack on Israel on Oct. 7, 2023, killing some 1,200 people, mainly civilians, and taking 251 hostages back to Gaza. In response, Israeli leaders promised a punishing offensive on the strip to annihilate Hamas and free the hostages. Here’s a closer look at the devastation that followed, by the numbers. Roughly 11% of Gaza’s population has been killed or injured Cemeteries are overflowing. Mass graves dot the strip. Israeli airstrikes have killed entire families in their homes. More than 2,000 people seeking food have been killed, according to Gaza's Health Ministry. In some cases Israel has acknowledged firing warning shots at chaotic crowds attempting to obtain desperately needed aid. Israeli attacks on health care facilities and limitations on the entry of medical supplies have left overwhelmed doctors to treat advanced burn victims with rudimentary equipment. Israel says it strikes hospitals because Hamas operates in them and uses them as command centers, though it has offered limited evidence. Hamas security personnel have been seen in hospitals and have kept some areas inaccessible. Israel has said restrictions on imports are needed to prevent Hamas from obtaining arms. The war is the deadliest conflict for journalists, health workers and U.N. aid workers in history, according to theCommittee to Protect Journalistsand the U.N. The British Medical Journal says the prevalence of patients with injuries from explosives in Gaza compares to data on injured U.S. combat forces in Iraq and Afghanistan. In all, Israel’s campaign has killed more than 67,000 Palestinians and wounded nearly 170,000, according to Gaza’s Health Ministry. More than 40,000 of those wounded have life-altering injuries, according to the World Health Organization. The death toll does not include the thousands of people believed buried under the rubble. The ministry — part of the Hamas-run government and staffed by medical professionals — does not distinguish between civilians and combatants in its count. Its figures are seen as a reliable estimate by the U.N. and many independent experts. Israel blames Hamas for the high civilian toll, saying the group’s presence in residential areas has turned the population into human shields. Still, its strikes often hit homes, killing many inside with no word of who the target was. Nearly the entire population is displaced and thousands are missing Countless Palestinian families have fled the length of Gaza and back, forced to move every few months to dodge successive Israeli offensives. Many have been displaced multiple times, moving between apartments and makeshift tent camps as they try to survive. Squalid tent cities now sprawl across much of Gaza’s south. Displacements have separated families. Heavy bombardment has left thousands buried under the rubble. Troops round up and detain men, from dozens to several hundreds at a time, searching for any they suspect of Hamas ties. The result is families split apart. Israel occupies the vast majority of Gaza Israel’s military has gained control of the vast majority of Gaza, pushing most of the Palestinian population to a small zone along the southern coast. Under Israeli control, Gaza’s land has been transformed. Forces have flattened or bulldozed entire neighborhoods ofGaza Cityand small agricultural towns dotting the border, carved new roads across the territory and built up new military posts. Bombardment has carpeted the Gaza Strip in a blanket of rubble roughly 12 times the size of the Great Pyramid of Giza. Using imagery of Gaza from space, the U.N.’s Satellite Center says that at least 102,067 buildings have been destroyed. In the wreckage lie the ruins of grade schools and universities, medical clinics and mosques, greenhouses and family homes. At least 30% of people go days without eating Hundreds of Palestinians crowd charity kitchens jostling for a bowl of lentils. Babies are so emaciated they weigh less than at birth. After months of warnings from aid groups, the world’s leading authority on food crises said in August that Gaza City had fallen into famine. Israel disputes the determination. Towns have been leveled Towns scattered across the strip, where Palestinian farmers used to plant strawberries and watermelons, wheat and cereals, are now emptied and flattened. Between May and October 2025, Israeli bombardment and demolitions virtually erased the town of Khuzaa, whose rows of wheat and other cereals made it a breadbasket for the city of Khan Younis. With the war entering its third year, Israel has launched an offensive to take over Gaza City and kill the Hamas militants it says are hiding there. Israel says it also aims to free the 48 hostages who remain in Gaza, about 20 of whom the government believes are alive. Since the war began, 465 Israeli soldiers have been killed in Gaza. A new American peace plan is on the table, even as Israeli tanks and ground troops threaten the heart of Gaza City. ___ Follow AP’s war coverage at https://apnews.com/hub/israel-hamas-war Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in",
    "id": "gaza_43",
    "corpus": "gaza"
  },
  {
    "url": "https://abcnews.go.com/International/wireStory/spread-famine-gaza-strip-averted-palestinians-facestarvation-128549483",
    "title": "Gaza averts spread of famine but Palestinians there still face starvation: Experts",
    "text": "The world’s leading authority on food crises says the spread of famine’s been averted in the Gaza Strip TEL AVIV, Israel --The spread of famine has been averted in the Gaza Strip, but the situation remains critical with the entire Palestinian territory still facing starvation, the world's leading authority on food crises said Friday. The new report by The Integrated Food Security Phase Classification, or IPC, comes months after the group said famine was occurring in Gaza City and likely to spread across the territory without a ceasefire and an end to humanitarian aid restrictions. There were “notable improvements” in food security and nutrition following an October ceasefire and no famine has been detected, the report said. Still, the IPC warned that the situation remains “highly fragile” and the entire Gaza Strip is in danger of starvation with nearly 2,000 people facing catastrophic levels of hunger through April. In the worst-case scenario, including renewed conflict and a halt of aid, the whole Gaza Strip is at risk of famine. Needs remain immense, and sustained, expanded and unhindered aid is required, the IPC said. The Israeli military agency in charge of coordinating aid to Gaza, known as COGAT, said Friday that it strongly rejected the findings. The agency adheres to the ceasefire and allows the agreed amount of aid to reach the strip, COGAT said, noting the aid quantities “significantly exceed the nutritional requirements of the population” in Gaza according to accepted international methodologies, including the United Nations. The Israeli Foreign Ministry said Friday that it also rejects the findings, saying the IPC’s report doesn’t reflect reality in Gaza and more than the required amount of aid was reaching the territory. The ministry said the IPC ignores the vast volume of aid entering Gaza, because the group relies primarily on data related to U.N. trucks, which account for only 20% of all aid trucks. The IPC said that the report totals include commercial and U.N. trucks and its information is based on U.N. and COGAT data. Israel’s government has rejected the IPC's past findings, with Israeli Prime Minister Benjamin Netanyahu calling the previous report an “outright lie.” The report's findings come as the shaky U.S.-brokered ceasefire between Israel and Hamas reaches a pivotal point as Phase 1 nears completion, with the remains of one hostage still in Gaza. The more challenging second phase has yet to be implemented and both sides have accused the other of violating the truce. The IPC in Augustconfirmed the grim milestoneof famine for the first time in the Middle East and warned it could spread south to Deir al-Balah and Khan Younis. More than 500,000 people in Gaza, about a quarter of its population, faced catastrophic levels of hunger, with many at risk of dying from malnutrition-related causes, the August report said. Friday's report said that the spread of famine had been offset by a significant reduction in conflict, a proposed peace plan and improved access for humanitarian and commercial food deliveries. There is more food on the ground and people now have two meals daily, up from one meal each day in July. That situation “is clearly a reversal of what had been one of the most dire situations where we were during the summer,\" Antoine Renard, the World Food Program’s director for the Palestinian territories, told U.N. reporters in a video briefing from Gaza City Thursday. Food access has “significantly improved,” he said, warning that the greatest challenge now is adequate shelter for Palestinians, many of whom are soaked and living in water-logged tents. Aid groups say nearly 1.3 million Palestinians need emergency shelter as winter sets in. Displacement is one of the key drivers behind the food insecurity, with more than 70% of Gaza's population living in makeshift shelters and relying on assistance. Other factors such as poor hygiene and sanitation as well as restricted access to food are also exacerbating the hunger crisis, the IPC said. While humanitarian access has improved compared with previous analysis periods, that access fluctuates daily and is limited and uneven across the Gaza Strip, the IPC said. To prevent further loss of life, expanded humanitarian assistance including food, fuel, shelter and health care is urgently needed, according to the group's experts, who warned that over the next 12 months, more than 100,000 children between the ages of 6 months and 5 years are expected to suffer from acute malnutrition and require treatment. Figuresrecently releasedby Israel’s military suggest that it hasn't met the ceasefire stipulation of allowing 600 trucks of aid into Gaza each day, though Israel disputes that finding. American officials with the U.S.-led center coordinating aid shipments into Gaza also say deliveries have reached the agreed upon levels. Aid groups say despite an increase of assistance, aid still isn't reaching everyone in need after suffering two years of war. “This is not a debate about truck numbers or calories on paper. It’s about whether people can actually access food, clean water, shelter and health care safely and consistently. Right now, they cannot,” said Bushra Khalidi, Oxfam’s policy lead for Israel and the occupied Palestinian territory. People must be able to rebuild their homes, grow food and recover and the conditions for that are still being denied, she said. Even with more products in the markets, Palestinians say they can't afford it. “There is food and meat, but no one has money,\" said Hany al-Shamali, who was displaced from Gaza City. “How can we live?” ___ Edith M. Lederer contributed to this report from the United Nations. 24/7 coverage of breaking news and live events",
    "id": "gaza_46",
    "corpus": "gaza"
  },
  {
    "url": "https://www.cbsnews.com/news/israel-hamas-war-timeline-major-events-since-october-7-2023/",
    "title": "Israel and Hamas at war: A timeline of major developments in the year since Oct. 7, 2023",
    "text": "Watch CBS News Updated on:  October 8, 2024 / 8:58 AM EDT/ CBS News The Iranian-backed group Hamas, long designated a terrorist organization by the U.S. and Israel, launched an unprecedented attack on Israel on Oct. 7, 2023. The massacre of some 1,200 people ignited a devastatingwar in the Gaza Strip, a densely-packed Palestinian territory that had been ruled by Hamas for almost two decades. The Hamas-run Ministry of Health says Israeli military operations in Gaza since Oct. 7 have killed almost 42,000 people. Below is a timeline showing some of the key events in the year that has passed since many Israelis' sense of security was shattered on that Saturday morning. October 7, 2023 October 9, 2023 October 12, 2023 October 16, 2023 October 17, 2023 October 28, 2023 October 31, 2023 November 15, 2023 November 19, 2023 November 24, 2023 December 5, 2023 December 15, 2023 December 24, 2023 January 11, 2024 January 29, 2024 February 8, 2024 February 9, 2024 February 29, 2024 April 1, 2024 April 1, 2024 April 2, 2024 April 13, 2024 May 6/7, 2024 May 14, 2024 May 20, 2024 May 26, 2024 June 8, 2024 June 9, 2024 July 24, 2024 July 31, 2024 August 1, 2024 August 2, 2024 August 15, 2024 September 2, 2024 August 27, 2024 August 31, 2024 September 1, 2024 September 7, 2024 September 10, 2024 September 17, 2024 September 18, 2024 September 20, 2024 September 23, 2024 September 28, 2024 October 1, 2024 October 7, 2024 © 2024 CBS Interactive Inc. All Rights Reserved. (03:28) Copyright ©2025 CBS Interactive Inc. All rights reserved.",
    "id": "gaza_50",
    "corpus": "gaza"
  }
]