[
  {
    "url": "https://apnews.com/article/ukraine-russia-war-putin-zelenskyy-4c62940dd5ae56bc753cee7dbddbe3fb",
    "title": "Ukraine ends year disappointed by stalemate with Russia, and anxious about aid from allies",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Ukrainian servicemen walk through a charred forest at the frontline a few kilometers from Andriivka, Donetsk region, Ukraine, Saturday, Sept. 16, 2023. (AP Photo/Mstyslav Chernov) Nadia cries over the coffin of her son Oleg Kunynets, a Ukrainian military servicemen who was killed in the east of the country, during his funeral in Lviv, Ukraine, Tuesday, Feb 7, 2023. (AP Photo/Emilio Morenatti) Ukrainian military doctors treat their injured comrade who was evacuated from the battlefield at the hospital in Donetsk region, Ukraine, Monday, Jan. 9, 2023. The serviceman did not survive. (AP Photo/Evgeniy Maloletka) Destroyed Russian tanks stand across the road from a church in the town of Sviatohirsk, Ukraine, Sunday, Feb. 12, 2023. (AP Photo/Evgeniy Maloletka) Natalya, the wife of Hennadii Kovshyk, who was killed on the frontline in eastern Ukraine, touches his face before his burial, backdropped by Ukrainian flags placed at the graves of servicemen killed since the war started, in Kharkiv, Ukraine, Thursday, Feb. 16, 2023. (AP Photo/Vadim Ghirda) US President Joe Biden signs a guest book during his meeting with Ukrainian President Volodymyr Zelenskyy at the Mariinsky Palace during an unannounced visit in Kyiv, Ukraine, Monday, Feb. 20, 2023. (AP Photo/Evan Vucci, Pool) A woman and her daughter listen to a prayer for fallen soldiers at Lviv cemetery, western Ukraine, on Thursday, Feb. 23, 2023. (AP Photo/Petros Giannakouris) Discarded communist era statues depicting Stalin, front, and Lenin lay on the ground outside a glass workshop in Kharkiv, Ukraine, Tuesday, Feb. 28, 2023. (AP Photo/Vadim Ghirda) Priests walk to the cemetery during the funeral of Vladyslav Bondarenko 26, in Kozyntsi, near Kyiv, Ukraine, Monday, March 6, 2023. Bondarenko, a paratrooper of airmobile brigade, died near Bakhmut on Feb. 26. (AP Photo/Thibault Camus) People light up the road with a flashlight during blackout in Kyiv, Ukraine, Friday, Feb. 3, 2023. (AP Photo/Evgeniy Maloletka) A Ukrainian MSLR BM-21 “Grad” rocket launcher of the 95 Air Assault brigade fires towards Russian positions at the frontline near Kreminna, Ukraine, Thursday, March 9, 2023. (AP Photo/Evgeniy Maloletka) A Ukrainian police officer takes cover in front of a burning building that was hit in a Russian airstrike in Avdiivka, Ukraine, Friday, March 17, 2023. (AP Photo/Evgeniy Maloletka) Smoke rises from buildings in this aerial view of Bakhmut, the site of the heaviest battles with the Russian troops in the Donetsk region, Ukraine, Wednesday, April 26, 2023. (AP Photo/Libkos) The body of a woman that died after a Russian attack on a residential area lies on a bed surrounded by debris in Uman, central Ukraine, Friday, April 28, 2023. (AP Photo/Bernat Armangue) Russian President Vladimir Putin delivers a speech during the Belt and Road Forum at the Great Hall of the People in Beijing, Wednesday, Oct. 18, 2023. (AP Photo/Louise Delmotte) Yevgeny Prigozhin, owner of the Wagner Group military company, right, poses for a photo with a civilian after taking over the Southern Military District in Rostov-on-Don, Russia, on June 24, 2023. (AP Photo) A man plants sunflowers in his garden near a damaged Russian tank and its turret in the village of Velyka Dymerka, Kyiv region, Ukraine, Wednesday, May 17, 2023. (AP Photo/Efrem Lukatsky) People take cover inside a metro station during a Russian rocket attack in Kyiv, Ukraine, Monday, May 29, 2023. (AP Photo/Evgeniy Maloletka) Ukrainian air defenses fire to stop drones in a relentless wave of bombardments targeting Kyiv early Tuesday morning in Kyiv, Ukraine, May 30, 2023. (AP Photo/Evgeniy Maloletka) Cadets practice putting on gas masks during a lesson in a bomb shelter in a cadet lyceum in Kyiv, Ukraine, Tuesday, June 6, 2023. Writing on the wall reads: “Glory to Ukraine”. (AP Photo/Efrem Lukatsky) Tetiana holds her pet dogs, Tsatsa and Chunya, in her home that was flooded after the Kakhovka dam blew up overnight, in Kherson, Ukraine, on June 6, 2023. (AP Photo/Evgeniy Maloletka) Residents are evacuated from a flooded neighborhood in Kherson, Ukraine, Tuesday, June 6, 2023. A major dam in southern Ukraine has collapsed, flooding villages, endangering crops in the country’s breadbasket and threatening drinking water supplies. (AP Photo/Felipe Dana) Ukraine Special Operations Forces soldiers navigate the Dnieper river using night vision goggles, or NVG, during a night mission in Kherson region, Ukraine, Saturday, June 10, 2023. (AP Photo/Felipe Dana) Ukrainian policemen looking for fragments of a rocket in a crater after a Russian attack on a residential neighbourhood in Pokrovsk, Ukraine, Wednesday, June 21, 2023. (AP Photo/Evgeniy Maloletka) A dove painted by artist TvBoy adorns the wall of a building damaged by Russian shelling attacks in Irpin, Ukraine, Friday, July 7, 2023. (AP Photo/Jae C. Hong) Darts are stuck on a paper target made with an image of Russian President Vladimir Putin at a popular beachside attraction in Odesa, Ukraine, Sunday, July 23, 2023. (AP Photo/Jae C. Hong) An anaesthesiologist sets up a hyperbaric chamber for Vitaliy Bilyak, a Ukrainian serviceman, during his treatment at St. Panteleimon hospital in Lviv, Ukraine, Tuesday, July 25, 2023. (AP Photo/Evgeniy Maloletka) A woman takes a nap on the lap of her husband on a bench at Saint Sophia Cathedral in Kyiv, Ukraine, Sunday, July 30, 2023. (AP Photo/Jae C. Hong, File) A dead body lies on the ground in front of a burning market after an attack in the city center of Kostiantynivka, Ukraine, Wednesday, Sept. 6, 2023. More than a dozen people were killed and dozens more were wounded Wednesday when shelling struck a market in the city in eastern Ukraine. (AP Photo/Evgeniy Maloletka) Andrii, the main mechanic of a repair center, tests a repaired MT-LB armored personnel carrier, in the Kyiv region, Ukraine, Tuesday, Oct. 24, 2023. (AP Photo/Alex Babenko) A woman poses for a photograph for a social media campaign in Kyiv, Ukraine, Tuesday, Oct. 31, 2023. The sign reads - ‘Looking for a groom’. (AP Photo/Bram Janssen) A worn-out portrait of Dmytro Andriyovych, 34, sits on his grave at a cemetery in Irpin, Ukraine, on the outskirts of Kyiv, on Friday, Feb. 10, 2023. He was buried on April 26, 2022. Exposed to rain, sun and frost over the course of a war that began nearly a year ago, the graveside portraits’ once bright hues are fading away and yellow stains and mold are encroaching. (AP Photo/Emilio Morenatti) Ukrainian President Volodymyr Zelenskyy poses for a photo after his interview with The Associated Press in Kharkiv, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Felipe Dana)                                                                   The year started with high hopes for Ukrainian troops planning acounteroffensiveagainst Russia. It ended with disappointment on the battlefield,an increasingly somber mood among troopsand anxiety about the future of Western aid for Ukraine’swareffort. In between, there was a short-lived rebellion in Russia, a dam collapse in Ukraine, and the spilling of much blood on both sides of the conflict. Twenty-two months since it invaded, Russia has about one-fifth of Ukraine in its grip, and the roughly 1,000-kilometer (620-mile) front line has barely budged this year. A crunch has come away from the battlefield. In Western countries that havechampioned Ukraine’s struggleagainst its much bigger adversary, political deliberations over billions in financial aid are increasingly strained. Russian PresidentVladimir Putinis playing a waiting game two years into a war that proved to be a costly miscalculation by the Kremlin. He is wagering that the West’s support will gradually crumble, fractured bypolitical divisions, eroded bywar fatigueand distracted by other demands, such as China’s menacing of Taiwan and war in the Middle East.  The international political outlook could turn sharply in Putin’s favor after next November’s elections in the United States — by far Ukraine’s biggest military supplier and where some Republican candidates are pushing towind down support for its war. A dead body lies on the ground in front of a burning market after an attack in the city center of Kostiantynivka, Ukraine, Wednesday, Sept. 6, 2023. (AP Photo/Evgeniy Maloletka)  Nearly half of the U.S. public believes the country is spending too much on Ukraine,according to pollingpublished in November by The Associated Press-NORC Center for Public Affairs Research. “The political landscape on both sides of the Atlantic is changing,” says Charles Kupchan, a senior fellow at the Council on Foreign Relations in Washington DC. “Transatlantic solidarity has been steady. But I don’t think it will remain steady forever.” The shifting sentiment could benefit Putin, analysts say, as he seeks at least to keep Ukraine in limbo and eventually compel it to accept a bad deal to end the war. Putin announced in early December that he willrun for reelectionin March, all but guaranteeing he keeps his repressive grip on Russia for at least another six years. “It’s been a good year, I would even actually call it a great year” for Putin, says Mathieu Boulegue, a consulting fellow for the Russia-Eurasia program at Chatham House think tank in London. Western sanctionsare biting butnot cripplingthe Russian economy. Russian forces are still dictating much of what happens on the battlefield, where itsdefensive linesfeature minefields up to 20 kilometers (12 miles) deep that have largely held back Ukraine’s monthslong counteroffensive. The counteroffensive was launched before Ukraine’s forces were fully ready, a hurried political attempt to demonstrate that Western aid could alter the course of the war, said Marina Miron of the Defense Studies Department of King’s College London. “The expectations (for the counteroffensive) were unrealistic,” she said. “It turned out to be a failure.” Putin got a victory he desperately wanted in May in the fight for the bombed-out city ofBakhmut, the longest and bloodiest battle of the war. It was a trophy to show Russians after his army’s winter offensive failed to take other Ukrainian cities and towns along the front line. A mutiny in June by theWagner mercenary groupwas the biggest challenge to Putin’s authority in his more than two decades in power. But it backfired. Putindefused the revoltand kept the allegiance of his armed forces, reasserting his hold on the Kremlin. Wagner chief and mutiny leader Yevgeny Prigozhin waskilled in a mysterious plane crash. And any public dissent about the war wasquickly and heavy-handedly stamped outby Russian authorities. Still, Putin has had setbacks. He fell afoul of theInternational Criminal Court, which in March issued an arrest warrant for him on war crimes, accusing him of personal responsibility for theabductions of children from Ukraine. That made it impossible for him to travel to many countries. Ukraine has so far clawed back about half the land that the Kremlin’s forces occupied in their full-scale invasion in February 2022, according to the U.S., but it’s going to be hard to win back more. The big Ukrainian push fell far short of its ambitions, even though Western countries had given Kyiv avariety of weaponsand training. That has raised uncomfortable questions in the West about the best way forward. “We’re in a very awkward moment now,” said Kupchan of the Council on Foreign Relations. A dove painted by artist TvBoy adorns the wall of a building damaged by Russian shelling attacks in Irpin, Ukraine, Friday, July 7, 2023. (AP Photo/Jae C. Hong)  The Russians have been ruthless in their determination to stop the Ukrainians punching through their lines. They were suspected of sabotaging the majorKakhovka damon the Dnieper River in southern Ukraine, having possessed themeans, motive and opportunity to do so. The dam’s collapseflooded a huge areawhere Ukrainian forces might have may have been able to break through. For its part, Ukraine has proved able to strike far behind enemy lines, evenhitting Moscow with long-range drones. It has bloodied Russia’s nose by hitting with missiles and drones akey bridge in Moscow-annexed Crimea, oil depots and airfields, and theheadquarters of Russia’s Black Sea fleetin Sevastopol. By showing it can strike in the Black Sea, Ukraine has been able to push Russian warships away from the coast, although not entirely. At one point, Russia turned its sights onUkraine’s Black Sea ports— a vital conduit to global trade — and its farming infrastructure,destroying enough foodto feed more than 1 million people for a year, the U.K. government said. Yet while Russia has endured huge losses of troops and equipment, the country possesses the scale to soak up those setbacks. Cadets practice putting on gas masks during a lesson in a bomb shelter in a cadet lyceum in Kyiv, Ukraine, Tuesday, June 6, 2023. Writing on the wall reads: “Glory to Ukraine”. (AP Photo/Efrem Lukatsky)  Putin, who foreign officials say has secured large supplies ofammunition from North Korea, has put together a state budget that devotes arecord amount to defenseas it increases spending by around 25% in 2024-2026. He has also ordered the country’s military to increase the number of troops by nearly 170,000 to more than 1.3 million. For Ukraine, the challenge is resourcing another offensive operation. Its troops are motivated but exhausted, analysts say. Zelenskyy has tirelessly lobbied Western leaders to keep help coming, aware they are his country’s lifeline. He has traveled to Washington three times in the past two years. U.S President Joe Bidentraveled to Kyivlast February in a display of Western solidarity. He now wants Congress to grant an additional$50 billionfor the war in Ukraine. Support for Kyiv shows signs of fraying, however. Biden’s proposal isstuckin a divided Senate. Zelenskyy scored a diplomatic victory late in the year when the European Union granted Ukraine accelerated talks onjoining the bloc. But even that triumph was tempered by the knowledge that the process could take years, as could clinchingNATO membership. And the EU’s denial of 50 billion euros ($55 billion) in aid to help keep the battered Ukrainian economy going wasfrustrating for Kyiv. Italian Premier Giorgia Meloni perhapsexpressed the predicament most succinctlyin November when she inadvertently told a pair of Russian prank callers that “there is a lot of fatigue” on the issue of Ukraine. “We are near the moment in which everybody understands that we need a way out,” she said. ___ Follow AP’s coverage of the war in Ukraine athttps://apnews.com/hub/russia-ukraine      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_1",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/ukraine-russia-war-zelenskyy-putin-afb3bc4714b1dca631bd4df6f931bd56",
    "title": "A gloomy mood hangs over Ukraine’s soldiers as war with Russia grinds on",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. FILE - Ukrainian soldiers practice on a tank during military training, in Ukraine, Wednesday, Dec. 6, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (AP Photo/Efrem Lukatsky, File) Ukrainian servicemen walk on the shore of Dnipro river after exiting a boat at the front line near Kherson, Ukraine, Sunday Oct. 15, 2023. (AP Photo/Mstyslav Chernov, File) FILE - In this photo provided by the Ukrainian 10th Mountain Assault Brigade “Edelweiss”, a Ukrainian soldier holds an anti-drone gun on his position near Bakhmut, Donetsk region, Ukraine, Thursday, Nov. 23, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (Shandyba Mykyta, Ukrainian 10th Mountain Assault Brigade “Edelweiss” via AP, File) FILE - In this photo provided by the Ukrainian 10th Mountain Assault Brigade “Edelweiss”, Ukrainian soldiers pass by a volunteer bus burning after a Russian drone hit it near Bakhmut, Donetsk region, Ukraine, Thursday, Nov. 23, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (Shandyba Mykyta, Ukrainian 10th Mountain Assault Brigade “Edelweiss” via AP, File) FILE - A grenade and bullets are seen in the trenches at the front line a few kilometers from Andriivka, Donetsk region, Ukraine, Saturday, September 16, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (AP Photo/Alex Babenko, File) FILE - Kyiv Mayor Vitali Klitschko speaks to media in a yard of an apartment building damaged by Russian attack in Kyiv, Ukraine, Saturday, June 24, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (AP Photo/Andrew Kravchenko, File) FILE - Ukrainian Defense Minister Rustem Umerov rides in an APC during a visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (AP Photo/Efrem Lukatsky, File) FILE - Ukrainian President Volodymyr Zelenskyy, Commander of Ukraine’s Ground Forces Col.-Gen. Oleksandr Syrsky, right, and Roman Mashovets, deputy head of the Presidential Office, look at a map during their visit to the front line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (AP Photo/Efrem Lukatsky, File) FILE - Ukrainian servicemen board a boat on the shore of Dnipro river at the frontline near Kherson, Ukraine, Sunday Oct. 15, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (AP Photo/Mstyslav Chernov, File)                   KYIV, Ukraine (AP) — A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Despite adisappointing counteroffensivethis summer and signs ofwavering financial supportfrom allies, Ukrainian soldiers say they remain fiercely determined to win. Butas winter approaches, they worry that Russia is better equipped for battle and are frustrated about being on the defensive again in a grueling war. Some doubt the judgment of their leaders. Discontent among Ukrainian soldiers — once extremely rare and expressed only in private — is now more common and out in the open. In the southern city of Kherson, where Ukraine is staging attacks against well-armed Russian troops on the other side of the Dnieper River, soldiers are asking why these difficult amphibious operations were not launched months ago in warmer weather. Ukrainian servicemen walk on the shore of Dnipro river after exiting a boat at the front line near Kherson, Ukraine, Sunday Oct. 15, 2023. (AP Photo/Mstyslav Chernov, File)  “I don’t understand,” said a commander of the 11th National Guard Brigade’s anti-drone unit who is known on the battlefield as Boxer. “Now it’s harder and colder.” “It’s not just my feeling, many units share it,” said Boxer, who spoke on condition that only his battlefield name would be used. Russia, whichillegally annexed the Crimean Peninsula in 2014, controls about one-fifth of Ukraine. After 22 months of war the two countries are essentially in a stalemate along the 1,000 kilometer-long (620 mile-long) front line.  Russian forces aim to push deeper into eastern Ukraine this winter, analysts say, so that Russian President Vladimir Putin can cite this momentum as hecampaigns for reelection, an outcome that is all but certain. Emboldened by recent gains on the battlefield, Putin said last week thathe remains fully committed to the warand criticized Ukraine for “sacrificing” troops to demonstrate success to Western sponsors. In the United States, which has already spent some $111 billion defending Ukraine, President Joe Biden is advocating for an additional $50 billion in aid. But Republican lawmakers arebalking at more support— just as some lawmakers in Europe areon the fenceabout providing another $50 billion to Ukraine, after failing to deliver on promised ammunition. “The reason the Ukrainians are gloomy is that, they now sense, not only have they not done well this year ... they know that the Russians’ game is improving,” said Richard Barrons, a former British army general. “They see what’s happening in Congress, and they see what happened in the EU.” Ukraine may be on the defensive this winter, but its military leaders say they have no intention of letting up the fight. FILE - Ukrainian President Volodymyr Zelenskyy, Commander of Ukraine’s Ground Forces Col.-Gen. Oleksandr Syrsky, right, and Roman Mashovets, deputy head of the Presidential Office, look at a map during their visit to the front line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (AP Photo/Efrem Lukatsky, File)  “If we won’t have a single bullet, we will kill them with shovels,” said Serhii, a commander in the 59th Brigade that is active in the eastern city of Avdiivka and who spoke on condition that only his first name be used. “Surely, everyone is tired of war, physically and mentally. But imagine if we stop — what happens next?” The fatigue and frustration on the battlefield are mirrored in Ukraine’s capital, Kyiv, where disagreements among leaders have recently spilled out into the open. President Volodymyr Zelenskyy last month publicly disputed the assessment by Ukraine’s military chief, Valery Zaluzhny, that the war had reached a stalemate. And the mayor of Kyiv, Vitali Klitschko, has repeatedly lashed out at Zelenskyy, saying he holds too much power. Disquiet in the halls of power appears to have filtered down to the military’s rank and file, who increasingly have misgivings about inefficiency and faulty decision-making within the bureaucracy they depend on to keep them well-armed for the fight. FILE - Ukrainian servicemen board a boat on the shore of Dnipro river at the frontline near Kherson, Ukraine, Sunday Oct. 15, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (AP Photo/Mstyslav Chernov, File)  In the southern Ukrainian region of Zaporizhzhia, where momentum has slowed since the summertime counteroffensive,drones have become a crucial tool of war. They enable soldiers to keep an eye on — and hold back — Russian forces while they conduct dangerous and painstaking operations to clear minefields and consolidate territorial gains. But fighters there complain that the military has been too slow in training drone operators. It took seven months to obtain the paperwork needed from multiple government agencies to train 75 men, said Konstantin Denisov, a Ukrainian soldier. “We wasted time for nothing,” he said. Commanders elsewhere complain of not enough troops, or delays in getting drones repaired, disrupting combat missions. FILE - Ukrainian Defense Minister Rustem Umerov rides in an APC during a visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (AP Photo/Efrem Lukatsky, File)  Defense Minister Rustem Umerov insists Ukraine has enough soldiers and weaponry to power the next phase of the fight. “We are capable and able to protect our people and we will be doing it,” he told the Associated Press. “We have a plan and we are sticking to that plan.” The limited momentum Ukraine’s forces had during their summertime counteroffensive has slowed — from the forests in the northeast, to the urban centers in the east, to the slushy farmland in the south. With Russia hoping to take the initiative this winter, Ukraine is mainly focused on standing its ground, according to interviews with a half dozen military commanders along the vast front line. Despite wet, muddy ground that makes it harder to move tanks and other heavy weaponry around, the Russian army has bolstered its forces in the eastern Donetsk region, where it has recently stepped up offensive maneuvers. FILE - In this photo provided by the Ukrainian 10th Mountain Assault Brigade “Edelweiss”, Ukrainian soldiers pass by a volunteer bus burning after a Russian drone hit it near Bakhmut, Donetsk region, Ukraine, Thursday, Nov. 23, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (Shandyba Mykyta, Ukrainian 10th Mountain Assault Brigade “Edelweiss” via AP, File)  “The main goal for the winter is to lose as few people as possible,” said Parker, the Ukrainian commander of a mechanized battalion nearBakhmutwho asked to go by his battlefield name to speak freely. Bakhmut is a city in eastern Ukraine that Russian forces took after months of heavy fighting. “We have to be clear,” Parker said. “It’s not possible in the winter to liberate Donetsk or Bakhmut, because they have too many (fighters).” Analysts say Ukraine may even be forced to cede patches of previously reclaimed territory this winter, though Russia is likely to pay a heavy price. “If Russia keeps on attacking, the most likely outcome is that they’ll make some very marginal territorial gains, but suffer enormous casualties in doing so,” said Ben Barry, a senior fellow at the International Institute for Strategic Studies in London. Some Ukrainian commanders across the front line say they lack the fighters and firepower needed to keep Russia’s seemingly endless waves of infantrymen at arm’s length as they fortify defenses to protect soldiers. That places ever more importance on attack drones — a weapon, they say, that Russia is currently better equipped with. Indeed, while Ukrainian soldiers have proven to be resourceful and innovative on the battlefield, Moscow has dramatically scaled up its defense industry in the past year, manufacturing armored vehicles and artillery rounds at a pace Ukraine cannot match. FILE - In this photo provided by the Ukrainian 10th Mountain Assault Brigade “Edelweiss”, a Ukrainian soldier holds an anti-drone gun on his position near Bakhmut, Donetsk region, Ukraine, Thursday, Nov. 23, 2023. A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country. Ukrainian soldiers remain fiercely determined to win, despite a disappointing counteroffensive this summer and signs of wavering financial support from allies. (Shandyba Mykyta, Ukrainian 10th Mountain Assault Brigade “Edelweiss” via AP, File)  “Yes they’re ahead of us in terms of supply,” said Boxer, the commander in Kherson, who credited Russian drones with having longer range and more advanced software. “It allows the drone to go up 2,000 meters, avoid jammers,” he said, whereas Ukrainian drones “can fly only 500 meters.” This poses a problem for his troops, who have been limited in their ability to strike Russian targets on the other side of the Dnieper River. To eventually deploy heavy weaponry, such as tanks, Ukraine first needs to push Russian forces back to erect pontoon bridges. Until they get more drones, this won’t be possible, said Boxer. “We wait for weapons we were supposed to receive months ago,” he said. To sustain the fight, Ukraine will also have to mobilize more men. In the northeastern cities of Kupiansk and Lyman, Russian forces have deployed a large force with the goal of recapturing lost territory. “They are simply weakening our positions and strongholds, injuring our soldiers, thereby forcing them to leave the battlefield,” said Dolphin, a commander in the northeast who would only be quoted using his battlefield name. Dolphin says he has been unable to sufficiently re-staff. “I can say for my unit, we are prepared 60%,” he said. ___ Follow AP’s coverage of the war in Ukraine:https://apnews.com/hub/russia-ukraine      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_2",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/ukraine-russia-trump-war-zelenskyy-putin-7fe8c0c80b4e93e3bc079c621a44e8bb",
    "title": "Trump says Ukraine started the war that’s killing its citizens. What are the facts?",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. President Donald Trump appeared to suggest Tuesday that Ukraine was to blame for a war that began three years ago after Russia invaded the country. In remarks from his Mar-a-Lago estate, Trump also said he believes he has “a “good chance” to end the war. Ukraine’s President Volodymyr Zelensky gives a press conference in Kyiv, Wednesday, Feb. 19, 2025. (Tetiana Dzhafarova/Pool Photo via AP) President Donald Trump reacts as he arrives on Air Force One at Miami International Airport, Wednesday, Feb. 19, 2025. (Pedro Portal/Miami Herald via AP)      KYIV, Ukraine (AP) — President Donald Trumpthis weekfalsely blamed Ukrainefor starting the warthat has cost tens of thousands of Ukrainian lives, causing outrage and alarm in a country that has spent nearly three years fighting back a much larger Russian military. Trump called Ukrainian President Volodymyr Zelenskyy “a dictatorwithout elections” and claimed his support among voters was near rock-bottom. Zelenskyy said Wednesday that the disinformation is coming from Russia, and some of what Trump has said does echo Russia’s own narrative of the conflict. Here’s a look at some of Trump’s statements: Ukraine’s President Volodymyr Zelensky gives a press conference in Kyiv, Wednesday, Feb. 19, 2025. (Tetiana Dzhafarova/Pool Photo via AP)  Rescuers and volunteers are working at Ohmatdyt Children’s Hospital that was strongly damaged during a Russian missile strike in Kyiv, Ukraine, on July 08, 2024, amid the Russian invasion. Russia is massively attacking Ukraine with missiles on July 08. (Photo by Maxym Marusenko/NurPhoto via AP)  WHAT TRUMP SAID: “You’ve been there for three years. You should have ended it. ... You should have never started it. You could have made a deal.” THE FACTS: Russia’s army crossed the border on Feb. 24, 2022, in an all-out invasion thatPutin sought to justifyby falsely saying it was needed to protect Russian-speaking civilians in eastern Ukraine and prevent the country from joining NATO.   But Russia’s aggression against Ukraine didn’t start then. In 2014, Russian President Vladimir Putin saw signs that Ukraine was pulling away from Russia’s sphere of influence, seeking alliances with western European nations. Putin illegally annexed the Crimean Peninsula and started an armed aggression in the eastern Ukrainian region of Donbas that grew into a long-running conflict that left thousands dead. That conflict simmered until 2022, when Putin ordered what he called military exercises along Ukraine’s borders. He told the world that the roughly 150,000 soldiers that he had amassed would not be used to invade Ukraine. But in the early hours of Feb. 24, Russia launched widespread airstrikes and soldiers beganpouring over the border.  WHAT TRUMP SAID: “We have a situation where we haven’t had elections in Ukraine, where we have martial law,” Trump said in Mar-a-Lago, adding on Wednesday in a post on social media: “A Dictator without Elections, Zelenskyy better move fast or he is not going to have a Country left.” THE FACTS: Zelenskyy was elected to a five-year term in 2019, and the next presidential elections had been scheduled for spring 2024. But Ukrainian law prohibits parliamentary or presidential elections during a state of martial law, so Zelenskyy has remained in office. He has said he believes elections will be held in Ukraine after martial law is lifted. The country would need to amend the law if it decided to hold a vote. There are numerous factors that,according to Ukraine’s government,“would render it literally impossible to ensure a fair electoral process in the circumstances of a total war.” According to the United Nations’ refugee agency, some 6.9 million Ukrainian refugees have been registered worldwide since February 2022. Of those, millions remain outside the country due to the war. It would be nearly impossible for all of those who have been displaced to participate in an election, potentially robbing millions of their right to vote. Furthermore, around 800,000 soldiers are currently serving in the Ukrainian Armed Forces as they struggle to contain Russian advances. An election would necessitate pulling soldiers off the front lines to vote, weakening Ukraine’s military position. Additionally, those fighting would be unable to run for office, a right that is guaranteed to them by Ukrainian law. Many Ukrainians are living in areas under Russian occupation, essentially precluding their participation in any electoral process. And since Russia continues to regularly strike both military and civilian targets across the country, packing millions of citizens into crowded polling places could create additional danger.   WHAT TRUMP SAID: “The leader in Ukraine, I mean, I hate to say it, but he’s down at 4% approval rating.” THE FACTS: Zelenskyy “retains a fairly high level of public trust” — about 57 percent - according to a report released Wednesday by the Kyiv International Institute of Sociology. Speaking in Kyiv on Wednesday, Zelenskyy said the number given by Trump, for which the president cited no sources, was “disinformation” that originated in Russia, and that the president “unfortunately lives in this disinformation space.” Zelenskyy said he will ask pollsters in the coming weeks to conduct surveys on the public’s trust in him and share the results with the Trump administration. Oleksii Yukov’s team members offload the bodies of Russian soldiers they’ve collected from the frontline in the Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. Yukov and his team retrieve bodies from the frontline to barter for Ukrainian bodies in periodic exchanges of war dead. (AP Photo/Bram Janssen)  WHAT TRUMP SAID: “When you see what’s taken place in Ukraine with millions of people killed, including the soldiers, millions of people killed, a big percentage of their cities knocked down to the ground, I don’t know how anybody even lives there.” THE FACTS: No estimates by any reputable analysis place deaths near the millions. While exact figures of the number of deaths are unknown, Zelenskyy said earlier this month that over 46,000 Ukrainian soldiers had been killed since the start of the full-scale war in February 2022. He has also said that “tens of thousands of civilians” had been killed in occupied areas of Ukraine, but that no exact figures would be available until the war was over. The most recent data from the Russian Defense Ministry, published in January 2023, pointed to just over 6,000 military deaths, although reports from U.S. and U.K. officials put that number significantly higher.  WHAT TRUMP SAID: “President Zelenskyy said last week that he doesn’t know where half of the money is that we gave him. Well, we gave them, I believe, $350 billion.” THE FACTS: According to a U.S interagency oversight group that tracks aid to Ukraine, the U.S. Congress has appropriated around $183 billion in assistance to Kyiv since the start of Russia’s invasion on Feb. 24, 2022 — a little more than half of Trump’s claim of $350 billion. In aninterview with The Associated Presson Feb. 1, Zelenskyy said some $70 billion worth of military aid had been delivered to Ukraine, and that another $6 billion had come in the form of things like training programs, humanitarian relief and economic and infrastructure recovery. As for the rest of the assistance approved by the U.S. Congress, Zelenskyy said it never reached Ukraine. “I don’t know where all this money is,” he said. Zelenskyy’s statement led to a flurry of spurious claims in some news media, amplified by Trump and Elon Musk, that some $100 billion of U.S. assistance had disappeared somewhere in Ukraine. But crucially, aid appropriations aren’t necessarily spent in the country they target. Much of the Ukraine aid approved by Congress is spent in the U.S. to boost the domestic defense industry by replacing old equipment given to Ukraine. It’s also used to supply Kyiv with new U.S.-manufactured weaponry. According to a paper from the Center for Strategic and International Studies, a Washington-based bipartisan, nonprofit policy research organization, other funds have financed a surge of U.S. troops into allied countries in Europe in response to Russia’s invasion. Still others have gone to assisting Ukrainian refugees or enforcing sanctions against Russia — all uses that would never see funding cross over Ukraine’s borders. Trump’s own envoy for Russia and Ukraine, Keith Kellogg, said in an interview with broadcaster Newsmax in early February that U.S. officials keep careful tabs on how and where aid appropriations are used.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_3",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/russia-ukraine-invasion-war-military-0fd6866d7ee2aec12e51daa1e7c5c881",
    "title": "A look at Russian missile attacks on Ukrainian targets since the war began in February 2022",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Aftermath as drone shot down near Kyiv during massive aerial assault launched by Russia KYIV, Ukraine (AP) — Since the start of its full-scaleinvasion of Ukrainein February 2022, the Russian military has repeatedly used missiles to blast civilian targets across the country, with devastating consequences. One of the biggest attacks occurred on Friday when Russia launched more than100 missiles and dozens of drones. The attack killed at least 24 civilians, injured another 130 and left an unknown number buried under rubble. Western officials and analysts recently warned thatRussiahad limited its cruise missile strikes in recent months in an apparent effort to build up stockpiles for massive attacks during the winter, hoping to break Ukrainians’ spirit. ___ MARCH 9, 2022 — An apartment building in Izium in eastern Ukraine was hit in an attack that Human Rights Watch later said killed at least 44 people. Russian forces took control of the city and surrounding area beginning in late March andoccupied it for six months. At the time of the strike, HRW said the area was under the control of Ukrainian forces who were trying to keep Russian troops from entering the city. MARCH 16, 2022 — A Russian airstrike hit a theater in Mariupol, killing hundreds of civilians sheltering in the basement. Ukrainian officials initially put the death toll at 300, but an Associated Press investigation later found evidence that the attack was fardeadlier and killed closer to 600 peopleinside and outside the building. Russia claimed the theater was demolished by Ukrainian forces or served as a Ukrainian military base. APRIL 8, 2022 — Thetrain station in Kramatorskin eastern Ukraine was hit by a Russian missile as passengers, mostly women and children, tried to flee the fighting. Sixty-one people were killed and 135 wounded. The remnants of a rocket were painted with the words “For the children” in Russian, implying that children were being avenged by the strike, though the exact reason for the wording was unclear. Ukrainian President Volodymyr Zelenskyy said it was a deliberate attack. Russia’s Defense Ministry accused Ukraine of carrying out the strike.  JUNE 27, 2022 — Long-range Russian bombers struck a crowded shopping mall inUkraine’s central city of Kremenchukwith a supersonic missile, killing more than 20 people. About 1,000 people were inside the building. Zelenskyy called the strike “one of the most daring terrorist attacks in European history.” Russia said the missile was directed at a nearby weapons depot. JULY 1, 2022 — A Russian airstrike on residential areas killed at least 21 people near the Ukrainian port of Odesa, a day after the withdrawal of Russian forces from an island in the Black Sea. Zelenskyy’s office said warplanes fired three missiles that struck an apartment building and a campsite. JULY 9, 2022 — Russian rockets smashed into apartment buildings in eastern Ukraine,killing at least 15 peoplein the town of Chasiv Yar. The buildings were mostly home to people who work in nearby factories. At least six people were dug out of the rubble. JULY 14, 2022 — Kalibr cruise missiles fired from a Russian ship in the Black Sea killed at least 29 people and wounded more than 100 others in the central Ukrainian city of Vinnytsia. Zelenskyy accused Russia of deliberately targeting civilians in locations with no military value. He said the victims included a 4-year-old girl. Russia said it was attacking a Ukrainian officers’ residence. SEPT. 30, 2022 — Four Russian missiles targeted a convoy of cars on the outskirts of the southern city of Zaporizhzhia, killing 30 people, including children. Ukrainian officials said the missiles were launched from an S-300 anti-aircraft missile system and hit a column of vehicles sent to ferry people to safety from Russian-occupied territory. JAN. 14, 2023 — One of thedeadliest attacks on civilianstook place when a Russian missile hit an apartment building in the southeastern city of Dnipro, killing 45 people, including six children. Ukrainian military officials said at the time that they did not have a system that could take down the type of the supersonic missile that was used, Russia’s Kh-22 missiles. APRIL 28, 2023 —An apartment blockfar from the front lines was blasted at night by two long-range cruise missiles in the city of Uman, about 215 kilometers (134 miles) south of Kyiv. At east 21 people were killed, including three children. The Russian Defense Ministry said the missiles were aimed at places where Ukrainian military reserve units were staying before their deployment to the battlefield. SEPT. 6, 2023 — Sixteen people were killed when a missile struck abusy market in Kostiantynivkain eastern Ukraine, turning it into a fiery, blackened ruin. Zelenskyy said the strike was retribution for Ukrainian advances on the battlefield. A Russian Foreign Ministry spokeswoman said Ukraine fired the missile. OCT. 5, 2023 — A village cafe and store in eastern Ukraine was hit by a Russian rocket, killing at least 51 civilians in one of the deadliest attacks of the year. Zelenskyy denounced the strike in the village of Hroza as a “demonstrably brutal Russian crime” and “a completely deliberate act of terrorism.” The cafe was hosting a wake following a funeral. DEC. 29, 2023 — Russialaunched 122 missilesand dozens of drones against Ukrainian targets across the country, killing at least 24 civilians. A Ukrainian air force official described it as the biggest aerial barrage of the war to date. Another 130 people were injured and an unknown number were buried under rubble during the onslaught that hit Kharkiv, Kyiv, Odesa, Lviv and Dnipro. Ukraine’s military chief said the air force intercepted most of the barrage. ___ Follow AP’s coverage of the war in Ukraine athttps://apnews.com/hub/russia-ukraine      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_4",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/ukraine-russia-war-fatigue-gaza-hamas-israel-94b6351b05178078dddc027f188526b3",
    "title": "The world’s attention is on Gaza, and Ukrainians worry war fatigue will hurt their cause",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. FILE - People pay respect as the coffin containing the body of Serhii Havryliuk, 48, passes by during his funeral procession in Tarasivka village, near Kyiv, Ukraine, Wednesday, Feb. 15, 2023. Serhii Havryliuk, an officer of the Azov Assault Brigade, died while defending the Azovstal steel plant in Mariupol on April 12, 2022 against the Russians. Serhii has finally been buried after DNA tests confirmed his identity. (AP Photo/Emilio Morenatti, File) FILE - The sun sets over a destroyed building in Izyum, Ukraine, Tuesday, Oct. 24, 2023. (AP Photo/Bram Janssen, File) FILE - Ukrainian doctor Yurii Kuznetsov speaks to land mine victim Oleksandr Kolisnyk at the hospital in Izium, Ukraine, Sunday, Feb. 19, 2023. In this war-scarred city in Ukraine’s northeast, residents scrutinize every step for land mines. (AP Photo/Vadim Ghirda, File) FILE - A construction worker looks out of a window of the damaged city council building in Izium, Ukraine, Tuesday, Aug. 22, 2023. (AP Photo/Bram Janssen, File) FILE - An officer of Ukraine’s 59th Motorized Brigade controls a drone from a shelter in the suburbs of Donetsk, the site of fierce battles with the Russian forces, Ukraine, Friday, May 26, 2023. (AP Photo/Efrem Lukatsky, File) FILE - People take cover at metro station during a Russian rocket attack in Kyiv, Ukraine, Monday, May 29, 2023. (AP Photo/Evgeniy Maloletka, File) FILE - US President Joe Biden signs a guest book during his meeting with Ukrainian President Volodymyr Zelenskyy at Mariinsky Palace during an unannounced visit in Kyiv, Ukraine, Monday, Feb. 20, 2023. (AP Photo/Evan Vucci, Pool, File) FILE - Darts are stuck on a paper target made with an image of Russian President Vladimir Putin at a popular beachside attraction in Odesa, Ukraine, Sunday, July 23, 2023. (AP Photo/Jae C. Hong, File) FILE - A Ukrainian serviceman of 28th brigade cleans a window of his car before going to frontline positions in Donetsk region, Ukraine, Wednesday, June 21, 2023. (AP Photo/Evgeniy Maloletka, File) FILE - Iryna Sokeryna holds her daughter Liubov Sokeryna as they take cover from Russian shelling while being evacuated from a flooded neighborhood in Kherson, Ukraine, Tuesday, June 6, 2023. (AP Photo/Felipe Dana, File)                     KYIV, Ukraine (AP) — When Tymofii Postoiuk and his friends set up an online fundraising effort for Ukraine, donations poured in from around the globe, helping to purchase essential equipment for Ukrainian armed forces. As the fighting with Russia wore on and war fatigue set in, the donations slowed down, but money continued to come in steadily. Then theIsrael-Hamas warbroke out on Oct. 7. With the start of another major conflict, social media networks including X, formerly known as Twitter, were flooded with news from the Middle East. “Our fundraising posts and updates simply get lost in between those tweets,” Postoiuk said. The result has been a broad shift in the world’s attention away from Ukraine to the fighting in Gaza — a trend that worries many Ukrainians. They fear that a combination of global fatigue, competing political agendas and limited resources will result in less aid for their military, hurting the country’s ability to sustain its confrontation with Russia. “The longer we talk about our war, the less interest it holds for people,” said 21-year-old Ivan Mahuriak, who lives in Lviv in western Ukraine. Like many other Ukrainians, he feels as if the world stopped paying attention to thewar in Ukraineeven before the Hamas attack on Israel. The fatigue, he said, arises from the fact that dynamics on the ground are significantly less than in 2022, when Ukrainian armed forces managed to completely or partiallypush Russians out of several regions. “In some places, the front line is still. But that doesn’t mean that nothing is happening,” he said. His brother, two cousins, several colleagues and friends are in the Ukrainian military and continue to fight Russian troops. This year’s much-touted counteroffensive, which took off in June, has progressed at a much slower pace, with Ukrainian troopsstruggling to dislodge Russianswho are entrenched in captured territory. Additional U.S. funding for Ukraine is jeopardized by political fights in Washington, where the new war consumes attention at the highest levels. Divisions over Ukraine have also emerged in the European Union, which says itcannot provide all the munitions it promised. EU summits and other high-level global meetings now tend tofocus on the humanitarian catastrophe in Gaza. United States President Joe Biden has made a point of linking U.S. support for Israel and Ukraine, saying both arevital for national security. Biden’s secretary of transportation, Pete Buttigieg, paid an official visit to Ukraine on Nov. 8 to show that the U.S. commitment has not wavered. “The fact that I am here is one way to demonstrate that, in addition to the great concern and attention that we have toward what is going on in the Middle East, we have as much attention, focus and commitment as we have ever had right here to Ukraine,” he said, standing outside of St. Michael’s Church in Kyiv. But many Ukrainians are worried. President Volodymyr Zelenskyy acknowledged the fatigue earlier in November. “Yes. A lot of people, of course, in the world are tired,” he said in an interview on NBC’s “Meet the Press.” The war in the Middle East also presents an opportunity to Russian President Vladimir Putin by taking the spotlight off Ukraine. “Of course, Russia is very happy with this war,” Zelenskyy added. Millions of Ukrainians are burdened by the realization that the war Russia initiated in their country won’t end any time soon. “No matter how frightening it may sound, I am preparing myself for the fact that this war will last my entire life,” said Zoya Krasovska, a 34-year-old resident of Lviv, who says her greatest fear is that allies will divert resources to other conflicts. “It’s akin to receiving a diagnosis of an incurable illness, where you don’t stop living because of it, but you live with the awareness that it is with you forever,” Krasovska said. Unlike 2022, when morale was high despite power outages, disrupted water service and blackouts, this year Ukrainians face the frustration of the slow counteroffensive and shortages of sophisticated weapons.Domestic politicshave become a greater focus. Postoiuk, a Netherlands-based development manager for the Way to Ukraine fund, said the team expected a decline in donations, but not to this extent. Since the Israel-Hamas war broke out, it takes at least twice as long to raise enough money to buy a car for the army — usually $8,000 to $14,000. Through their work, they have collected nearly $147,000 — money that supported 13 brigades and provided vehicles that included 15 pickups, three SUVs, an ambulance and a drone. For the first time in the history of the fund, donations from within Ukraine have exceeded those from abroad, he said. Ukraine’s “war for independence is simply not on the agenda anymore, at least for now,” he said. Ivan Bezdudnyi, a 26-year-old from Kyiv, is consumed by the war in his country. For the past two years, he has been involved in documentingRussian war crimes. Little has changed for him personally since the outbreak of the war in the Middle East. He does not worry that diminishing interest will affect Ukraine’s war for long. “When the wave of interest in Israel and Hamas subsides, and I tend to think it won’t last long … the level of attention we had will remain,” he said. “Maybe not as high as in February or March of last year, but probably higher than it is now.” ___ Associated Press writers Lori Hinnant in Paris and Samya Kullab in Kyiv, Ukraine, contributed to this report. ___ Follow AP’s coverage athttps://apnews.com/hub/russia-ukraine      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_5",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/russia-ukraine-missile-strike-85dea3d9af59589d372333a23de9130a",
    "title": "A look at Russia’s deadliest missile attacks on Ukraine",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. In this photo provided by the Ukrainian Presidential Press Office, firefighters work to extinguish a fire after the deadly Russian rocket attack that killed more than 40 people in the village of Hroza near Kharkiv, Ukraine, Thursday, Oct. 5, 2023. (Ukrainian Presidential Press Office via AP) In this photo provided by the Ukrainian Presidential Press Office, emergency workers search the victims of the deadly Russian rocket attack that killed more than 40 people in the village of Hroza near Kharkiv, Ukraine, Thursday, Oct. 5, 2023. (Ukrainian Police Press Office via AP) In this photo provided by the Ukrainian Police Press Office, emergency workers search the victims of the deadly Russian rocket attack that killed more than 40 people in the village of Hroza near Kharkiv, Ukraine, Thursday, Oct. 5, 2023. (Ukrainian Police Press Office via AP)       Since the start of its full-scale invasion of Ukraine, the Russian military has repeatedly used missiles to blast civilian targets across the country, with devastating consequences. One of the deadliest such attacks happened Thursday when President Volodymyr Zelenskyy and other top officials in Kyiv reported that a Russian rocket struck a cafe and store in the village of Hroza in eastern Ukraine, killing at least 51 civilians. The Kremlin often claims its missiles are aimed at military assets or blames the strikes on Ukraine. A spokesman for President Vladimir Putin insists Russia does not target civilians. A look at some of the deadliest strikes: ___ MARCH 9, 2022 — An apartment building in Izium in eastern Ukraine was hit in an attack that Human Rights Watch later said killed at least 44 people. Russian forces took control of the city and surrounding area beginning in late March andoccupied it for six months. At the time of the strike, HRW said the area was under the control of Ukrainian forces who were trying to keep Russian troops from entering the city. MARCH 16, 2022 — A Russian airstrike hit a theater in Mariupol, killing hundreds of civilians sheltering in the basement. Ukrainian officials initially put the death toll at 300, but an Associated Press investigation later found evidence that the attack was fardeadlier and killed closer to 600 peopleinside and outside the building. Russia claimed the theater was demolished by Ukrainian forces or served as a Ukrainian military base. APRIL 8, 2022 — Thetrain station in Kramatorskin eastern Ukraine was hit by a Russian missile as passengers, mostly women and children, tried to flee the fighting. Sixty-one people were killed and 135 wounded. The remnants of a rocket were painted with the words “For the children” in Russian, implying that children were being avenged by the strike, though the exact reason for the wording was unclear. Ukrainian President Volodymyr Zelenskyy said it was a deliberate attack. Russia’s Defense Ministry accused Ukraine of carrying out the strike.  JUNE 27, 2022 — Long-range Russian bombers struck a crowded shopping mall inUkraine’s central city of Kremenchukwith a supersonic missile, killing more than 20 people. About 1,000 people were inside the building. Zelenskyy called the strike “one of the most daring terrorist attacks in European history.” Russia said the missile was directed at a nearby weapons depot. JULY 1, 2022 — A Russian airstrike on residential areas killed at least 21 people near the Ukrainian port of Odesa, a day after the withdrawal of Russian forces from an island in the Black Sea. Zelenskyy’s office said warplanes fired three missiles that struck an apartment building and a campsite. JULY 9, 2022 — Russian rockets smashed into apartment buildings in eastern Ukraine,killing at least 15 peoplein the town of Chasiv Yar. The buildings were mostly home to people who work in nearby factories. At least six people were dug out of the rubble. JULY 14, 2022 — Kalibr cruise missiles fired from a Russian ship in the Black Sea killed at least 29 people and wounded more than 100 others in the central Ukrainian city of Vinnytsia. Zelenskyy accused Russia of deliberately targeting civilians in locations with no military value. He said the victims included a 4-year-old girl. Russia said it was attacking a Ukrainian officers’ residence. SEPT. 30, 2022 — Four Russian missiles targeted a convoy of cars on the outskirts of the southern city of Zaporizhzhia, killing 30 people, including children. Ukrainian officials said the missiles were launched from an S-300 anti-aircraft missile system and hit a column of vehicles sent to ferry people to safety from Russian-occupied territory. JAN. 14, 2023 — One of thedeadliest attacks on civilianstook place when a Russian missile hit an apartment building in the southeastern city of Dnipro, killing 45 people, including six children. Ukrainian military officials said at the time that they did not have a system that could take down the type of the supersonic missile that was used, Russia’s Kh-22 missiles. APRIL 28, 2023 —An apartment blockfar from the front lines was blasted at night by two long-range cruise missiles in the city of Uman, about 215 kilometers (134 miles) south of Kyiv. At east 21 people were killed, including three children. The Russian Defense Ministry said the missiles were aimed at places where Ukrainian military reserve units were staying before their deployment to the battlefield. SEPT. 6, 2023 — Sixteen people were killed when a missile struck abusy market in Kostiantynivkain eastern Ukraine, turning it into a fiery, blackened ruin. Zelenskyy said the strike was retribution for Ukrainian advances on the battlefield. A Russian Foreign Ministry spokeswoman said Ukraine fired the missile. OCT. 5, 2023 — A village cafe and store in eastern Ukraine was hit by a Russian rocket, killing at least 51 civilians in one of the deadliest attacks of the year. Zelenskyy denounced the strike in the village of Hroza as a “demonstrably brutal Russian crime” and “a completely deliberate act of terrorism.” The cafe was hosting a wake following a funeral.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_6",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/russia-ukraine-war-yukov-attrition-body-collector-43bfc0848fdaa9b36d63abfa8c24f885",
    "title": "The true toll of the war in Ukraine is measured in bodies. This man brings them home, one at a time",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Oleksii Yukov examines the body of a Russian soldier he collected on the frontline in the Sloviansk region, Ukraine, Oct. 24, 2023. (AP Photo/Bram Janssen) Oleksii Yukov inspects the necklace of a deceased Russian soldier in Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. “We are not fighting the dead,” he said. “I don’t separate the bodies of Russian soldiers and Ukrainian soldiers. They are all souls for me.” (AP Photo/Bram Janssen) FILE - The bodies of 11 Russian soldiers lie on the ground in the village of Vilkhivka, recently retaken by Ukrainian forces near Kharkiv, Ukraine, Monday, May 9, 2022. More than half a million people have been killed or seriously injured in two years of war in Ukraine, according to Western intelligence estimates -- a human toll not seen in Europe since World War II. (AP Photo/Felipe Dana, File) Oleksii Yukov and his team members wait for colleagues to offload the bodies of Russian soldiers they’ve collected from the frontline in the Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. “Sometimes I just want to scream. To yell. Because you realize what madness and pain it is,” Yukov says. “I understand that I do not have enough life to finish this work of searching for the dead.” (AP Photo/Bram Janssen) Oleksii Yukov examines the body of a Russian soldier he collected on the frontline in the Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. Yukov understands that for people far away, war is geopolitics, death can be counted in numbers, and money matters more than men. But he knows better. “War has one face,” he said. “Death and stupidity and horror.” (AP Photo/Bram Janssen) Oleksii Yukov’s team members offload the bodies of Russian soldiers they’ve collected from the frontline in the Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. Yukov and his team retrieve bodies from the frontline to barter for Ukrainian bodies in periodic exchanges of war dead. (AP Photo/Bram Janssen) Team members of Oleksii Yukov offload the bodies of Russian soldiers they’ve collected from the frontline from their pickup truck in the Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. More than half a million people have been killed or seriously injured in two years of war in Ukraine, according to Western intelligence estimates -- a human toll not seen in Europe since World War II. The question of who prevails is being increasingly shaped by which side can tolerate higher losses. (AP Photo/Bram Janssen) A member of Oleksii Yukov’s body collector team piles the bodies of deceased Russians in a refrigerated truck in the Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. They retrieve bodies from the frontline to barter for Ukrainian bodies in periodic exchanges of war dead. (AP Photo/Bram Janssen) Oleksii Yukov, a Ukrainian volunteer body collector, casts a shadow over a refrigerated truck decorated with the Ukrainian flag in Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. The 38-year-old martial arts instructor says he’s collected over 1,000 bodies since the full-scale invasion began two years ago, more than 580 of them Russians. (AP Photo/Bram Janssen) In this image from video provided by Platsdarm, a group of body collectors led by Oleksii Yukov, a kitten nuzzles Yukov in Dovhenke, Ukraine in November 2022, during a search for Oleksandr “Sasha” Romanovych Hrysiuk. The cat circled one spot in the wreckage. “Souls come over and wander next to us,” Yukov explained. “A sign came to show us where he was lying... He wants to be back home. Mother is waiting.” (Platsdarm via AP) In this image from video provided by Platsdarm, the group of body collectors led by Oleksii Yukov, Yukov lies in a vehicle after he stepped on a mine in Dovhenke, Ukraine, on Sept. 19, 2022. I was like, ‘OK. Legs are in place.’ But suddenly, I can’t see with my eye. There’s no eye.” (Platsdarm via AP) A main road leads to the frontline in the Sloviansk region, Ukraine, Wednesday, Oct. 25, 2023. (AP Photo/Bram Janssen) CORRECTS DESCRIPTION OF VIEW This combination of satellite images provided by Maxar Technologies shows an increase in storage space for cremated remains at a Wagner Chapel in Russia’s southern Krasnodar region from Dec. 10, 2021 to Sept. 25, 2023. (Maxar Technologies via AP) This combination of satellite images provided by Maxar Technologies and Planet Labs shows the Federal Military Memorial Cemetery in Mytishchi, Russia on Oct. 7, 2021; June 19, 2023 and March 3, 2024, with an increasing number of graves. (Maxar Technologies, Planet Labs via AP) This combination of photos provided by Planet Labs shows the Field of Mars war memorial outside of Lviv, Ukraine on May 5, 2022, top, and with graves added, seen on Oct. 18, 2023. (Planet Labs via AP) ADDS DATE AND LOCATION In this photo from April 2022 provided by his family, Oleksandr “Sasha” Romanovych Hrysiuk, in uniform, poses next to a luxury automobile in Ukraine’s Mykolaiv region. Soldiers from Sasha’s unit said they were very sorry they couldn’t take his body with them, the shelling was too heavy, all they could do was hide him in a cellar in Dovhenke – a rural settlement in eastern Ukraine that fell to the Russians. (Courtesy Olha Hrysiuk via AP) ADDS INFORMATION ON PERSON AT RIGHT This image provided by his family shows Oleksandr “Sasha” Romanovych Hrysiuk, left, as a young conscript in 2017, standing next to a childhood friend, beneath Ukrainian text that reads, “We will always remember you. Soft clouds to you.” Hrysiuk, 27 years old, had lasted exactly six weeks at war. (Courtesy Olha Hrysiuk via AP) This photo provided by the family shows the grave of Oleksandr “Sasha” Romanovych Hrysiuk, who was buried in Kvitneve, Ukraine, in March 2023. Olha visits her son’s grave every day, to sit with him, talk with him and pray that he – and perhaps she herself -- finds peace. (Courtesy Olha Hrysiuk via AP) Oleksii Yukov, a Ukrainian body collector, stands for a portrait in the Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. He tells the mothers of those killed to talk about their dead children, so they will be remembered. (AP Photo/Bram Janssen) FILE - The remains of a Russian soldier lies abandoned in Sviatohirsk, Donetsk region, Ukraine, Wednesday, Dec. 21, 2022. (AP Photo/Andriy Andriyenko, File) FILE - The bodies of Russian soldiers lie at the frontline in Andriivka, Donetsk region, Ukraine, Saturday, Sept. 16, 2023. (AP Photo/Mstyslav Chernov, File) FILE - The body of a Russian soldier lies inside a building in the village of Blahodatne, Ukraine, Saturday, June 17, 2023. (AP Photo/Evgeniy Maloletka, File) FILE - Oleksii Yukov, second right, and other body collectors carry the body of a Russian soldier that was exhumed from a shell crater in front of destroyed school in Virnopillia, Ukraine, Thursday, July 6, 2023. (AP Photo/Evgeniy Maloletka, File) Oleksii Yukov and his team drive through a pothole on a road towards the frontline in Sloviansk region, Ukraine, Wednesday, Oct. 25, 2023. The 38-year-old martial arts instructor who leads a team of volunteer body collectors in Ukraine says he’s collected over 1,000 bodies since the full-scale invasion began two years ago, more than 580 of them Russians. (AP Photo/Bram Janssen) Oleksii Yukov says the same thing to all the Ukrainian mothers. He tells them to talk about their dead children, so they will be remembered. It is Yukov’s job to bring the dead home, one body at a time.                                                  DOVHENKE, Ukraine (AP) — The smell in the car is sick and sweet, the overpowering scent of corpses that have lain too long in muck and ruin, the ones the dogs didn’t devour. Oleksii Yukov, a 38-year-old martial arts instructor who leads a team of volunteer body collectors in Ukraine, doesn’t notice. He is on the phone with one of the mothers. She heard her son was injured in battle and left behind, but she’s not sure where. “He was left to die and now they are telling me that ‘he died as a hero!?’” she says, choking out words between sobs. “Don’t cry,” Yukov tells her. “Because if you get weak — no one will help him ... Don’t cry in front of anyone! They are not worth it. Cry in front of the grave of your son only.” Feb. 2024 drone video of dead Russian soldiers in Avdiivka, Ukraine. (Ukrainian 47th Brigade military video via AP) “We will take everyone back,” he promised. “We just need some time.” Yukov says the same thing to all the mothers. He tells them to talk about their dead children, so they will be remembered. There is one person in particular whose story Yukov does not want forgotten: Oleksandr Romanovych Hrysiuk — Sasha, to his mother, Olha. In a cryptic voice message last year, Yukov urged Olha to tell Sasha’s story. “Not everyone has such a story,” he told her.  But he left out the most important part: What it had cost him to bring Sasha home. A main road leads to the frontline in the Sloviansk region, Ukraine, Wednesday, Oct. 25, 2023. (AP Photo/Bram Janssen)  The true toll of the war in Ukraine — and the odds faced by each side — can be measured in bodies. More than half a million people have been killed or seriously injured in two years of war in Ukraine, according to Western intelligence estimates — a human toll not seen in Europe since World War II. The question of who prevails is being increasingly shaped by which side can tolerate higher losses. By that measure, Moscow has the upper hand. Analysts say it will be hard for Ukraine to outmatch Russian forces, which continue to grow despite hundreds of thousands of casualties, without significant resources from its international partners. But the U.S. Congress has not approved $60 billion in aid for Ukraine, even as soldiers at the front run low on ammunition. Oleksii Yukov and his team members wait for colleagues to offload the bodies of Russian soldiers they’ve collected from the frontline in the Sloviansk region, Ukraine, Oct. 24, 2023. (AP Photo/Bram Janssen)  “Putin is not running a democracy,” said Evelyn Farkas, a former senior Pentagon official for Russia and Ukraine who now heads the McCain Institute at Arizona State University. “Putin can afford to be more callous and disregard the body count.” Ukrainian President Volodymyr Zelenskyy, on the other hand, is presiding over a more democratic system, “where the will of the people is actually the strongest component of their war machine.” Russia had 3.7 times more men of fighting age than Ukraine in 2022, according to World Bank data. That means that though Russia has sustained nearly twice as many casualties as Ukraine, according to Western intelligence estimates, on a per capita basis Russia’s losses remain lower than Ukraine’s.  At current levels of recruitment, the Kremlin can sustain current attrition rates through 2025, according to an assessment by the Royal United Services Institute (RUSI), a think tank in London. Meanwhile, Ukraine this week took the politically difficult step of lowering the military conscription age from 27 to 25 in an effort to replenish its ranks. “Manpower is another currency,” said Nick Reynolds, a research fellow at RUSI. “The Russians with their industrial base and larger manpower can expend manpower and materiel at less cost.” Have a news tip? Contact AP’s global investigative team at[email protected].For secure and confidential communications, use the free Signal app+1 (202) 281-8604. Yukov understands that for people far away, war is geopolitics, death can be counted in numbers, and money matters more than men. But he knows better. “War has one face,” he said. “Death and stupidity and horror.” Oleksii Yukov says the same thing to all the Ukrainian mothers. He tells them to talk about their dead children, so they will be remembered. It is Yukov’s job to bring the dead home, one body at a time. (AP Video/Bram Janssen and Anton Shtuka) The last time Olha Hrysiuk spoke with her son, Sasha asked about the spring crops, the vegetable garden, their horses and cows, were the chickens laying many eggs? The conversation went on, as if they had all the time in the world. It was May 15, 2022. Sasha vanished the next day. For three days, Olha knew only silence. She accepted it, because Sasha had told her he was going on a mission and might be out of touch. On the fourth day, she called the head of her village, who called the nearest military office, who contacted his military unit, who said that Sasha was missing. Sasha wasn’t a born fighter. An athlete, he studied physiotherapy before he was drafted and packed off on April 3, 2022. Olha gave him a silver cross on a chain to hang around his neck as he went into battle. Where was her boy now, she wondered, the kid with the sweet smile and ears that stuck out, who loved to run and had so many friends she couldn’t keep count? Where was her son, who dreamed of building a home for the family he did not yet have? “In Ukraine, we have a saying that God takes the best away,” Olha said. “I think this is the case.” Oleksii Yukov inspects the necklace of a deceased Russian soldier in Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. (AP Photo/Bram Janssen)  After pleading on social media for information, Olha’s daughter-in-law managed to speak directly with some soldiers from Sasha’s unit. They said Sasha was dead. They were very sorry they couldn’t take his body with them, the shelling was too heavy, all they could do was hide him in a cellar in Dovhenke — a rural settlement in eastern Ukraine that fell to the Russians. They would write his name on the shells they fired because they loved him too. He was a hero, they said. In this photo from April 2022 provided by his family, Oleksandr “Sasha” Romanovych Hrysiuk, in uniform, poses next to a luxury automobile in Ukraine’s Mykolaiv region. (Courtesy Olha Hrysiuk via AP)  Sasha, 27 years old, had lasted exactly six weeks at war. It was time for him to come home. If Olha couldn’t have her son back, she’d take whatever pieces were left. But how? Olha started making calls, so many that she had to buy a notebook to keep track. She said she called the Ukrainian Red Cross, the International Committee of the Red Cross, Ukraine’s National Information Bureau, the Ukrainian military, the Coordination Headquarters for the Treatment of Prisoners of War, every hotline and volunteer group she could find. She emailed the Commissioner for Human Rights and wrote letters to the Ministry of Defense and even to President Zelenskyy himself. She wrote down who answered, who didn’t, and, mostly, who told her to wait, wait, wait. For six months, Olha tried. “I just could not live without trying,” she said. “How is it possible to not even see the bones of your child! I was even ready to go to Dovhenke myself!” In the end, people told her that if Black Tulip couldn’t bring Sasha home, no one could. Black Tulip is the name of the network of volunteer body collectors Yukov worked with back in 2014, when Russia seized Crimea and pushed into eastern Ukraine. Black Tulip has since disbanded but the name stuck. Yukov went on to found his own group,called Platsdarm, which can be translated as “bridgehead,” to continue Black Tulip’s mission. It is Yukov’s job to bring everyone back. He has collected the fragments of a man scattered across the trees and restored the scraps to the soldier’s mother. He has pulled hot human remains from a smoldering helicopter. Once, a mother asked him to please retrieve her son’s arm, which she’d heard was left dangling in a particular tree; he did. He has rooted through feces to retrieve the finger bones and teeth of men whose corpses were eaten by pigs. “Listen, if your child was killed, you would gnaw through this s— with your teeth to bury the body,” he said. Yukov is racing against time, which eats up corpses, to bring all the souls home. But there are too many. He can’t fit them all in his car, no matter if he straps them to the roof, carries them in his hands. They overwhelm him. “Sometimes I just want to scream. To yell. Because you realize what madness and pain it is,” he said. “I understand that I do not have enough life to finish this work of searching for the dead.” Yukov’s story is the story of the bloodlands of Ukraine, a landscape transformed by generations of conflict. He grew up cold and hungry in Sloviansk, in eastern Ukraine, one of five children. They made it through one winter by foraging dried peas packed in his brother’s punching bag. He learned to share, down to his last piece of bread. When Yukov was around six, a local cemetery got dug up to make way for a new children’s hospital. Bulldozers heaved piles of clothes and bones; children ran around playing with skulls stuck on the end of sticks. He was shocked and ashamed as he stood before the unburied dead. “I looked at the bones and thought, “Crap …these are people!’” Yukov recalled. “What if my relatives are buried in this place?” The forests of Yukov’s childhood were filled with the bones of German and Soviet soldiers from World War II, some so densely strewn they looked like snow. He started searching for the dead when he was thirteen, but at first he made mistakes. The souls he offended — or failed to find — haunted him. He felt them poke his ribs as he slept and he woke up dizzy, his nose bleeding. “Why do you keep coming?” he demanded of his phantoms. “What do you need?” As a boy, he dreamt he was running in a forest, jumping over pits and trenches until he tumbled into a hole, falling deep into ruby-colored light. He smelled the bodies before he saw them, bones sliding beneath his feet as he sank. “Someone grabs me by the scruff of the neck, whispering, ‘We have to be buried,’” he recalled. He woke up wet with sweat. He knew what he had to do. “Until they are buried according to their traditions and rituals, a soul will suffer. So it’s very important for me, even if it is an enemy, to return them home to be buried properly, for their souls to be calm,” Yukov said. “‘Collectors of souls’ is what the locals call us.” In late summer 2022, Olha and her other son reached out to Yukov, seeking help. They sent along photos of Sasha and his tattoo, as well as satellite images of his approximate location. Yukov got to Dovhenke in September, not long after the Russians left. More than 90 percent of buildings there had been destroyed or damaged, and it was hard to find the cellar where Sasha’s unit said they’d left him. Also, there were mines. They spent days searching. On Sept. 19, Yukov took a step and heard a click. The force of the explosion knocked him to the ground. “I was laying there and I felt like I had no legs,” Yukov said. “I was like, ‘It’s fine, I’ll get a prosthesis.’ ... But I saw holes and blood spraying from my legs. I was like, ‘OK. Legs are in place.’ But suddenly, I can’t see with my eye. There’s no eye.” His team came running for him, screaming. “STOP! DON’T RUN, STAND STILL!” Yukov hollered back, worried they’d get blown up too. “Bring tourniquets and a stretcher!” They drove him to the hospital fast, in silence, their dog panting above the high whine of the straining engine. Yukov was limp in the backseat, legs cinched with tourniquets. He gingerly touched a bloodied white cloth to the spot where his right eye used to be. Two weeks later, Yukov led everyone back to Dovhenke, his eye patched like a pirate, and stumbled around on crutches trying to find Sasha. But it was still too dangerous, and they had to wait another few weeks for the mines to be cleared. By then, Yukov had a new glass eye, which looks incredibly real until he raps on it with his knuckles. When they finally got back to Dovhenke to search for Sasha, a small grey kitten with an injured nose kept jumping on Yukov’s shoulder, nuzzling him. The cat circled one spot in the wreckage. They started digging there. In this image from video provided by Platsdarm, a group of body collectors led by Oleksii Yukov, a kitten nuzzles Yukov in Dovhenke, Ukraine in November 2022, during a search for Oleksandr “Sasha” Romanovych Hrysiuk. (Platsdarm via AP)  “Souls come over and wander next to us,” Yukov explained. “A sign came to show us where he was lying ... He wants to be back home. Mother is waiting.” Sasha was pancaked beneath the rubble of a collapsed building. The place was scorched. There were fragments of 120mm mortars and signs of a massive blast. By the time they’d pried through the last layers of concrete, it was dark. Denys Sosnenko, a 21-year-old who Yukov used to coach at kickboxing, went down in the pit to comb the dirt with his fingers, looking for bones. Yukov told Denys to try to keep the fragments of Sasha’s head together in what was left of his helmet. He handed part of Sasha’s skull, wet and yellowed, to Yukov, who placed it gently down in a large white bag. It was hard to keep track of all the pieces because it was pitch black and they were working by flashlight. Denys pulled out a silver, soil-caked cross and set it aside, then a spoon and a watch. Yukov went on, making a rough anatomical inventory of what was left of Sasha. An arm. The backbone. Pelvis. Femur. Elbow. “Wait,” Yukov said. “Where is the other arm and shoulder blade?” It was Nov. 25, 2022. Two months later, Denys drove over a landmine while searching for bodies and died. As in most wars, both sides have downplayed or obscured their losses, and the true toll may not be known for years. But from the sky, the multitudes of dead are already transforming the landscape. The graves look the same on both sides of the front: fields, once empty, now quilted with patchworks of fresh tombstones. President Zelenskyy recently said that 31,000 Ukrainian soldiers have been killed in the war, less than half what Western intelligence has estimated. Russia’s losses are thought to be roughly double Ukraine’s. Using satellite imagery and site visits, The Associated Press documented the rapid growth of soldiers’ graves at a few key sites in Russia and Ukraine where the war dead have accumulated at scale. By March, more than 650 soldiers lay in what was open land outside Lviv two years ago, and there were more than 800 new soldiers’ graves in one Kyiv cemetery. Some 700 graves appeared in two plots for soldiers in a Kharkiv cemetery between Feb. 2022 through Sept. 2023, satellite images show. The AP also counted at least 1,345 new soldiers’ graves at a Dnipro cemetery in March, edged by six neat rows of empty pits in the earth waiting for more bodies. Many more dead are scattered across both Ukraine and Russia, discreetly tucked among civilian graves. Mediazona, an independent Russian media outlet, has identified the locations of dozens of Russian cemeteries that have swelled with war dead. Along with the BBC’s Russia service and a network of volunteers, they’ve confirmed the deaths of around 50,000 Russian soldiers killed since the full-scale invasion, a number they say probably captures just over half of the true death toll. Their count does not include Russian fighters from occupied territories in Ukraine. This combination of satellite images provided by Maxar Technologies shows an increase in storage space for cremated remains at a Wagner Chapel in Russia’s southern Krasnodar region from Dec. 10, 2021 to Sept. 25, 2023. (Maxar Technologies via AP)  The dead cannot be hidden from space. Satellite images show more than 750 graves at the Wagner cemetery in Bakinskaya, a town near the Black Sea, up from around 170 in Jan. 2023. About 15 kilometers (9 miles) away, an estimated 2,646 compartments for cremated remains have been built into new rows of dark grey walls at the Wagner Chapel, though it wasn’t possible to say how many were filled. The number of war dead buried at the Federal Military Memorial Cemetery north of Moscow, has tripled in the last year, to an estimated 846 graves. These are the lucky ones, the ones who made it home. This combination of satellite images provided by Maxar Technologies and Planet Labs shows the Federal Military Memorial Cemetery in Mytishchi, Russia on Oct. 7, 2021; June 19, 2023 and March 3, 2024, with an increasing number of graves. (Maxar Technologies, Planet Labs via AP)  Yukov says he’s collected over 1,000 bodies since the full-scale invasion began two years ago, more than half of them Russians. “We are not fighting the dead,” he said. “I don’t separate the bodies of Russian soldiers and Ukrainian soldiers. They are all souls for me.” One night in October, Yukov returned from a mission near Sloviansk with black body bags strapped to the roof of his car. They bounced perilously over potholes, as he sped to deliver the cargo to a morgue. The count that day was 11 Russians and one leg, which was probably Ukrainian, judging by its boot. Their wounds would be documented. The things they carried — amulets that hadn’t worked, kids’ drawings, family photos, letters of love and despair — would be collected and cataloged. Their DNA would be tested, if necessary, and their identities logged in government databases. The Ukrainians, Yukov hoped, would find their way home. The Russians would become currency to barter for Ukrainian bodies in periodic exchanges of war dead. Oleksii Yukov, second right, and other body collectors carry the body of a Russian soldier that was exhumed from a shell crater in front of destroyed school in Virnopillia, Ukraine, July 6, 2023. (AP Photo/Evgeniy Maloletka, File)  “When someone says, “I am tired of war,” yes, we are all tired,” Yukov said. “But we just need you to understand: Help us. Don’t stand aside. Because war has no borders. War will cross your doorstep too.” He peered into a body bag. The corpses had baked in the sun and the meat of their faces was partly mummified. Yukov figured they’d been dead for around three months. Suddenly angry, Yukov began speaking in agitated Russian. “You carried this child in your womb,” he said, “Now your Russian boys are lying here, in Ukrainian soil. Why did you let them come here? You knew what this was all about, that they were going to kill and be killed.” Yukov looked down at the bodies laid out on the night grass. “This is where it all ends,” he said. He turned away and let out a little laugh, then stopped talking and shook his head in silence. “So, I don’t know … It’s stupidity.” Oleksii Yukov examines the body of a Russian soldier he collected on the frontline in the Sloviansk region, Ukraine, Oct. 24, 2023. (AP Photo/Bram Janssen)  Olha hoped for a long time that missing meant alive. But when Yukov sent a photograph of the necklace they’d found in the cellar in Dovhenke, Olha recognized it instantly. It was the same silver Jesus she’d given Sasha when he left for war, only now it was an exhibit, number 3118, mud-flecked evidence of the dead. Olha never got to see her son’s face again. By the time she got the body back, Sasha had no face anymore. This was hard for her because it allowed her to nurture a tiny, painful hope that there had been some mistake. Yukov is a destroyer of hope for mothers. But they thank him anyway. “I am glad we managed to do it,” Yukov messaged Olha, after he found Sasha. “We hug you and hope that we can meet you to get to know more about him. We are holding the sky together with you.” “Your work is priceless,” she replied. Olha buried what was left of Sasha on March 16, 2023 in her village cemetery, beneath a cross bandaged with flowers and ribbons. “It’s very important for me to know his body is next to me,” Olha said. “We are all waiting for victory. For me, it’s the most important thing. If we do not win, what did my son die for — and so many other sons?” Yukov never told Olha he’d lost an eye trying to find her son. This photo provided by the family shows the grave of Oleksandr “Sasha” Romanovych Hrysiuk, who was buried in Kvitneve, Ukraine, in March 2023. (Courtesy Olha Hrysiuk via AP)  When she heard what had happened, she nodded faintly, her frown deepening to an expression of infinite sadness. “I cannot express with words how grateful I am,” she said. She opened her hands and looked up, searching for sounds that could convey the enormity of loss. “I’m so shocked ... As long as I live, I will remember the sacrifice he made for me and my family.” Olha visits Sasha’s grave every day, to sit with him, talk with him and pray that he — and perhaps she herself — finds peace. “Whatever people say, I know Sasha wanted to come home,” Olha said. “Sometimes I watch TV, the internet, TikTok, whatever, and I think: That’s it, we lost. I feel like giving up … But when I watch videos of Oleksii (Yukov), I want to keep helping. If there are people like Oleksii, nothing is lost yet in Ukraine.” ___ AP journalists Michael Biesecker in Washington and Volodymyr Yurchuk and Vasilisa Stepanenko in Ukraine contributed to this report.     Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_7",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/russia-ukraine-war-winter-firewood-candles-energy-4f8c111942f5a4883626db1afae8c35e",
    "title": "Ukrainians prepare firewood and candles to brace for a winter of Russian strikes on the energy grid",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Yuriy Musienko, 45, works in a burned car garage near his mother’s house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) Anatoliy Fedorko, 56, chops wood near his house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) Andriy Gorghinskyy 49, stands with a bulldog near his house, in the village of Malyutyanka near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators.(AP Photo/Alex Babenko) A man passes his destroyed house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) Artem Yarema, 13, chops wood in front of his family’s house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) The man enters his temporary module house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) Anatoliy Fedorko, 56, chops wood near his house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) A Ukrainian flag is seen through the hole from shell fragment, in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) Artem Yarema, 13, carries wood near his family’s house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) Andriy Gorghinskyy 49, is seen in his parent’s house with autonomous heating in the village of Malyutyanka near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) Artem Yarema, 13, chops wood, while his mother Tetyana Yarema, 48 stands in front of the family’s house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators. (AP Photo/Alex Babenko) Andriy Gorghinskyyб 49, stands in his house with autonomous heating, in the village of Malyutyanka near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. Many Ukrainians are expecting the same or worse this coming winter and have spent months preparing, including collecting firewood and buying generators.(AP Photo/Alex Babenko)                         MOSHCHUN, Ukraine (AP) — In the humble backyard of a destroyed house, a 13-year-old chops firewood to get ready for winter. His mother, Tetiana Yarema, has been preparing for months as she remembers last winter’s Russian strikes on the energy infrastructure that plunged Ukraine into darkness. “Those were dark days. I didn’t want anything. I just wanted to pack my things and go abroad,” said Yarema, 48, who says she ended up staying because of her son’s insistence. For the Yarema family, like millions of other Ukrainians touched by Russia’s war on Ukraine, winter is an especially challenging time. The mother and son live in trailers that were set up in their backyard after fighting in the early days of the war destroyed their house in Moshchun, a village about 25 kilometers (15 miles) northwest of Kyiv. “I have a feeling that when the cold sets in, they’ll start bombing again,” the woman said, echoing the sentiments of many Ukrainians. This time, however, they say they are better prepared.  Sales of generators exploded toward the end of summer. Some, who can afford it, have invested in solar panels. Others, like Yarema, have been purchasing candles, batteries, flashlights, and portable lanterns and stocking up on compact gas canisters, making the most of discounted prices. Anatoliy Fedorko, 56, chops wood near his house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. (AP Photo/Alex Babenko)  “It’s a bit challenging … but I already know what to do,” she said. Last winter was declared the most challenging in the history of Ukraine’s energy system, with over 1,200 missiles and drones fired by Russians at power plants, according to Ukrainian state-owned grid operator, Ukrenergo. The strikes impacted almost a half of Ukraine’s energy capacity. People were forced to endure hours without electricity and water during the coldest months in what Ukrainian officials described as “energy terror.” Millions of people across Ukraine had to learn to work, live, and cover their basic needs without relying on electricity. Artem Yarema, 13, carries wood near his family’s house in Moshchun, near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. (AP Photo/Alex Babenko)  After a lull of six months, Ukraine’s energy system sustained its first attack of the season on Sept. 21, resulting in damage to facilities in the central and western regions, Ukrenergo said. Ukrainian President Volodymyr Zelenskyy has committed to substantially enhancing air defense systems, which already have demonstrated greater effectiveness than the previous year. “Everyone must play their part in defensive efforts to ensure that Russian aggression does not halt Ukraine this winter. Just as on the battlefield, in all areas, we must be resilient and strong,” Zelenskyy said in a recent address to the nation. Ukrainian Prime Minister Denys Shmyhal recently announced that the United States has allocated $522 million for energy equipment and the protection of Ukraine’s infrastructure. “We stand on the threshold of a difficult winter. Thanks to the assistance of our allies, we successfully weathered the last, which was the most challenging winter season in our history,” Shmyhal said. Andriy Gorghinskyy 49, is seen in his parent’s house with autonomous heating in the village of Malyutyanka near Kyiv, Ukraine, Tuesday, Oct. 10, 2023. (AP Photo/Alex Babenko)  Major retailer Epicenter said sales of generators increased 80% in August compared to the same time last year, and sales of portable charging stations increased by 25 times. Yurii Musienko, 45, another resident of Moshchun, also plans to rely heavily on firewood, and has a wood-burning stove in his compact wooden trailer that has been provided to him for two years, and which sits next to his ruined home. “I’ve already adapted,” he said with a smile. The gates of his home still bear the holes from exploded ammunition that serve as a reminder of when Russian forces tried to seize the Ukrainian capital. “May no one ever have to endure such conditions,” said his mother, Valentyna Kiriian, who lives in a separate plastic trailer installed in the same courtyard. She’s dressed in a hat and a coat, with multiple layers of clothing to stay warm. She notes that the cold has already set in, forcing her to sleep fully clothed, much like the previous winter. During the power outages last winter, the mother and son relied on canned food. Occasionally, Valentyna would visit her neighbor, whose house remained intact and had a gas stove for boiling water. “It’s difficult for me to talk about. It pains my soul, and my heart weeps,” she said. Private Ukrainian energy producer DTEK has spent the last seven months restoring its damaged infrastructure and fortifying the protection of its equipment for the approaching winter. The company invested about 20 billion Ukrainian hryvnias ($550 million) to prepare for the upcoming season, and it lost billions of hryvnias because of last year’s disruptions caused by Russian attacks, according to CEO Maxim Timchenko. “We learned our lessons,” Timchenko said. Andrii Horchynskyi, 49. who lives in the village of Maliutianka about 25 kilometers (15 miles) southwest of Kyiv, has invested over $30,000 in recent years to ensure his house is self-sufficient, and ramped up those efforts since Russia’s invasion. Last year, he spent $12,000 to install solar panels to help power his spacious house, where other members of his extended family came to stay for the winter — eight of them surviving comfortably. “We had a whole ant heap here,” Horchynskyi recalled. He is convinced the Russians will try to damage Ukraine’s infrastructure for gas, which he thinks will become expensive or even unavailable. So, he has installed a boiler that burns pine pellets. He also stores one and half cubic meters of water in his backyard. “They will bombard even more this winter than the last,” Horchynskyi said. ___ Dmytro Zhyhinas contributed to this report. ___ Follow AP’s coverage of the war in Ukraine:https://apnews.com/hub/russia-ukraine      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_8",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/zelenskyy-ukraine-russia-war-interview-winter-75f1f785b17452fc23819d459e6ab64b",
    "title": "The AP Interview: Ukraine’s Zelenskyy says the war with Russia is in a new phase as winter looms",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. In an exclusive interview, Ukrainian President Volodymyr Zelenskyy says the war with Russia is entering a new stage, with winter expected to complicate the fighting and the Middle East capturing global attention. (Dec. 1) (AP Video/Srdjan Nedeljkovic and Felipe Dana). Ukrainian President Volodymyr Zelenskyy, Commander of Ukraine’s Ground Forces Col.-Gen. Oleksandr Syrsky, right, and Roman Mashovets, deputy head of the Presidential Office, look at a map during their visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. Zelenskyy says the war with Russia is in a new stage, with winter expected to complicate fighting after a summer counteroffensive that failed to produce desired results due to enduring shortages of weapons and ground forces. Despite the setbacks, however, he says in an interview with The Associated Press that “we are not backing down.” (AP Photo/Efrem Lukatsky) Ukrainian President Volodymyr Zelenskyy poses for a photo after his interview with The Associated Press in Kharkiv, Ukraine, Thursday, Nov. 30, 2023. Zelenskyy says the war with Russia is in a new stage, with winter expected to complicate fighting after a summer counteroffensive that failed to produce desired results due to enduring shortages of weapons and ground forces. Despite the setbacks, however, he says that “we are not backing down.” (AP Photo/Felipe Dana) Ukrainian President Volodymyr Zelenskyy talks to the commander of Ukraine’s ground forces, Col.-Gen. Oleksandr Syrsky during a visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. Behind them left to right are: Roman Mashovets, deputy head of the Presidential Office, Defense Minister Rustem Umerov center, and Head of the Presidential Office Andriy Yermak. (AP Photo/Efrem Lukatsky) Ukrainian Defense Minister Rustem Umerov rides in an APC during their visit to the frontline city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky) Ukrainian President Volodymyr Zelenskyy awards servicemen during his visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky) FILE - Ukrainian President Volodymyr Zelenskyy poses for a photo after his interview with The Associated Press in Kharkiv, Ukraine, Nov. 30, 2023. Zelenskyy will address U.S. military officers at the National Defense University as part of a last-minute push to convince Congress to provide more money for weapons before funding runs out. President Joe Biden has asked Congress for $61.4 billion for wartime funding for Ukraine as part of a $110 billion package that also includes money for Israel and other national security priorities. (AP Photo/Efrem Lukatsky, File) Ukrainian President Volodymyr Zelenskyy honors servicemen during his visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky) Ukrainian Defense Minister Rustem Umerov rides in an APC during a visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky) Ukrainian President Volodymyr Zelenskyy shakes hands with a serviceman during his visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky) Ukrainian President Volodymyr Zelenskyy talks with James Jordan, news director for Europe and Africa for The Associated Press during their visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky) Ukrainian President Volodymyr Zelenskyy arrives for an interview with The Associated Press in Kharkiv, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky) Ukrainian President Volodymyr Zelenskyy reacts during his interview with The Associated Press in Kharkiv, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky) Ukrainian President Volodymyr Zelenskyy gestures as he talks during his interview with James Jordan, news director for Europe and Africa for The Associated Press in Kharkiv, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky) Ukrainian President Volodymyr Zelenskyy reacts during his interview with The Associated Press in Kharkiv, Ukraine, Thursday, Nov. 30, 2023. Zelenskyy says the war with Russia is in a new stage, with winter expected to complicate fighting after a summer counteroffensive that failed to produce desired results due to enduring shortages of weapons and ground forces. Despite the setbacks, however, he says that “we are not backing down.” (AP Photo/Efrem Lukatsky) A Ukrainian soldier stands outside a shelter in the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky)                                KHARKIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy saysthe war with Russiais in a new stage, with winter expected to complicate fighting after a summer counteroffensive that failed to produce desired results due to enduring shortages of weapons and ground forces. Despite setbacks, however, he said Ukraine won’t give up. “We have a new phase of war, and that is a fact,” Zelenskyy said in an exclusive interview Thursday with The Associated Press in Kharkiv in northeastern Ukraine after a morale-boosting tour of the region. “Winter as a whole is a new phase of war.” Asked if he was satisfied by the results ofthe counteroffensive, he gave a complex answer. “Look, we are not backing down, I am satisfied. We are fighting with the second (best) army in the world, I am satisfied,” he said, referring to the Russian military. But he added: “We are losing people, I’m not satisfied. We didn’t get all the weapons we wanted, I can’t be satisfied, but I also can’t complain too much.” Zelenskyy also said he fears theIsrael-Hamas warthreatens to overshadow the conflict in Ukraine, as competing political agendas and limited resources put the flow of Western military aid to Kyiv at risk.  And those concerns are amplified by the tumult that inevitably arises during a U.S. election year and its potential implications for his country, which has seen the international community largely rally around it following Russia’s Feb. 24, 2022, invasion. Ukrainian President Volodymyr Zelenskyy, Commander of Ukraine’s Ground Forces Col.-Gen. Oleksandr Syrsky, right, and Roman Mashovets, deputy head of the Presidential Office, look at a map during their visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky)  The highly anticipated counteroffensive, powered by tens of billions of dollars in Western military aid, including heavy weaponry, did not forge the expected breakthroughs. Now, some Ukrainian officials worry whether further assistance will be as generous. At the same time, ammunition stockpiles are running low, threatening to bring Ukrainian battlefield operations to a standstill. Withwinter set to cloak a wartime Ukraineonce again, military leaders must contend with new but familiar challenges as the conflict grinds toward the end of its second full year: There are freezing temperatures and barren fields that leave soldiers exposed. And there’s the renewed threat of widespread Russian aerial assaults in cities that target energy infrastructure and civilians. On Nov. 25,Moscow launched its most extensive drone attackof the war, with most of the 75 Iranian-made Shahed drones targeting Kyiv in a troubling precedent for the months ahead. “That is why a winter war is difficult,” Zelenskyy said. He gave a frank appraisal of the last summer’s counteroffensive. “We wanted faster results. From that perspective, unfortunately, we did not achieve the desired results. And this is a fact,” he said. Ukraine did not get all the weapons it needed from allies, he said, and limits in the size of his military force precluded a quick advance, he said. Ukrainian President Volodymyr Zelenskyy gestures as he talks during his interview with James Jordan, news director for Europe and Africa for The Associated Press in Kharkiv, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky)  “There is not enough power to achieve the desired results faster. But this does not mean that we should give up, that we have to surrender,” Zelenskyy said. “We are confident in our actions. We fight for what is ours.” White House National Security Council spokesman John Kirby, responding to Zelenskyy’s comments about military aid, said the U.S. provided “unprecedented” support. “I certainly can’t dispute President Zelenskyy’s estimation that they haven’t achieved the success that they had hoped to achieve,” Kirby said. “But I can assure you that the United States has done everything we can.” U.S. President Joe Biden’s administration wants to give more but faces resistance from Republican representatives in Congress, Kirby said. “And if we don’t get that support from Congress, the message it is going to send around the world about how much Ukraine matters and how much the United States and our leadership can deliver to our partners around the world is going to be loud and clear and deeply unfortunate,” Kirby said. Zelenskyy said there were some positive takeaways from the last few months. Ukraine managed to make incremental territorial gains against a better-armed and fortified enemy, Zelenskyy said. In addition, the might of Moscow’sBlack Sea Fleethas been diminished, following Ukrainian attacks that penetrated air defenses and struck its headquarters in occupied Crimea, Zelenskyy added. And a temporary grain corridor established by Kyiv following Russia’s withdrawal from a wartime agreement to ensure the safe exports is still working. Zelenskyy, though, isn’t dwelling on the past but is focused on the next stage — boosting domestic arms production. Ukrainian President Volodymyr Zelenskyy reacts during his interview with The Associated Press in Kharkiv, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky)  A sizeable chunk of Ukraine’s budget is allocated for that, but current output is far from enough to turn the tide of war. Now, Zelenskyy is looking to Western allies, including the U.S., to offer favorable loans and contracts to meet that goal. “This is the way out,” Zelenskyy said, adding that nothing terrifies Russia more than a militarily self-sufficient Ukraine. When he last met with Biden, members of Congress and other top officials, he made one urgent appeal: Give Ukraine cheap loans and licenses to manufacture U.S. weaponry. “Give us these opportunities, and we will build,” he said he told them. “Whatever effort and time it will take, we will do it, and we will do it very quickly.” Zelenskyy remains concerned that upheaval in the Middle East, the most violent in decades, threatens to take global attention and resources away from Ukraine’s ability to defend itself. “We already can see the consequences of the international community shifting (attention) because of the tragedy in the Middle East,” he said. “Only the blind don’t recognize this.” Ukrainians understand “that we also need to fight for attention for the full-scale war,” he said. “We must not allow people to forget about the war here.” That change in focus could lead to less economic and military assistance for his country, he said. In an apparent attempt to assuage those fears, U.S. and European officials have continued to visit Kyiv since the Oct. 7 attacks in Israel. The shift still concerns him, Zelenskyy said. “You see, attention equals help. No attention will mean no help. We fight for every bit of attention,” he said. “Without attention, there may be weakness in (the U.S.) Congress.” Turning to the upcoming U.S. presidential and congressional campaigns, where Biden faces skepticism over his staunch support for Kyiv, Zelenskyy acknowledged that “elections are always a shock, and it is completely understandable.” Ukrainian Defense Minister Rustem Umerov rides in an APC during a visit to the front-line city of Kupiansk, Kharkiv region, Ukraine, Thursday, Nov. 30, 2023. (AP Photo/Efrem Lukatsky)  A recent AP poll in the U.S. showed nearly half of Americans think too much is being spent on Ukraine. An increasing number of Republicans are not in favor of sending more aid, and it is not clear if or when a request from the White House for additional aid will be approved by Congress. When asked about this, Zelenskyy replied bluntly that “the choice of Americans is the choice of Americans.” But he argued that by helping Ukraine, Americans are also helping themselves. “In the case of Ukraine, if resilience fails today due to lack of aid and shortages of weapons and funding, it will mean that Russia will most likely invade NATO countries,” he said. “And then the American children will fight.” Zelenskyy has sought recently to ensure Ukraine’s war machine was running as it should by making a recent shakeup of top-level government officials, touching on another of his goals to fight graft in a post-Soviet institution rife with corruption as a prelude to joining the European Union. He said he has to know how weapons, supplies, food and even clothing are being delivered to the front — and what fails to get there. “On one hand, this is not the job of the president, but on the other hand, I can trust those who did not just pass on the information to me, but told me in person,” he said. The static battle lines have not brought pressure from Ukraine’s allies to negotiate a peace deal with Russia. “I don’t feel it yet,” he said, although he added: “Some voices are always heard.” Ukraine wants to “push the formula for peace and involve as many countries of the world as possible, so that they politically isolate Russia,” he noted. The war has also made it impossible to hold a presidential election in Ukraine, originally slated for March under the constitution, he said. Although Zelenskyy said he was ready to hold an election, most Ukrainians are not, believing such a vote to be “dangerous and meaningless” as war rages around them. With a budget anticipating spending 22% of the country’s GDP for defense and national security, Ukraine’s economy is being restructured around a war with no end in sight, much like the day-to-day lives of its citizens. That raised another question: How long can Zelenskyy himself cope with being the leader of a country at war? There are no words to describe how difficult the job is, he said, but he also can’t imagine leaving the post. “You honestly can’t do that,” he said. “This would be very unfair, wrong and definitely demotivating.” ___ Follow AP’s coverage of the war in Ukraine athttps://apnews.com/hub/russia-ukraine. —- Associated Press writer Aamer Madhani in Washington contributed.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_9",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/russia-ukraine-war-avdiivka-attacks-8b5fd038c7e496dcb8f015b759b74666",
    "title": "Ukraine claims a major strike on Russian airfields and thanks US for providing long-range missiles",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. FILE - A Ukrainian soldier in his position in Avdiivka, Donetsk region, Ukraine, on Aug. 18, 2023. Russia is throwing more units into its effort to take this key eastern Ukraine city, Western analysts say, after apparent setbacks that have slowed its dayslong onslaught. The attempt to storm Avdiivka, a city that stands in the way of Moscow’s ambition of securing control of the entire Donetsk region, is Moscow’s most significant offensive operation in Ukraine since the start of the year, the U.K. defense ministry said Tuesday, Oct. 17, 2023. (AP Photo/Libkos) Ukrainian students, who lost relatives due to the Russia-Ukrainian war set flags in their memory on the memorial of fallen Ukrainian soldiers, while attending the reconstruction of a student-led protest campaign “Revolution on Granite” on Independence square in Kyiv, Ukraine, Tuesday, Oct. 17, 2023. (AP Photo/Alex Babenko)     KYIV, Ukraine (AP) — Ukraine on Tuesday claimed to have carried out one of the most destructive attacks on Russian air assets since the beginning ofthe war, with Ukrainian President Volodymyr Zelenskyy saying the assault used longer-range ballistic missiles donated by the United States. Zelenskyy’s announcement came hours after a U.S. official revealed that the longer-range ballistic missilessought for months by Kyivand promised by President Joe Biden had been delivered quietly and are in battlefield use. Ukraine’s Special Operations Forces claimed it destroyed nine Russian helicopters at two airfields in Russia-occupied regions in a nighttime attack on targets in eastern and southern Ukraine. It also hit military equipment, an air-defense system, ammunition warehouses and runways, a statement said. Dozens of Russian military personnel were injured in the attack codenamed Operation Dragonfly, it said. Several U.S. officials said that Washington provided Ukraine with a small number of the Army Tactical Missile System, known as ATACMS, making good on a promise made by Biden last month. Zelenskyy offered “special thanks” to the United States for sending the ATACMS. “Our agreements with President Biden are being implemented,” Zelenskyy said in his usual evening address to the nation, saying the ATACMS “have proven themselves.” The weapons development piles pressure on the Kremlin as both sides look for battlefield advantages ahead of winter and what is shaping up as a protracted war of attrition.  While some versions of the missiles can go as far as about 180 miles (about 300 kilometers), the ones sent to Ukraine have a shorter range and carry cluster munitions, which, when fired, open in the air, releasing hundreds of bomblets rather than a single warhead. According to a U.S. official, the ones delivered to Ukraine have a maximum range of a bit more than 100 miles (roughly 160 kilometers). The Ukrainian statement didn’t say how the targets were hit. Russian authorities didn’t comment on the report. It wasn’t immediately possible to verify the two sides’ battlefield claims. The airfields, in the Luhansk and Berdyansk regions, are located behind the front line. The Russian military apparently thought that they were at a safe distance from Ukrainian attacks. Meanwhile, Russia is throwing more units into its effort to take a key eastern Ukraine city, Western analysts say, after apparent setbacks that have slowed its dayslong onslaught. The attempt to storm Avdiivka, a heavily defended city that stands in the way of Moscow’s ambition of securing control of the entireDonetsk region, is Moscow’s most significant offensive operation in Ukraine since the start of the year, the U.K. defense ministry said Tuesday. The Kremlin’s push to claim Avdiivka comes after months of fending offUkraine’s counteroffensive, which Kyiv launched some 16 months afterRussia’s full-scale invasion. The Russian forces deployed to Avdiivka are likelymaking slow progressand sustaining high casualties in what is proving a costly effort, the U.K. defense ministry said on X, the social media platform formerly known as Twitter. The pace of Russia’s attack on the heavily fortified target has reportedly slowed in recent days since its launch last week, a Washington-based think tank said. Russian officials made no immediate comment on developments around Avdiivka. Citing the Ukrainian General Staff, the Institute for the Study of War said Ukrainian forces pushed back 22 Russian attacks on Monday, down from 30 reported assaults the previous day. Kyiv officials said Russia mounted up to 60 attacks per day in the middle of last week. The Ukrainian defense ministry said Tuesday that Russia is nevertheless still attempting to encircle the city, with 10 attacks over the previous 24 hours. The U.K. defense ministry said Russia’s effort to overrun Avdiivka “looks increasingly unlikely in the short term.” ___ Lolita C. Baldor in Washington contributed to this report. ___ Follow AP’s coverage of the war in Ukraine athttps://apnews.com/hub/russia-ukraine      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_10",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/russia-ukraine-war-kursk-d297a59fb9eb7db08bd742e1dd0aa753",
    "title": "Bloodied Ukrainian troops risk losing more hard-won land in Kursk to Russia",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. During a funeral ceremony in Irpin, the Kyiv region of Ukraine, on Nov. 21, serviceman Roman bids farewell to a comrade from the 47th Brigade -- Serhii Solovyov -- who was killed during fighting with Russian Forces in Kursk on November 12, 2024. (AP Photo/Evgeniy Maloletka, File) A Ukrainian soldier walks past a city hall in Sudzha, in the Kursk region of Russia, on Aug. 16, 2024. This image was approved by the Ukrainian Defense Ministry before publication. (AP Photo, File) In this image from video released by the Russian Defense Ministry on Oct. 17, 2024, a Russian soldier fires a gun toward a Ukrainian position in the Russian-Ukrainian border area in the Kursk region, Russia. (Russian Defense Ministry Press Service photo via AP, File) In this image from video released by the Russian Defense Ministry on Nov. 7, 2024, Russian Army soldiers fight with Ukrainian Armed forces in the Sudzhansky district of the Kursk region of Russia. (Russian Defense Ministry Press Service via AP, File) Residents take shelter in a basement in Sudzha, Russia, on Aug. 16, 2024. This image was approved by the Ukrainian Defense Ministry before publication. (AP Photo, File) A damaged monument to Soviet founder Vladimir Lenin stands in a square in Sudzha, the Kursk region, Russia, on Aug. 16, 2024, in an image approved by the Ukrainian Defense Ministry before publication. (AP Photo, File) A destroyed Russian tank sits on a roadside near the town of Sudzha, Russia, in the Kursk region, on Aug. 16, 2024, in an image approved by the Ukrainian Defense Ministry before publication. (AP Photo, File) Residents sit near a shelter in Sudzha, Russia, on Aug. 16, 2024, near a sign that reads, “Civilians in a basement. No military,” in an image approved by the Ukrainian Defense Ministry before publication. (AP Photo, File) Fellow soldiers carry Petro Velykiy’s coffin during a funeral, Nov. 27, 2024, at the theater in Chernyhiv, Ukraine, for the 48-year-old actor who was killed in a battle with Russian troops in the Kursk region. (AP Photo/Dan Bashakov, File)                   KYIV, Ukraine (AP) — Five months after theirshock offensive into Russia, Ukrainian troops are bloodied and demoralized by the rising risk of defeat in Kursk, a region some want to hold at all costs while others question the value of having gone in at all. A Ukrainian soldier walks past a city hall in Sudzha, in the Kursk region of Russia, on Aug. 16, 2024. This image was approved by the Ukrainian Defense Ministry before publication. (AP Photo, File)  Battles are so intense that some Ukrainian commanders can’t evacuate the dead. Communication lags and poorly timed tactics have cost lives, and troops have little way to counterattack, seven front-line soldiers and commanders told The Associated Press on condition of anonymity so they could discuss sensitive operations. Since being caught unaware by the lightning Ukrainian incursion,Russia has amassedmore than 50,000 troops in the region, including some from its allyNorth Korea. Precise numbers are hard to obtain, but Moscow’s counterattack has killed and wounded thousands and the overstretched Ukrainians have lost more than 40% of the 984 square kilometers (380 square miles) of Kursk they seized in August. In this image from video released by the Russian Defense Ministry on Oct. 17, 2024, a Russian soldier fires a gun toward a Ukrainian position in the Russian-Ukrainian border area in the Kursk region, Russia. (Russian Defense Ministry Press Service photo via AP, File)  Its full-scale invasion three years ago left Russia holding a fifth of Ukraine, andUkrainian President Volodymyr Zelenskyyhas hinted that he hopes controlling Kursk will help force Moscow to negotiate an end to the war. But five Ukrainian and Western officials in Kyiv who spoke on condition of anonymity to freely discuss sensitive military matters said they fear gambling on Kursk will weaken the whole 1000-kilometer (621-mile) front line, and Ukraine is losing precious ground in the east. “We have, as they say, hit a hornet’s nest. We have stirred up another hot spot,” said Stepan Lutsiv, a major in the 95th Airborne Assault Brigade.  Army chief Oleksandr Syrskyi has said that Ukraine launched the operation because officials thought Russia was about to launch a new attack on northeast Ukraine. It began on Aug. 5 with an order to leave Ukraine’s Sumy region for what they thought would be a nine-day raid to stun the enemy. It became an occupation that Ukrainians welcomed as their smaller country gained leverage and embarrassed Russian President Vladimir Putin. Gathering his men, one company commander told them: “We’re making history; the whole world will know about us because this hasn’t been done since World War II. Privately, he was less certain. “It seemed crazy,” he said. “I didn’t understand why.” Shocked by the success achieved largely because the Russians were caught by surprise, the Ukrainians were ordered to advance beyond the original mission to the town of Korenevo, 25 kilometers (16 miles) into Russia. That was one of the first places where Russian troops counterattacked. Residents sit near a shelter in Sudzha, Russia, on Aug. 16, 2024, near a sign that reads, “Civilians in a basement. No military,” in an image approved by the Ukrainian Defense Ministry before publication. (AP Photo, File)  By early November the Russians began regaining territory rapidly. Once in awe of what they accomplished, troops’ opinions are now shifting as they come to terms with losses. The company commander said half of his troops were dead or wounded. Some front-line commanders said conditions are tough, morale is low and troops are questioning command decisions, even the very purpose of occupying Kursk. Fellow soldiers carry Petro Velykiy’s coffin during a funeral, Nov. 27, 2024, at the theater in Chernyhiv, Ukraine, for the 48-year-old actor who was killed in a battle with Russian troops in the Kursk region. (AP Photo/Dan Bashakov, File)  Another commander said that some orders his men have received don’t reflect reality because of delays in communication. Delays occur especially when territory is lost to Russian troops, he said. “They don’t understand where our side is, where the enemy is, what’s under our control, and what isn’t,” he said. “They don’t understand the operational situation, we so act at our own discretion.” One platoon commander said higher-ups have repeatedly turned down his requests to change his unit’s defensive position because he knows his men can’t hold the line. “Those people who stand until the end are ending up MIA,” he said. He said he also knows of at least 20 Ukrainian soldiers whose bodies had been abandoned over the last four months because the battles were too intense to evacuate them without more casualties. Ukrainian soldiers said they were not prepared for the aggressive Russian response in Kursk, and cannot counterattack or pull back. “There’s no other option. We’ll fight here because if we just pull back to our borders, they won’t stop; they’ll keep advancing,” said one drone unit commander. Ukraine’s General Staff told The Associated Press in a written response to questions that Ukrainian combat units are inflicting losses to Russian personnel and military equipment on a daily basis, and are provided with “everything necessary” to carry out combat duties. “Troops are managed in accordance to situational awareness and operational information, taking into the account the operational situation in areas where tasks are performed,” the response said. American longer-range weaponshave slowed the Russian advance andNorth Korean soldierswho joined the fighting last month are easy targets for drones and artillery because they lack combat discipline and often move in large groups in the open, Ukrainian troops said. On Monday, Zelenskyy said 3,000 North Korean soldiers had been killed and wounded. But they appear to be learning from their mistakes, soldiers added, by becoming more adept at camouflaging near forested lines. One clash took place last week near Vorontsovo tract, a forested area between the settlements of Kremenne and Vorontsovo. Until last week, the area was under Ukraine’s control. This week part of it has been lost to Russian forces and Ukrainian troops fear they will reach a crucial logistics route. Eyeing frontline losses in the eastern region known as the Donbas — where Russia is closing on a crucial supply hub — some soldiers are more vocal about whether Kursk has been worth it. “All the military can think about now is that Donbas has simply been sold,” the platoon commander said. “At what price?”      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_11",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/russia-putin-war-ukraine-north-korea-navalny-110be178bbeb8ca4c468969c0de935ac",
    "title": "2024 was a year of triumphs and setbacks for Russian leader Vladimir Putin. Here’s how it unfolded",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Russian President Vladimir Putin appears before the media after the summit of the Collective Security Treaty Organization in Astana, Kazakhstan, on Nov. 28, 2024. (Mikhail Tereshchenko, Sputnik, Kremlin Pool Photo via AP, File) People line up in Moscow on Jan. 20, 2024, to sign petitions to support the candidacy of Boris Nadezhdin, a liberal Russian politician seeking to run in the presidential election. (AP Photo, File) A woman lays flowers at the grave of Russian opposition leader Alexei Navalny at the Borisovskoye Cemetery in Moscow, on March 2, 2024. (AP Photo, File) In this photo released by the Russian Emergency Ministry Press Service, rescuers work at Crocus City Hall on the western edge of Moscow, on March 23, 2024, following an attack. (Russian Emergency Ministry Press Service via AP, File) Russian President Vladimir Putin and North Korean leader Kim Jong Un exchange documents during a signing ceremony of a new partnership in Pyongyang, North Korea, on June 19, 2024. (Kristina Kormilitsyna, Sputnik, Kremlin Pool Photo via AP, File) Wall Street Journal reporter Evan Gershkovich listens to the verdict against him in a glass cage in a courtroom in Yekaterinburg, Russia, on July 19, 2024. (AP Photo/Dmitri Lovetsky, File) A Ukrainian soldier walks past a building in Sudzha, Kursk region, Russia, on Aug. 16, 2024. This image was approved by the Ukrainian Defense Ministry before publication. (AP Photo, File) Mongolian President Khurelsukh Ukhnaa, left, walks with Russian President Vladimir Putin during a welcome ceremony in Sukhbaatar Square in Ulaanbaatar, Mongolia, on Sept. 3, 2024. (Sofya Sandurskaya, Sputnik, Kremlin Pool Photo via AP, File) A TV screen at Seoul Railway Station in South Korea, on Oct. 21, 2024, shows an image of soldiers believed to be from North Korea standing in line to receive supplies from Russia. (AP Photo/Ahn Young-joon, File) Journalists at a center for forensic analysis in an undisclosed location in Ukraine on Nov. 24, 2024, film fragments of what authorities in Kyiv described as a Russian hypersonic missile that struck a factory in Dnipro, Ukraine. (AP Photo/Evgeniy Maloletka, File) People chant slogans and wave the new Syrian flag as they gather for Friday prayers at the Umayyad mosque in Damascus, Syria, on Dec. 13, 2024. (AP Photo/Leo Correa, File)                        In 2024, President Vladimir Putinfurther cemented his grip on powerand sought to counter Russia’s isolation from the West over the war in Ukraine. But he faced continuing challenges, with a deadly attack by gunmen in Moscow and an incursion by Kyiv’s troops on his territory. As Russia’snearly 3-year-old warin Ukraine enters a new, potentially pivotal phase amid a new U.S. administration and its uncertain support for Kyiv, here’s a look back at how the year unfolded for Putin: People line up in Moscow on Jan. 20, 2024, to sign petitions to support the candidacy of Boris Nadezhdin, a liberal Russian politician seeking to run in the presidential election. (AP Photo, File)    Putin ran for a fifth term in office with his top opponents either jailed or exiled abroad. But in a rare show of defiance, thousands of Russians queued in the January cold to sign petitions for an unlikely challenger.Boris Nadezhdin,a 60-year-old legislator and war critic, got the 100,000 signatures needed to put him on the ballot, but election authorities eventually barred him from running. Still, the support he received reflected anti-war sentiment and public longing for political competition in an embarrassment for Putin.  A woman lays flowers at the grave of Russian opposition leader Alexei Navalny at the Borisovskoye Cemetery in Moscow, on March 2, 2024. (AP Photo, File)    On Feb. 16, Putin’s longtime foeAlexei Navalnydied in an arctic prison colony while serving a 19-year sentence on charges widely seen as politically motivated. The news of his death at age 47 shocked the world and robbed the opposition of its most charismatic leader. No exact cause of death was given, and his family and allies blamed the Kremlin, which denied involvement. Tens of thousands of mournersattended his Moscow funeraltwo weeks later in a show of defiance. In this photo released by the Russian Emergency Ministry Press Service, rescuers work at Crocus City Hall on the western edge of Moscow, on March 23, 2024, following an attack. (Russian Emergency Ministry Press Service via AP, File)   On March 17, Putin secured his expected election triumph, which willkeep him in officeuntil 2030, following the harshest crackdown on dissent since Soviet times. Five days later,gunmen stormed a concert hallon Moscow’s outskirts, killing over 140 people and setting the venue ablaze. An affiliate of the Islamic State group claimed responsibility, although the Kremlin, without evidence, tried to blame Ukraine for the deadliest attack on Russian soil in almost two decades.The assault stunned the capitaland rekindled memories of other attacks in the early years of Putin’s presidency.   Russian President Vladimir Putin and North Korean leader Kim Jong Un exchange documents during a signing ceremony of a new partnership in Pyongyang, North Korea, on June 19, 2024. (Kristina Kormilitsyna, Sputnik, Kremlin Pool Photo via AP, File)   Putin made a two-day visit toNorth Koreain June — his first in 24 years — as the countries deepened their ties in the face of intensifying confrontations with Washington. Thepact signedby Putin and North Korean leader Kim Jong Un envisions mutual military assistance if either country is attacked. Thenew agreementmarked their strongest link since the end of the Cold War, adding to concerns in Washington and Seoul. Wall Street Journal reporter Evan Gershkovich listens to the verdict against him in a glass cage in a courtroom in Yekaterinburg, Russia, on July 19, 2024. (AP Photo/Dmitri Lovetsky, File)   Wall Street Journal reporterEvan Gershkovich, arrested in March 2023 and accused of espionage, was convicted and sentenced to 16 years in prison in a swift trial. His employers and the U.S. government denounced the process as a sham and rejected the charges as fabricated. Without presenting evidence, authorities claimed he was gathering secret information for the U.S. Gershkovich, theAmerican-born son of Soviet immigrants, was the first Western reporter arrested on espionage charges in post-Soviet Russia, in a chilling signal to international journalists.  A Ukrainian soldier walks past a building in Sudzha, Kursk region, Russia, on Aug. 16, 2024. This image was approved by the Ukrainian Defense Ministry before publication. (AP Photo, File)   On Aug. 1, Washington and Moscow completed the biggest East-Westprisoner swapin post-Soviet history. Those released includedGershkovichand fellow AmericanPaul Whelan, along with prominentRussian dissidents like Vladimir Kara-Murza and Ilya Yashin. The multinational deal freed two dozen people — includingVadim Krasikov, serving a life sentence in Germany for killing a former Chechen militant in Berlin. Also in August,Ukraine launched a surprise incursioninto Russia’s Kursk region in the largest cross-border raid by Kyiv’s forces. It exposed Russia’s vulnerabilities and dealt an embarrassing blow to the Kremlin, with tens of thousands of civilians fleeing the region. With the bulk of the Russian army engaged in eastern Ukraine, few troops were left to protect the Kursk region. Russia forces have since regained control over part of the territory but have so far failed to completely dislodge Kyiv’s troops. Mongolian President Khurelsukh Ukhnaa, left, walks with Russian President Vladimir Putin during a welcome ceremony in Sukhbaatar Square in Ulaanbaatar, Mongolia, on Sept. 3, 2024. (Sofya Sandurskaya, Sputnik, Kremlin Pool Photo via AP, File)   Putintraveled to regional ally Mongoliain September in a move widely seen as an attempt to counter Western efforts to isolate him over the Ukraine war. Mongolia was among the countries that ratified a treaty establishing the International Criminal Court, which in 2023 issued an arrest warrant for Putin for alleged war crimes in Ukraine. Mongolia ignored calls to arrest the Russian leader and gave him a red-carpet welcome, with both countries signing deals on energy supplies and power plant upgrades.  A TV screen at Seoul Railway Station in South Korea, on Oct. 21, 2024, shows an image of soldiers believed to be from North Korea standing in line to receive supplies from Russia. (AP Photo/Ahn Young-joon, File)   In October, the Pentagon announced North Korea sent about 10,000 troops to Russia to join the fighting against Ukraine — a move Western leaders said willintensify the warandjolt relations in Asia.Moscow and Pyongyang have remained tight-lipped about the claims of deployment. Putin also hosted a summitof the BRICS bloc of nations, attended by leaders or representatives of 36 countries, in what many saw as an effort to highlight the failure of U.S.-led efforts to isolate Russia.  Journalists at a center for forensic analysis in an undisclosed location in Ukraine on Nov. 24, 2024, film fragments of what authorities in Kyiv described as a Russian hypersonic missile that struck a factory in Dnipro, Ukraine. (AP Photo/Evgeniy Maloletka, File)   Former President Donald Trump won a new term in the White House in November, raising concerns that his administration wouldcut military support for Ukraineand force it to negotiate with Moscow. Current President Joe Bidenallowed Kyiv to use U.S.-supplied longer-range weaponsfor deeper strikes on Russian soil. Russia responded by firing a newhypersonic intermediate-range ballistic missile— called the Oreshnik — at a city in central Ukraine. Putin boasted the missile can’t be intercepted by air defenses. He warned that Moscow could use it for more strikes on Ukraine and also potentially to hit military facilities of NATO countries giving military support to Ukraine. People chant slogans and wave the new Syrian flag as they gather for Friday prayers at the Umayyad mosque in Damascus, Syria, on Dec. 13, 2024. (AP Photo/Leo Correa, File)    The government of Syrian leader Bashar Assad crumbled after a lightning offensive by rebels.Putin granted asylumto Moscow’s longtime ally Assad and his family, but the Kremlin’s failure to prevent his downfall nine years after it intervened militarily to prop up his ruleexposed the limits of Russia’s powerand dented its international clout at a pivotal stage of its war in Ukraine. Then, an embarrassing attack again brought the war to the streets of Moscow.Lt. Gen Igor Kirillov,the chief of Russia’s Radiation, Biological and Chemical Protection Forces, was killed alongside an aide by a bomb planted outside his apartment building. Putin described Kirillov’s killing as a “major blunder” by security agencies. On the final weekend of the year,Putin apologizedfor what he called a “tragic incident” in Russian airspace involving the Dec. 25 crash of an Azerbaijani jetliner that killed 38 people in neighboring Kazakhstan. His statement came amid mounting allegations the plane was shot down by Russian air defenses trying to stop a Ukrainian drone attack near Grozny in the Russian republic of Chechnya. While Russian officials acknowledged that air defense systems were at work, Putin’s apology to Azerbaijan’s leader stopped short of saying Moscow took responsibility.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_12",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/deserters-awol-ukraine-russia-war-def676562552d42bc5d593363c9e5ea0",
    "title": "Desertion threatens to starve Ukraine’s forces at a crucial time in its war with Russia",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. FILE - Ukrainian soldiers carry shells to fire at Russian positions on the front line, near the city of Bakhmut, in Ukraine’s Donetsk region, on March 25, 2024. (AP Photo/Efrem Lukatsky, File) FILE - A shell-shocked Ukrainian soldier of the Azov brigade sits at the stabilization point after arriving from the front line, near Toretsk, Donetsk region, Ukraine, on Sept. 24, 2024. (AP Photo/Evgeniy Maloletka, File) FILE - Ukraine’s Khartia brigade officer, who goes by callsign Kit, left, sits while his soldiers pilot drones in a shelter on the frontline near Kharkiv, Ukraine, on Nov. 7, 2024. (AP Photo/Efrem Lukatsky, File) FILE - Military medics give first aid to wounded Ukrainian soldiers near Bakhmut, Ukraine, on Jan. 25, 2024. (AP Photo/Efrem Lukatsky, File) FILE - In this photo taken on July 9, 2024 and provided by Ukraine’s 24th Mechanised Brigade press service, a military medics give first aid to a wounded Ukrainian soldier at a medical stabilisation point near Chasiv Yar, Donetsk region, Ukraine, on July 9, 2024, (Oleg Petrasiuk/Ukraine’s 24th Mechanised Brigade via AP, File) FILE - A man rides a bicycle past the tombs of Ukrainian soldiers killed during the war, at Lisove cemetery in Kyiv, Ukraine, on April 23, 2024. (AP Photo/Francisco Seco, File) FILE - Newly recruited soldiers toss their hats as they celebrate the end of their training at a military base close to Kyiv, Ukraine, on Sept. 25, 2023. (AP Photo/Efrem Lukatsky, File) FILE - Volodymyr, a 51 year old soldier of Ukraine’s 57th motorised brigade smokes near self-propelled artillery howitzer “Gvozdika” on the front line in the Kharkiv region, Ukraine, on Nov. 7, 2024. (AP Photo/Efrem Lukatsky, File) FILE - In this photo provided by Ukraine’s 24th Mechanised Brigade press service, servicemen of the 24th Mechanised Brigade install anti-tank landmines and non explosive obstacles along the front line near Chasiv Yar town in Donetsk region, Ukraine, on Oct. 30, 2024. (Oleg Petrasiuk/Ukrainian 24th Mechanised Brigade via AP, File)                   KYIV, Ukraine (AP) — Desertion is starving the Ukrainian army of desperately needed manpower and crippling its battle plans at acrucial time in its warwith Russia, which could put Kyiv at a clear disadvantage in future ceasefire talks. Facing every imaginable shortage, tens of thousands of Ukrainian troops, tired and bereft, have walked away from combat and front-line positions to slide into anonymity, according to soldiers, lawyers and Ukrainian officials. Entire units have abandoned their posts, leaving defensive lines vulnerable and accelerating territorial losses, according to military commanders and soldiers. Some take medical leave and never return, haunted by the traumas of war and demoralized bybleak prospects for victory. Others clash with commanders and refuse to carry out orders, sometimes in the middle of firefights. FILE - A shell-shocked Ukrainian soldier of the Azov brigade sits at the stabilization point after arriving from the front line, near Toretsk, Donetsk region, Ukraine, on Sept. 24, 2024. (AP Photo/Evgeniy Maloletka, File)  “This problem is critical,” said Oleksandr Kovalenko, a Kyiv-based military analyst. “This is the third year of war, and this problem will only grow.” AlthoughMoscow has also been dealing with desertions, Ukrainians going AWOL have laid bare deeply rooted problems bedeviling their military andhow Kyiv is managing the war, from the flawed mobilization drive to the overstretching and hollowing out of front-line units. It comes as the U.S. urgesUkraine to draft more troops,and allow for the conscription of those as young as 18.  The Associated Press spoke to two deserters, three lawyers, and a dozen Ukrainian officials and military commanders. Officials and commanders spoke on condition of anonymity to divulge classified information, while one deserter did so because he feared prosecution. FILE - Ukraine’s Khartia brigade officer, who goes by callsign Kit, left, sits while his soldiers pilot drones in a shelter on the frontline near Kharkiv, Ukraine, on Nov. 7, 2024. (AP Photo/Efrem Lukatsky, File)  “It is clear that now, frankly speaking, we have already squeezed the maximum out of our people,” said an officer with the 72nd Brigade, who noted that desertion was one of the main reasons Ukrainelost the town of Vuhledarin October. More than 100,000 soldiers have been charged under Ukraine’s desertion lawssince Russia invadedin February 2022, according to the country’s General Prosecutor’s Office. Nearly half have gone AWOL in the last year alone, after Kyiv launched anaggressive and controversial mobilization drivethat government officials and military commanders concede has largely failed. It’s a staggeringly high number by any measure, as there were an estimated 300,000 Ukrainian soldiers engaged in combat before the mobilization drive began. And the actual number of deserters may be much higher. One lawmaker with knowledge of military matters estimated it could be as high as 200,000. Many deserters don’t return after being granted medical leave. Bone-tired by the constancy of war, they arepsychologically and emotionally scarred. They feel guilt about being unable to summon the will to fight, anger over how the war effort is being led, and frustration that it seems unwinnable. “Being quiet about a huge problem only harms our country,” said Serhii Hnezdilov, one of few soldiers to speak publicly about his choice to desert. He was charged shortly after the AP interviewed him in September. Another deserter said he initially left his infantry unit with permission because he needed surgery. By the time his leave was up, he couldn’t bring himself to return. He still has nightmares about the comrades he saw get killed. “The best way to explain it is imagining you aresitting under incoming fireand from their (Russian) side, it’s 50 shells coming toward you, while from our side, it’s just one. Then you see how your friends are getting torn to pieces, and you realize that any second, it can happen to you,” he said. FILE - A man rides a bicycle past the tombs of Ukrainian soldiers killed during the war, at Lisove cemetery in Kyiv, Ukraine, on April 23, 2024. (AP Photo/Francisco Seco, File)  “Meanwhile guys (Ukrainian soldiers) 10 kilometers (6 miles) away order you on the radio: ‘Go on, brace yourselves. Everything will be fine,’” he said. Hnezdilov also left to seek medical help. Before undergoing surgery, he announced he was deserting. He said after five years of military service, he saw no hope of ever being demobilized, despite earlier promises by the country’s leadership. “If there’s no end term (to military service), it turns into a prison – it becomes psychologically hard to find reasons to defend this country,” Hnezdilov said. Desertion has turned battle plans into sand that slips through military commanders’ fingertips. The AP learned of cases in which defensive lines were severely compromised because entire units defied orders and abandoned their positions. “Because of a lack of political will and poor management of troops, especially in the infantry, we certainly are not moving in a direction to properly defend the territories that we control now,” Hnezdilov said. Ukraine’s military recorded a deficit of 4,000 troops on the front in September owing largely to deaths, injuries and desertions, according to a lawmaker. Most deserters were among recent recruits. The head of one brigade’s legal service who is in charge of processing desertion cases and forwarding them to law enforcement said he’s had many of them. FILE - Newly recruited soldiers toss their hats as they celebrate the end of their training at a military base close to Kyiv, Ukraine, on Sept. 25, 2023. (AP Photo/Efrem Lukatsky, File)  “The main thing is that they leave combat positions during hostilities and their comrades die because of it. We had several situations when units fled, small or large. They exposed their flanks, and the enemy came to these flanks and killed their brothers in arms, because those who stood on the positions did not know that there was no one else around,” the official said. That is how Vuhledar, a hilltop town that Ukraine defended for two years, was lost in a matter of weeks in October, said the 72nd Brigade officer, who was among the very last to withdraw. The 72nd was already stretched thin in the weeks before Vuhledar fell. Only one line battalion and two rifle battalions held the town near the end, and military leaders even began pulling units from them to support the flanks, the officer said. There should have been 120 men in each of the battalion’s companies, but some companies’ ranks dropped to only 10 due to deaths, injuries and desertions, he said. About 20% of the soldiers missing from those companies had gone AWOL. “The percentage has grown exponentially every month,” he added. Reinforcements were sent once Russia wised up to Ukraine’s weakened position and attacked. But then the reinforcements also left, the officer said. Because of this, when one of the 72nd Brigade battalions withdrew, its members were gunned down because they didn’t know no one was covering them, he said. Still, the officer harbors no ill will toward deserters. “At this stage, I do not condemn any of the soldiers from my battalion and others. … Because everyone is just really tired,” he said. FILE - Volodymyr, a 51 year old soldier of Ukraine’s 57th motorised brigade smokes near self-propelled artillery howitzer “Gvozdika” on the front line in the Kharkiv region, Ukraine, on Nov. 7, 2024. (AP Photo/Efrem Lukatsky, File)  Prosecutors and the military would rather not press charges against AWOL soldiers and do so only if they fail to persuade them to return, according to three military officers and a spokesperson for Ukraine’s State Investigative Bureau. Some deserters return, only to leave again. Ukraine’s General Staff said soldiers are given psychological support, but it didn’t respond to emailed questions about the toll desertions are having on the battlefield. Once soldiers are charged, defending them is tricky, said two lawyers who take such cases. They focus on their clients’ psychological state when they left. “People cannot psychologically cope with the situation they are in, and they are not provided with psychological help,” said attorney Tetyana Ivanova. Soldiers acquitted of desertion due to psychological reasons set a dangerous precedent because “then almost everyone is justified (to leave), because there are almost no healthy people left (in the infantry),” she said. Soldiers considering deserting have sought her advice. Several were being sent to fight near Vuhledar. “They would not have taken the territory, they would not have conquered anything, but no one would have returned,” she said. FILE - In this photo provided by Ukraine’s 24th Mechanised Brigade press service, servicemen of the 24th Mechanised Brigade install anti-tank landmines and non explosive obstacles along the front line near Chasiv Yar town in Donetsk region, Ukraine, on Oct. 30, 2024. (Oleg Petrasiuk/Ukrainian 24th Mechanised Brigade via AP, File)       Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_13",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/russia-ukraine-kursk-putin-zelenskyy-8d7afde9eb8bce215007f3f8cc29fed6",
    "title": "Ukraine loses a ceasefire bargaining chip as its troops cede ground in Russia",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. In this image made from video released by the Russian Presidential Press Service, on Wednesday, March 12, 2025, Russian President Vladimir Putin, left, shakes hands with Russian Chief of General Staff Gen. Valery Gerasimov as he visits military headquarters in the Kursk region of Russia. (Russian Presidential Press Service via AP) In this image from video released by the Russian Defense Ministry on Nov. 7, 2024, Russian Army soldiers fight with Ukrainian Armed forces in the Sudzhansky district of the Kursk region of Russia. (Russian Defense Ministry Press Service via AP, File) Relatives and friends attend a funeral for Ukrainian soldier Petro Velykiy, who was killed in a battle with the Russian troops in Russia’s Kursk region, during a ceremony in Chernyhiv, Ukraine, Nov. 27, 2024. (AP Photo/Dan Bashakov, File) Ukrainian President Volodymyr Zelenskyy speaks during a briefing in Kyiv, Ukraine, Wednesday, March 12, 2025. (AP Photo/Efrem Lukatsky) A destroyed Russian tank sits on a roadside near the town of Sudzha, Russia, in the Kursk region, on Aug. 16, 2024. This image was approved by the Ukrainian Defense Ministry before publication. (AP Photo, File) Ukrainian Head of Presidential Office Andriy Yermak, right, and Ukrainian Minister of Defense Rustem Umerov speak to journalists in Jeddah, Saudi Arabia, Tuesday, March 11, 2025. (AP Photo/Baraa Anwer) In this image made from video released by the Russian Presidential Press Service, on Wednesday, March 12, 2025, Russian President Vladimir Putin speaks during a visit to military headquarters in the Kursk region of Russia. (Russian Presidential Press Service via AP) In this image from video released by the Russian Defense Ministry on Oct. 17, 2024, a Russian soldier fires a gun toward a Ukrainian position in the Russian-Ukrainian border area in the Kursk region, Russia. (Russian Defense Ministry Press Service photo via AP, File) A damaged monument to Soviet founder Vladimir Lenin stands in a central square in Sudzha, Russia, on Aug. 16, 2024. This image was approved by the Ukrainian Defense Ministry before publication. (AP Photo, File)                   KYIV, Ukraine (AP) — As momentum builds for aceasefire with Russia, Ukraine has all but lost a valuable bargaining chip. The Ukrainian armystunned Russiain August by attacking across the border and taking control of an estimated 1,300 square kilometers (500 square miles) of land. It was a much-needed morale boost for Ukraine — but more importantly, the country’s leaders believed the capture of Russian territory might help in any future peace negotiations with its enemy. Now, after months of intense pressure from Russian forces supported by troops from North Korea, Ukraine only holds about 30% of the Russian land it had seized and itsforces are in retreatafter a rapid near-defeat in the city of Sudzha. A damaged monument to Soviet founder Vladimir Lenin stands in a central square in Sudzha, Russia, on Aug. 16, 2024. This image was approved by the Ukrainian Defense Ministry before publication. (AP Photo, File)  The Ukrainian army on Thursday was trying to quickly build up defensive lines near the border to prevent Russia from turning its assault on Sudzha into a launchpad for advancing into northeastern Ukraine. Politically speaking, the retreat from large parts of Russia’s Kursk region could be a moment of reckoning forUkrainian President Volodymyr Zelenskyyand his military advisers. The invasion of Kursk was intended to redirect Russian forces from inside Ukraine — and the land gained was supposed to help Ukraine get back at least some of the 20% of its countrytaken by Russiasince its full-scale invasion in February 2022 But many soldiers and commanders have long questioned whether it was worth diluting their forces available to defend Ukraine — and those doubts only grew as the retreat from Kursk accelerated. Russian President Vladimir Putin said Thursday that he agrees in principle with a U.S. proposal for a 30-day ceasefire in Ukraine, but that the details still need to be worked out. Putin made the remarks just hours after the arrival of President Donald Trump’s envoy in Moscow. In this image made from video released by the Russian Presidential Press Service, on Wednesday, March 12, 2025, Russian President Vladimir Putin speaks during a visit to military headquarters in the Kursk region of Russia. (Russian Presidential Press Service via AP)    Combat is ongoing in the periphery of Sudzha as some Ukrainian soldiers try to fight their way out of Russia’s Kursk region back into the neighboring Sumy region of Ukraine. Ukrainian soldiers and commanders fear that Russia’s air superiority will enable them to wipe out the logistics routes vital to sustaining the soldiers who are still in Kursk. Russia has retaken control of about 70% of the territory Ukraine captured in the first weeks of its August incursion into Kursk, according to the Institute for the Study of War in Washington. In this image from video released by the Russian Defense Ministry on Nov. 7, 2024, Russian Army soldiers fight with Ukrainian Armed forces in the Sudzhansky district of the Kursk region of Russia. (Russian Defense Ministry Press Service via AP, File)  To flee the Kursk region, Ukrainian soldiers must walk dozens of kilometers to get back into Ukraine, while avoiding Russian forces. Some soldiers are angry that commanders did not order them to withdraw weeks ago, when it would have been safer to do so.   Some of Ukraine’s military leaders believe the daring push into Russian territory was essential to preventing further Russian advances along the country’s northeast. And, by degrading and redirecting Russian forces, it enabled Ukraine to push back the enemy in the east for the first time since a successful counteroffensive in 2022. Other military leaders say the Kursk offensive — whose political aim appears to have ultimately failed — cost Ukraine some of its best units and most precious weapons. Relatives and friends attend a funeral for Ukrainian soldier Petro Velykiy, who was killed in a battle with the Russian troops in Russia’s Kursk region, during a ceremony in Chernyhiv, Ukraine, Nov. 27, 2024. (AP Photo/Dan Bashakov, File)  After the fall of Sudzha — the largest settlement in Kursk they controlled, with a pre-war population of 5,000 — Ukrainian soldiers are pessimistic about their ability to hold what land they have left in the Russian region. And they recognize the political stakes of the defeat. “I understand that the (Russian) side is delaying (ceasefire negotiations) until they reclaim Kursk, and only then they will talk,” said one Ukrainian commander, who spoke on condition of anonymity. “But we already, to put it mildly, will not have any levers of influence to return any of our territory.” The Associated Press interviewed five soldiers and commanders, all of whom spoke anonymously, citing legal repercussions for talking about sensitive military matters.   Soldiers said their ability to hold Kursk began to deteriorate the moment soldiers from North Korea entered the battle late last year. As time went on, Pyongyang’s troops only became more effective, Ukrainian soldiers said. When one Ukrainian drone operator spotted some 40 North Korean soldiers near a tree line a few weeks ago, he said he was amazed by the physical fitness of North Korean troops. Some were capable of quickly running long distances carrying heavy ammunition, he said. “I’ve never seen anything like that before,” he said. Shortages of manpower, weaponry and ammunition also hampered Ukrainian soldiers, who said that they were outnumbered five to one, on average — and ten to one in some areas.   Over the past three months, the Russians gradually wore down the Ukrainians. Under heavy air assault from the Russians, Ukrainian troops often had to carry on their backs — for 20 or 30 kilometers (12 to 18 miles) reinforcements of ammunition, food and medical supplies. “By the time they reach the positions, they are completely exhausted,” a Ukrainian sergeant said. In this image from video released by the Russian Defense Ministry on Oct. 17, 2024, a Russian soldier fires a gun toward a Ukrainian position in the Russian-Ukrainian border area in the Kursk region, Russia. (Russian Defense Ministry Press Service photo via AP, File)  It is unclear how the recent U.S. pause in intelligence sharing influenced the battle for Kursk. Russian forces seized an estimated 166 square kilometers (64 square miles) in Kursk between March 7 and March 10, a period that the pause was in effect. Also last week, several hundred Russian special forces launched a surprise attack from behind Ukraine’s defensive lines after crawling 15 kilometers through a natural gas pipeline. And in another instance, Ukrainian soldiers that had been positioned to the northwest of Sudzha, in Lebedivka, simply abandoned their positions, according to a Ukrainian drone operator. “Everyone was leaving randomly,” he said, so he eventually left, too.  Top army chief Gen. Oleksandr Syrskyi said on Wednesday he had ordered soldiers to withdraw to more advantageous positions in Kursk, saying preserving the lives of soldiers was his priority. But some soldiers said it should have happened sooner. One Ukrainian soldier said he and his comrades defied their company commander’s orders, and made their own decision to retreat. “We’re sick and tired of sitting under fire all the time,” said the soldier. Because all the main roads are being monitored by Russian drones, he said soldiers are withdrawing in small groups along tree lines to avoid detection. “All the units that are left there, I don’t know how they (the command) are going to get them out, because all supply chains have been disrupted,” he said, referring to Sudzha and surrounding areas. “The guys who came out said there were a lot of our dead bodies and a lot of burnt equipment.” Russian forces are closing in on Ukrainian soldiers’ escape routes from the north and south of Sudzha. Ukraine still controls a sliver of territory in Kursk along the border with Sumy. Soldiers said attention has shifted to building up defenses along the border to prevent a Russian incursion into Ukrainian territory. Trenches are quickly being dug, but it is not clear if they will be enough. “It depends on the power we have,” one commander said. A destroyed Russian tank sits on a roadside near the town of Sudzha, Russia, in the Kursk region, on Aug. 16, 2024. This image was approved by the Ukrainian Defense Ministry before publication. (AP Photo, File)  ___ Associated Press journalist Hanna Arhirova contributed.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_14",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/ukraine-russia-war-f7f56e494df1dbbcdec1853001796c45",
    "title": "Russia grinds deeper into Ukraine after 1,000 days of grueling war",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. FILE - An explosion is seen in an apartment building after Russian’s army tank fires in Mariupol, Ukraine, Friday, March 11, 2022. (AP Photo/Evgeniy Maloletka, File) FILE - A Ukrainian serviceman holds a child crossing the Irpin river on an improvised path under a bridge, that was destroyed by Ukrainian troops designed to slow any Russian military advance, while assisting people fleeing the town of Irpin, Ukraine, on March 5, 2022. (AP Photo/Vadim Ghirda, File) FILE - Ukrainian emergency employees and volunteers carry an injured pregnant woman from a maternity hospital damaged by shelling in Mariupol, Ukraine, Wednesday, March 9, 2022. (AP Photo/Evgeniy Maloletka, File) FILE - Ukrainian President Volodymyr Zelenskyy speaks during an interview with The Associated Press in his office in Kyiv, Ukraine, Saturday, April 9, 2022. (AP Photo/Evgeniy Maloletka, File) FILE - A woman walks amid destroyed Russian tanks in Bucha, in the outskirts of Kyiv, Ukraine, Sunday, April 3, 2022. (AP Photo/Rodrigo Abd, File) FILE - Funeral workers carry a coffin with an unidentified civilian body, who died on the territory of the Bucha community during the Russian occupation period in February-March 2022, during a funeral in Bucha, near Kyiv, Ukraine, on Friday, Sept. 2, 2022. (AP Photo/Emilio Morenatti, File) FILE - A resident looks for belongings in an apartment building destroyed during fighting between Ukrainian and Russian forces in Borodyanka, Ukraine, Tuesday, April 5, 2022. (AP Photo/Vadim Ghirda, File) FILE - Destroyed houses are photographed in Irpin, on the outskirts of Kyiv, Ukraine, Saturday, April 30, 2022. (AP Photo/Emilio Morenatti, File) FILE - Ukrainian forces shoot toward Russian positions at the front line in Kharkiv region, Ukraine, on Tuesday, Aug. 2, 2022. (AP Photo/Evgeniy Maloletka, File) FILE - A destroyed Russian tank, covered in snow, stands in the yard of a private house in the town of Sviatohirsk, Ukraine, Sunday, Feb. 12, 2023. (AP Photo/Evgeniy Maloletka, File) FILE - US President Joe Biden, left, participates in a wreath laying ceremony with Ukrainian President Volodymyr Zelenskyy at the memorial wall outside of St. Michael’s Golden-Domed Cathedral during an unannounced visit, in Kyiv, Ukraine, Monday, Feb. 20, 2023. (AP Photo/Evan Vucci, File) FILE - A Ukrainian assault unit commander passes by a dead Russian soldier on the front line near Andriivka, Ukraine, Saturday, Sept. 16, 2023. (AP Photo/Alex Babenko, File) FILE - Smoke rises from a building in Bakhmut, the site of the heaviest battles with the Russian troops in the Donetsk region, Ukraine, Wednesday, April 26, 2023. (AP Photo/Libkos, File) FILE - A Ukrainian police officer takes cover in front of a burning building that was hit in a Russian airstrike in Avdiivka, Ukraine, Friday, March 17, 2023. (AP Photo/Evgeniy Maloletka, File) FILE - A Ukrainian soldier walks near Klishchyivka, Donetsk region, Ukraine, Monday, March 18, 2024. (Iryna Rybakova via AP, File) FILE - A boy holds on to the barrel of a tank, part of a display of destroyed Russian military equipment, in Kyiv, Ukraine, Sunday, March 31, 2024. (AP Photo/Vadim Ghirda, File) FILE - Rescuers, volunteers and medical workers clean up the rubble and search for victims after a Russian missile hit the country’s main children’s hospital Okhmadit, in Kyiv, Ukraine, Monday, July 8, 2024. (AP Photo/Efrem Lukatsky, File) FILE - Ukrainian soldiers fire toward Russian positions at the front line in Donetsk region, Ukraine, Monday, June 24, 2024. (AP Photo/Evgeniy Maloletka, File) FILE - NATO Secretary General Mark Rutte, left, and Ukrainian President Volodymyr Zelenskyy, speak to journalists during a news conference in Kyiv, Ukraine, on Oct. 3, 2024. (AP Photo/Evgeniy Maloletka, File) FILE - Smoke rises over the Kyiv skyline after a Russian attack, Monday, July 8, 2024. (AP Photo/ Evgeniy Maloletka, File) FILE - Former President Donald Trump meets with Ukraine’s President Volodymyr Zelenskyy at Trump Tower, Friday, Sept. 27, 2024, in New York. (AP Photo/Julia Demaree Nikhinson, File) FILE - A priest reads a prayer for a fallen Ukrainian solfer fIhor Kusochek during the funeral ceremony in Bobrovytsia, Chernihiv region, Ukraine, on Oct. 4, 2024. (AP Photo/Evgeniy Maloletka, File) FILE - Ukrainian servicemen prepare towarda Wong fire towards Russian positions at the frontline in Donetsk region, Ukraine, Wednesday, August 21, 2024. (AP Photo/Evgeniy Maloletka, File)                                               KYIV, Ukraine (AP) — When Russian tanks rolled into Ukraine inFebruary 2022, the conventional wisdom was that the capital, Kyiv, would soon fall and the rest of the country wouldn’t last long against a much larger enemy. Instead, it was that narrative thatquickly collapsed.The Ukrainian army proved it could slow the advance of Russia’s forces and, if not drive them out completely, then – with enough support from the West – at least forestall defeat. But nearly three years later, the outlook is again grim. Russia is expending huge amounts of weaponry and human life to make small-but-steady territorial gains to the nearly one-fifth of Ukraine it already controls. Ukraine, meanwhile, is struggling to minimize losses, maintain morale andconvince alliesthat, with more military aid, it can turn the tide.  FILE - Destroyed houses are photographed in Irpin, on the outskirts of Kyiv, Ukraine, Saturday, April 30, 2022. (AP Photo/Emilio Morenatti, File)  As this brutal war of attrition grinds toward its 1,000th day, neither side seems eager to negotiate. President-elect Donald Trump has saidhe could quickly end the war, though it is unclear how or in whose favor he might tip the scales. This backdrop appears to be driving Russia’s strategy in eastern Ukraine, according to Phillips O’Brien, a professor of strategic studies at the University of St. Andrews, Scotland. Trump could try to force an end to the war by halting the supply of weapons to Ukraine, he said. “If Trump cuts aid to Ukraine and a cease-fire leads to a frozen conflict, Russia wants to secure as much territory as it can now,” O’Brien said.  For Ukraine, the key to any cease-fire would be guarantees from the West that it won’t allow Russia to re-invade in the future. Otherwise, O’Brien said, “a cease-fire is a recipe for constant instability in Europe.”  In the war’s first year, Ukraine lost huge amounts of territory — but it alsoachieved notable victories. It resisted a much larger adversary with superior air power to survive as an independent country, and it reclaimed some land throughgutsy counteroffensives, giving the underdog — and its wealthy allies — the confidence to stay in the fight. In the second year, which was punctuated by Ukraine’s devastatingloss of Bakhmutand its failed counteroffensive, the armies essentially fought to a standstill along a 1,000 kilometer (620 mile) front line. Toward the end of that year, the U.S. Congress delayed the approval of a$61 billion packageof aid forweapons, and economic and humanitarian assistance. With Ukraine’s ammunition dwindling, its outlook deteriorated significantly as the war’s third year began. In February 2024, the town ofAvdiivka fellafter months of airstrikes by Russia, which used highly destructive Soviet-era bombs retrofitted with navigation systems. A Ukrainian assault unit commander passes by a dead Russian soldier on the front line near Andriivka, Ukraine, Saturday, Sept. 16, 2023. (AP Photo/Alex Babenko, File)  The fall of Avdiivka created a major breach in Ukraine’s defenses. When Russia later mounted an assault on thenortheastern city of Kharkiv,Ukrainian troops were stretched further. A bright spot for Ukraine came in August, when it launched a surprise incursion into Russia. It took — and still holds — hundreds of square kilometers inthe Kursk region.While this could be an important chip in any cease-fire negotiations, it hasn’t stopped Russian forces from taking more land in Ukraine’s east. “The Russians have paid a very high price to keep advancing, but they’re willing to pay that price in lives to gain a few more meters of territory each day,” said Justin Crump, head of the British strategic advisory firm Sibylline. Tens of thousands of soldiers from both countries have been killed since the start of the war in 2022, according to estimates, and the U.N. says at least 11,700 Ukrainiancivilians have been killed. While the amount of land Russia has gained in 2024 — about 2,455 square kilometers (948 square miles)— is equal to less than 1% of Ukraine’s pre-war territory, it is having a psychological impact. With Ukraine in retreat, “we’ve now returned to a period reminiscent of the (war’s) first months,” said Mykola Bielieskov, an analyst at CBA Initiatives Center in Kyiv. “This strengthens Russia’s position — not so much militarily, but in terms of morale.” FILE - Funeral workers carry a coffin with an unidentified civilian body, who died on the territory of the Bucha community during the Russian occupation period in February-March 2022, during a funeral in Bucha, near Kyiv, Ukraine, on Friday, Sept. 2, 2022. (AP Photo/Emilio Morenatti, File)    To keep its war machine going, Russia — like Ukraine — has turned to allies for help. Iran supplies Russia with drones andpossibly missiles,and North Korea has sent ammunition — and eventroops,who have been deployed to Russia’s Kursk region. Russian President Vladimir Putin claimed this year that 700,000 of his troops are fighting in Ukraine. Analysts say Putin would need a much larger force to accelerate Russia’s advance, but that he is unlikely to mobilize more troops because it could stoke internal discontent.  FILE - A Ukrainian police officer takes cover in front of a burning building that was hit in a Russian airstrike in Avdiivka, Ukraine, Friday, March 17, 2023. (AP Photo/Evgeniy Maloletka, File)  Ukraine’s foothold in Kursk is another complicating factor for Putin, and it could be used as a bargaining chip in any future cease-fire negotiations. Captain Yevhen Karas, a Ukrainian commander in Kursk, said the fighting inside Russia is highly dynamic, but he believes it will prove effective in diverting Russia’s attention and resources. “Even a creeping, retreating front exhausts the enemy significantly,” Karas said. Ukraine has asked the West forlonger range missilesand its blessing to fire at air bases deep inside Russia. But its allies have so far resisted, wary ofescalating tensionswith a nuclear-armed Russia.  FILE - A destroyed Russian tank, covered in snow, stands in the yard of a private house in the town of Sviatohirsk, Ukraine, Sunday, Feb. 12, 2023. (AP Photo/Evgeniy Maloletka, File)  The U.S. has provided more than $64 billion in military aid to Ukraine since the war began 1,000 days ago. Soldiers worry about what would happen without sustained American support. “Bravery, heroism, and spirit alone are not enough,” said a Ukrainian soldier in the eastern Donetsk region who spoke on condition of anonymity, in line with military rules. The soldier estimated that where he is stationed Russian infantry outnumber Ukrainian troops 10 to 1. As the war drags on and the death toll rises, it has become increasingly difficult for Ukrainian President Volodymyr Zelenskyy to keep replacing troops.    What direction the war takes next will depend in large part on how the incoming Trump administration plays its hand. Trump, who has touted his good relationship with President Vladimir Putin and called the Russian leader “pretty smart” for invading Ukraine, has repeatedly criticized American backing of Ukraine. During his only campaign debate with Vice President Kamala Harris, Trump twicerefused to directly answera question about whether he wanted Ukraine to win — raising concerns that Kyiv could be forced to accept unfavorable terms in any negotiations. Without security guarantees from the West, Ukraine could find itself vulnerable to future Russian aggression. Analysts say a cease-fire based on the current state of the battlefield would set a dangerous precedent, implying that Europe’s borders are up for grabs through military action — something that hasn’t happened since World War II. “This would also have a lot of traction in countries like China, India, and elsewhere,” said Richard Connolly, a Russia expert at the Royal United Services Institute in London. “They could present that as a strategic defeat not only for Ukraine, but also for the West.” As another winter of war approaches, Ukrainian soldiers say they remain resolute. “We are standing strong, giving it our all, and we won’t surrender,” said a battalion chief of staff in the southern region of Zaporizhzhia. “The most important thing now is not to lose more land.” FILE - Ukrainian emergency employees and volunteers carry an injured pregnant woman from a maternity hospital damaged by shelling in Mariupol, Ukraine, Wednesday, March 9, 2022. (AP Photo/Evgeniy Maloletka, File)  ___ Associated Press journalist Volodymyr Yurchuk contributed to this report.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_15",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/ukraine-zelenskyy-europe-victory-plan-summit-863bd5c70816449e3c92b7c1f767a2ff",
    "title": "Zelenskyy says 10,000 North Koreans could join Russian forces in Ukraine as he pushes ‘victory plan’",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Ukrainian President Volodymyr Zelenskyy on Wednesday presented part of Ukraine’s “Victory Plan” in the Verkhovna Rada, Ukraine’s Parliament. Major points of the plan include an invitation for Ukraine to join NATO and permission to use Western-supplied longer-range missiles to strike military targets deep inside Russian territory — steps that have been met with reluctance by Kyiv’s allies so far. Ukraine will be a member of NATO in the future, Secretary-General of NATO Mark Rutte said Thursday in Brussels, where he is chairing a meeting of NATO ministers of defense. “At the moment it seems that it will be Ukraine as number 33 but maybe somebody else pops in front of him,” Rutte said. Ukrainian President Volodymyr Zelenskyy said Thursday his country has intelligence information that 10,000 troops from North Korea are being prepared to join Russian forces fighting against his country. (AP video shot by: Ahmad Seir) Ukraine’s President Volodymyr Zelenskyy talks to journalists during a press conference at an EU summit in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Omar Havana) Ukraine’s President Volodymyr Zelenskyy talks to journalists during a press conference at an EU summit in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Geert Vanden Wijngaert) Ukraine’s President Volodymyr Zelenskyy, left, and European Council President Charles Michel arrive to an EU summit in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Geert Vanden Wijngaert) Ukraine’s President Volodymyr Zelenskyy, left, and European Council President Charles Michel talk to journalists as they arrive to an EU summit in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Geert Vanden Wijngaert) Ukraine’s President Volodymyr Zelenskyy, left, and European Council President Charles Michel arrive to an EU summit in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Geert Vanden Wijngaert) FILE - Ukrainian President Volodymyr Zelenskyy attends a joint press conference during the Crimea Platform summit in Kyiv, Ukraine, on Sept. 11, 2024. (AP Photo/Efrem Lukatsky, File) European Council President Charles Michel, second right, talks to Italy’s Prime Minister Giorgia Meloni, center, next to Ukraine’s President Volodymyr Zelenskyy, bottom left, as they arrive for a group photo during an EU summit in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Geert Vanden Wijngaert) NATO Secretary General Mark Rutte, right, and Ukraine’s President Volodymyr Zelenskyy participate in a media conference during a meeting of NATO defense ministers at NATO headquarters in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Virginia Mayo) NATO Secretary General Mark Rutte, right, and Ukraine’s President Volodymyr Zelenskyy participate in a media conference during a meeting of NATO defense ministers at NATO headquarters in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Virginia Mayo) Ukraine’s President Volodymyr Zelenskyy speaks during a media conference at NATO headquarters in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Virginia Mayo) Ukraine’s President Volodymyr Zelenskyy looks over his papers during the NATO-Ukraine Council working dinner at NATO Headquarters in Brussels, Thursday, Oct. 17, 2024. (Olivier Matthys, Pool Photo via AP) NATO Secretary General Mark Rutte, left, speaks with Ukraine’s President Volodymyr Zelenskyy during the NATO-Ukraine Council working dinner at NATO Headquarters in Brussels, Thursday, Oct. 17, 2024. (Olivier Matthys, Pool Photo via AP) NATO Secretary General Mark Rutte, left, speaks with Ukraine’s President Volodymyr Zelenskyy during the NATO-Ukraine Council working dinner at NATO Headquarters in Brussels, Thursday, Oct. 17, 2024. (Olivier Matthys, Pool Photo via AP) NATO Secretary General Mark Rutte, left, speaks with Ukraine’s President Volodymyr Zelenskyy during the NATO-Ukraine Council working dinner at NATO Headquarters in Brussels, Thursday, Oct. 17, 2024. (Olivier Matthys, Pool Photo via AP)                                BRUSSELS (AP) — Ukrainian President Volodymyr Zelenskyy said Thursday his government has intelligence information that 10,000 troops from North Korea are being prepared to join Russian forces fighting against his country, warning that a third nation wading into the hostilities would turn the conflict into a “world war.” Zelenskyy did not go into detail about the claim that came a day after U.S. Deputy Secretary of State Kurt Campbell said that Washington and its allies arealarmedby North Korea’smilitary support for Russia’s war in Ukrainebut couldn’t confirm Ukrainian claims that soldiers were sent to fight for Moscow. “From our intelligence we’ve got information that North Korea sent tactical personnel and officers to Ukraine,” Zelenskyy told reporters at NATO headquarters. “They are preparing on their land 10,000 soldiers, but they didn’t move them already to Ukraine or to Russia.” Earlier, he warned that any North Korean involvement would be “the first step to a world war.” NATO Secretary General Mark Rutte, left, speaks with Ukraine’s President Volodymyr Zelenskyy during the NATO-Ukraine Council working dinner at NATO Headquarters in Brussels, Thursday, Oct. 17, 2024. (Olivier Matthys, Pool Photo via AP)  NATO Secretary-General Mark Rutte said the allies “have no evidence that North Korean soldiers are involved in the fight. But we do know that North Korea is supporting Russia in many ways, weapons supplies, technological supplies, innovation, to support them in the war effort. And that is highly worrying.” The Ukrainian leader’s comments raised the stakes for his Western allies as he met in Brussels with European Union leaders and then NATO defense ministers to discuss his “victory plan” to end the country’s devastatingwar with Russia.  Major points of the plan include an invitation forUkraine to join NATOand permission to use Western-supplied longer-range missiles to strike military targets deep inside Russia, steps that have been met with reluctance by Kyiv’s allies so far. “Ukraine truly deserves to become the 33rd NATO member one day, and we must do everything to ensure this happens,” Zelenskyy said in an appeal at the alliance’s headquarters. “Ukrainians have shown that we can defend shared values, and we are standing against Russia, the biggest threat to Europe and global peace.” He told EU leaders that “we can end this war no later than next year” if his plan is followed. Zelenskyy told reporters that the plan aims “to strengthen Ukraine” and pave the way for a diplomatic solution to end the conflict on Europe’s eastern flank. “This plan doesn’t depend on Russian will, only on the will of our partners,” he said. Ukraine’s President Volodymyr Zelenskyy looks over his papers during the NATO-Ukraine Council working dinner at NATO Headquarters in Brussels, Thursday, Oct. 17, 2024. (Olivier Matthys, Pool Photo via AP)  In a statement after their talks with Zelenskyy, the EU leaders called for a “rapid stepping up of military support and acceleration in its delivery, in particular air defense systems, ammunition and missiles” to protect Ukraine’s population and energy infrastructure. “Russia must not prevail,” the statement said. The EU is a key supporter of Ukraine, acandidate memberof the 27-nation bloc, as it fights Russia’s invasion that began more than 2 1/2 years ago. Zelenskyy had outlined the five-point plan to Ukraine’s parliament on Wednesday without disclosing confidential elements that have been presented in private to key allies, including the United States. Hungarian Prime MinisterViktor Orbán, widely seen as having the warmest relations of any EU leader with Russian President Vladimir Putin, called Zelenskyy’s plan “more than frightening” in a Facebook post. He said he would urge major EU powers France and Germany to “begin negotiations with the Russians as soon as possible, in order to find a way out of this situation.” Rutte said Kyiv can rest “absolutely assured that 32 allies are united in making sure that collectively, we will do whatever is needed to make sure that Ukraine can prevail, that Putin will not get his way.” He reiterated that Ukraine’s place is among NATO’s ranks, but would not say when it might join. NATO Secretary General Mark Rutte, right, and Ukraine’s President Volodymyr Zelenskyy participate in a media conference during a meeting of NATO defense ministers at NATO headquarters in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Virginia Mayo)  Zelenskyy told EU leaders that his troops must keep battling Russian forces in Ukraine “while also bringing the war back into Russia so that Russians can feel what war is like and begin to hate Putin for it.” Zelenskyy said he needs to “move some partners forward” on the issue. “And I think only with the unity in EU we can move and can move not only EU leaders, we can move other leaders.” Thursday’s talks in Brussels come as Ukrainian troops are struggling to hold off better-equipped Russian forces,especially in the eastern Donetsk regionwhere they are gradually being pushed back. Kyiv is surviving with Western help, but Ukraine says it is coming too slowly. Lithuanian President Gitanas Nauseda criticized slow Western decision-making over Ukraine and said it “would be a great mistake to think that our hesitance is the best way to de-escalation.” Ukraine’s President Volodymyr Zelenskyy, left, and European Council President Charles Michel arrive to an EU summit in Brussels, Thursday, Oct. 17, 2024. (AP Photo/Geert Vanden Wijngaert)  At theirsummit in Washingtonin July, the 32 NATO members declared Ukraine on an “irreversible” path to membership. But for now, NATO is in a holding pattern. Its biggest and most powerful member, the United States, is facing apresidential election. European allies expect little movement on Ukraine until a new president takes office in January. Beyond that, the United States and European heavyweight Germany remain deeply concerned about being dragged into a wider war with nuclear-armed Russia, and they lead a group of countries that oppose allowing Ukraine to join NATO until the conflict ends. ___ Corder reported from The Hague, Netherlands. Associated Press reporter Geir Moulson in Berlin contributed to this report. ___ Find more AP coverage athttps://apnews.com/hub/russia-ukraine      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_16",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/north-korea-ukraine-war-russia-0f34fb82cfdd267652f8df8bc3c574ec",
    "title": "North Korean troops in Ukraine gain battlefield experience, cementing alliance with Russia",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Soldiers wearing face masks to help curb the spread of the coronavirus rally to welcome the 8th Congress of the Workers’ Party of Korea at Kim Il Sung Square in Pyongyang, North Korea, on Oct. 12, 2020. (AP Photo/Jon Chol Jin, File) In this image from video released by the Russian Defense Ministry on Oct. 17, 2024, a Russian soldier fires a gun toward a Ukrainian position in the Russian-Ukrainian border area in the Kursk region, Russia. (Russian Defense Ministry Press Service photo via AP, File) Russian President Vladimir Putin, right, and North Korean leader Kim Jong Un shake hands during their meeting at the Vostochny cosmodrome outside of Tsiolkovsky, in the far eastern Amur region, Russia on Sept. 13, 2023. (Vladimir Smirnov/Sputnik Kremlin Pool Photo via AP, File) A destroyed Russian tank sits on a roadside near the town of Sudzha, Russia, in the Kursk region, on Aug. 16, 2024, in an image approved by the Ukrainian Defense Ministry. (AP Photo, File) A TV screen at Seoul Railway Station in South Korea, on Oct. 21, 2024, shows an image of soldiers believed to be from North Korea standing in line to receive supplies from Russia. (AP Photo/Ahn Young-joon, File) In this photo taken from a video released by Russian Defense Ministry press service on Nov. 29, 2024, a Russian serviceman aims a D-30 howitzer towards Ukrainian positions in the border area of Kursk region, Russia. (Russian Defense Ministry Press Service via AP, File) Russian President Vladimir Putin, left, and North Korea’s leader Kim Jong Un smile together in Pyongyang, North Korea, on June 19, 2024. (Gavriil Grigorov, Sputnik, Kremlin Photo via AP, File) This photo provided by the North Korean government, shows a military parade to mark the 90th anniversary of North Korea’s army at the Kim Il Sung Square in Pyongyang, North Korea, on April 25, 2022. Independent journalists were not given access to cover the event depicted in this image distributed by the North Korean government, and the content cannot be independently verified. Korean language watermark on image reads: “KCNA” which is the abbreviation for Korean Central News Agency. (Korean Central News Agency/Korea News Service via AP, File) In this photo provided by the North Korean government, North Korean leader Kim Jong Un, center, meets soldiers who took part in a training in North Korea, on March 13, 2024. Independent journalists were not given access to cover the event depicted in this image distributed by the North Korean government. (Korean Central News Agency/Korea News Service via AP, File)                   KYIV, Ukraine (AP) — For weeks, Ukrainian troops braced for an unfamiliar enemy: North Korean soldiers sent tobolster Moscow’s forcesafter Ukraine launcheda lightning-fast incursionand seized territory in Russia’s Kursk region over the summer. Their arrival marked a new andalarming phase in the war.And while initially inexperienced on the battlefield, North Korean troops have adapted quickly — a development that could have far-reaching consequences as they gain combat knowledge in the war against Ukraine. Unlike the Russian troops Ukraine has been battling fornearly three years, Kyiv’s forces were uncertain about what to expect from this new adversary, drawn into the war after Moscow and Pyongyangsigned an agreementpledging military assistance using “all means” if either were attacked. One Ukrainian soldier who has witnessed North Koreans in battle described them as disciplined and highly methodical, saying they were more professional than their Russian counterparts. The soldier spoke to The Associated Press on condition of anonymity because he was not authorized to discuss the sensitive military issue. However, other soldiers, includingUkrainian special forces, have shared battlefield drone footage on the Telegram messaging app mocking their tactics as outdated. Nevertheless, there is consensus among Ukrainian soldiers, military intelligence and others monitoring developments on the ground: WhilePyongyang’s troops lacked battlefield experiencewhen they arrived, that has been changing quickly.   With1.2 million troops, North Korea’s military ranks among the largest standing armies globally. But its post-Korean War foreign engagements have been limited, leaving them inexperienced with modern warfare technologies like drones. “For the first time in decades, the North Korean army is gaining real military experience,” said Andrii Yusov, spokesperson for Ukraine’s military intelligence agency. “This is a global challenge — not just for Ukraine and Europe, but for the entire world.”    Despite Ukrainian, U.S. and South Korean assertions thatPyongyanghas sent 10,000-12,000 troops to fight alongside Russia in the Kursk border region, Moscow has never publicly acknowledged the North Korean forces. While reports of their presencefirst emerged in October, Ukrainian troops only confirmed engagementon the ground in December. Analysts say that without the influx of North Korean troops, Russia would have struggled to pursue its strategy of overwhelming Ukraine by throwing large numbers of soldiers intothe battle for Kursk. Russian President Vladimir Putin, left, and North Korea’s leader Kim Jong Un smile together in Pyongyang, North Korea, on June 19, 2024. (Gavriil Grigorov, Sputnik, Kremlin Photo via AP, File)  While Moscow’s counterattack in Kursk has inflicted thousands of Ukrainian casualties, Kyiv’s overstretched forces have managed to hold on to about half of the 984 square kilometers (380 square miles) seized in August, though the situation remains dynamic. Besides the symbolic impact of Ukraine’s success capturing Russian territory, control of Kursk could also be a bargaining chip in anyceasefire negotiations. According to Ukraine’s intelligence agency, the North Korean soldiers are operating alongside Russian units, with the latter providing reconnaissance and electronic warfare support. The North Koreans wear Russian military uniforms with fake military IDs in their pockets, according to a report by a Ukrainian military unit that has observed them on the battlefield, and they could easily be mistaken for Russian soldiers. The subterfuge means Moscow and “its representatives at the U.N. can deny the facts,” said Yusov, the Ukrainian military intelligence spokesperson. Among the things proving their presence is that they have been heard speaking Korean with North Korean accents in intercepted communications, Yusov said. A destroyed Russian tank sits on a roadside near the town of Sudzha, Russia, in the Kursk region, on Aug. 16, 2024, in an image approved by the Ukrainian Defense Ministry. (AP Photo, File)  He said the North Korean troops are using their own weapons and equipment and have learned to cope with theimprovised explosives-laden dronesthat have become emblematic of the war, first-hand experience even some NATO-member countries don’t have. “This is a new level of threat,” Yusov said. “Regional countries must prepare for what this means in the future.”    The North Koreans’ early missteps were largely caused by inexperience, such asmoving in large groups in open terrain, making themeasy targets for drones and artillery strikes. According to the Ukrainian military unit’s report, the North Korean soldiers were spotted easily as they moved in single-file columns through forest in groups of three, with 3 to 5 meters (yards) between soldiers. On open terrain, they moved in dispersed formations of five to 15 soldiers, making them vulnerable and leading to heavy losses. However, during night operations, their movements were swift and units oriented themselves using red flashlights along routes, the report said. “They’re fast, physically well-prepared, and act strictly according to their algorithms,” said the Ukrainian soldier who spoke to the AP. “If you drill the same routines for years, to the point where they can be executed blindfolded, it will yield results.” Despite their discipline, their lack of combat experience hindered their effectiveness. The Ukrainian military reported that North Korean troops often sustained heavy losses, with many killed by drones. On Thursday, Ukrainian PresidentVolodymyr Zelenskyyput thenumber of killed or wounded North Koreans at 4,000, though U.S. estimates are lower, at around 1,200. “Much of their military doctrine and training is based on strategies and experiences from over half a century ago,” said Glib Voloskyi, a military analyst with the Ukrainian think tank CBA Initiatives Center. The large-group formations date to when artillery accuracy was significantly lower, and observing troop movements much more difficult. Today, reconnaissance and so-called first-person view drones, or FPVs, that transmit video allowing soldiers to strike targets in real time have made the battlefield highly transparent, and anyone stepping onto it without cover, let alone moving in groups, is immediately spotted. “But it is only a matter of time before they acquire the necessary skills to improve their combat effectiveness, which, combined with their discipline and training, could make them a significant military force,” Voloskyi said.  After weeks of fighting,Ukrainian soldiers have taken only two prisoners of war.In announcing the capture Saturday, Zelenskyy said taking them alive “was not easy” because of efforts to conceal the North Koreans’ presence and avoid their interrogation by Ukraine. North Korean soldiers avoid surrendering at all costs, Zelenskyy said. This may stem from North Korean internal propaganda that portrays capture as the ultimate disgrace, analysts said. “To be captured alive is considered a betrayal of the country, the leader and everything they stand for,” said Seongmin Lee of the New York-based Human Rights Foundation, who defected from North Korea in 2009. This belief is instilled from a young age and reinforced throughout military training, he said. “Because of the disgrace associated with the capitulation, heroic soldiers are supposed to save the last of their bullets to kill themselves,” Lee said. Lee said he shared photos of dead North Korean soldiers with contacts back home. “Most North Koreans don’t even know what is going on,” he said. Dorothy Camille Shea, the deputy U.S. ambassador to theU.N.,warned of the dangers posed by the rapidly improving battlefield skills the North Korean troops are gaining fighting in Kursk. North Korea “is significantly benefiting from receiving Russian military equipment, technology and experience, rendering it more capable of waging war against its neighbors,” Shea told the 15-memberU.N. Security Councilon Wednesday. As an added potential benefit, she said, North Korea “will likely be eagerto leverage these improvements to promote weapons sales and military training contracts globally.” ___ Associated Press reporters Tong-hyung Kim in Seoul, South Korea, and Michael Weissenstein at the United Nations contributed.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_17",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/ukraine-russia-war-attack-missile-drone-58bc08ddcf1038fb409999c56b11e9fa",
    "title": "Russia launches largest missile and drone barrage on Kyiv since war in Ukraine began",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. Waves of drone and missile attacks targeted Kyiv overnight into Friday in the largest aerial attack since Russia’s war in Ukraine began, injuring 23 people and inflicting damage across multiple districts of the capital. (AP video by Yehor Konovalov) KYIV, Ukraine (AP) — Waves of drones and missiles targeted Kyiv overnight in the largest aerial assault sinceRussia’s invasion of Ukrainebegan more than three years ago, officials said Friday, amida renewed Russian pushto capture more of its neighbor’s land. Hours after the barrage that killed one person and wounded at least 26 others, including a child, Ukrainian President Volodymyr Zelenskyy said he had a “very important and productive” phone call with U.S. President Donald Trump. Firefighters work at a destroyed apartment building after a Russian drone and missile attacks in Kyiv, Ukraine, Friday, July 4, 2025. (AP Photo/Efrem Lukatsky)  Damaged cars lie in a yard among other debris after a Russian drone and missile attacks in Kyiv, Ukraine, Friday, July 4, 2025. (AP Photo/Efrem Lukatsky)  The two leaders discussed how Ukrainian air defenses might be strengthened, possible joint weapons production between the U.S. and Ukraine, and broaderU.S-led efforts to end the warwith Russia, according to a statement by Zelenksyy. Asked Friday night by reporters about the call, Trump said, “We had a very good call, I think.” When asked about finding a way to end the fighting, Trump said: “I don’t know. I can’t tell you whether or not that’s going to happen.” The U.S. haspaused some shipments of military aidto Ukraine, including crucial air defense missiles. Ukraine’s main European backersare considering howthey can help pick up the slack. Zelenskyy says plans are afoot to build up Ukraine’s domestic arms industry, butscaling up will take time. The seven-hour bombardment of Kyiv caused severe damage across multiple districts of the capital in a seven-hour onslaught, authorities said. Blasts lit up the night sky and echoed across the city as air raid sirens wailed. The blue lights of emergency vehicles reflected off high-rise buildings, and debris blocked city streets.  “It was a harsh, sleepless night,” Zelenskyy said. U.S. President Donald Trump said he would speak to Ukrainian President Volodymyr Zelenskyy on Friday. He also said that he was “very disappointed” with the conversation he had with Russian President Vladimir Putin on Thursday. Russia has been stepping up its long-range attacks on Ukrainian cities. Less than a week ago, Russia launched what was then thelargest aerial assaultof the war. That strategy has coincided with a concerted Russian effort to break through parts of the roughly 1,000-kilometer (620-mile) front line, where Ukrainian troops are under severe pressure. Russia launched 550 drones and missiles across Ukraine during the night, the country’s air force said. The majority wereShahed drones, but Russia also launched 11 missiles in the attack. Alya Shahlai, a 23-year-old Kyiv wedding photographer, said that her home was destroyed in the attack. “We were all in the (basement) shelter because it was so loud, staying home would have been suicidal,” she told The Associated Press. “We went down 10 minutes before and then there was a loud explosion and the lights went out in the shelter, people were panicking.” Five ambulances were damaged while responding to calls, officials said, and emergency services removed more than 300 tons of rubble. In Friday’s call, Zelenskyy said he congratulated Trump and the American people on Independence Day and thanked the United States for its continued support. They discussed a possible future meeting between their teams to explore ways of enhancing Ukraine’s protection against air attacks, Zelenskyy said. In this photo provided by the Ukrainian Emergency Service, first responders work to extinguish a fire following a Russian attack in Kyiv region, Ukraine, Friday, July 4, 2025. (Ukrainian Emergency Service via AP)  He added that they talked in detail about defense industry capabilities and direct joint projects with the U.S., particularly in drone technology. They also exchanged views on mutual procurement, investment, and diplomatic cooperation with international partners, Zelenskyy said. Peace efforts have been fruitless so far.Recent direct peace talkshave led only to sporadic exchanges of prisoners of war, wounded troops and the bodies of fallen soldiers. No date has been set for further negotiations. Ukrainian officials and the Russian Defense Ministry said another prisoner swap took place Friday, though neither side said how many soldiers were involved. Zelenskyy said most of the Ukrainians had been in Russian captivity since 2022. The Ukrainian soldiers were classified as “wounded and seriously ill.” The attack on Kyiv began the same daya phone call took placebetween Trump and Russian President Vladimir Putin. Asked if he made any progress during his call with Putin on a deal to end the fighting in Ukraine, Trump said: “No, I didn’t make any progress with him today at all.” “I’m very disappointed with the conversation I had today with President Putin because I don’t think he’s there. I don’t think he’s looking to stop (the fighting), and that’s too bad,” Trump said. Damaged cars lie in a yard among other debris after a Russian drone and missile attacks in Kyiv, Ukraine, Friday, July 4, 2025. (AP Photo/Efrem Lukatsky)  According to Yuri Ushakov, Putin’s foreign affairs adviser, the Russian leader emphasized that Moscow will seek to achieve its goals in Ukraine and remove the “root causes” of the conflict. “Russia will not back down from these goals,” Ushakov told reporters after the call. Russia’s army crossed the border on Feb. 24, 2022, in an all-out invasion that Putin sought to justify byfalsely sayingit was needed to protect Russian-speaking civilians in eastern Ukraine and prevent the country from joining NATO. Zelenskyy has repeatedly called outRussian disinformation efforts. The Ukrainian response needs to be speedy as Russia escalates its aerial attacks. Russia launched 5,438 drones at Ukraine in June, a new monthly record, according to official data collated by The Associated Press. Ukrainian Foreign Minister Andrii Sybiha said earlier this week that Russia also launched more than 330 missiles, including nearly 80 ballistic missiles, at Ukrainian towns and cities that month. Throughout the night, AP journalists in Kyiv heard the constant buzzing of drones overhead and the sound of explosions and intense machine gun fire as Ukrainian forces tried to intercept the aerial assault. “Absolutely horrible and sleepless night in Kyiv,” Ukrainian Foreign Minister Andrii Sybiha wrote on social media platform X. “One of the worst so far.” Ukraine’s Economy Minister Yuliia Svyrydenko described “families running into metro stations, basements, underground parking garages, mass destruction in the heart of our capital.” “What Kyiv endured last night, cannot be called anything but a deliberate act of terror,” she wrote on X. Kyiv was the primary target of the countrywide attack. At least 14 people were hospitalized, according to Kyiv Mayor Vitali Klitschko. Zelenskyy called the Kyiv attack “cynical.” In Moscow, the Defense Ministry claimed its forces targeted factories producing drones and other military equipment in Kyiv. Ukrainian air defenses shot down 270 targets, including two cruise missiles. Another 208 targets were lost from radar and presumed jammed. Russia successfully hit eight locations with nine missiles and 63 drones. Debris from intercepted drones fell across at least 33 sites. In addition to the capital, the Dnipropetrovsk, Sumy, Kharkiv, Chernihiv and Kyiv regions also sustained damage, Zelenskyy said. Emergency services reported damage in at least five of Kyiv’s 10 districts. ___ Vasilisa Stepanenko contributed to this report from Kyiv, Ukraine ___ Follow AP’s coverage of the war in Ukraine athttps://apnews.com/hub/russia-ukraine.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_18",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/trump-zelenskyy-putin-ukraine-tomahawks-ce697e5eda6ce9793b4343499d105a8c",
    "title": "After Zelenskyy meeting, Trump calls on Ukraine and Russia to ‘stop where they are’ and end the war",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. “The president is right,” the Ukrainian President told reporters after being asked to comment on Trump’s call for the two sides to “stop where they are.” The Ukrainian president said that while his country has thousands of drones, it doesn’t have strong missiles that the U.S. makes and suggested both countries can work together for their military goals. President Trump says he’s interested in such a deal. President Donald Trump hosted Ukrainian President Volodymyr Zelenskyy for talks at the White House on Friday, with the U.S. leader signaling he’s not ready to sell Kyiv the Tomahawk long-range missile system that the Ukrainians say they desperately need. Ukraine’s President Volodymyr Zelenskyy, left, sits before a meeting with President Donald Trump, from right, Vice President JD Vance and Treasury Secretary Scott Bessent in the Cabinet Room of the White House, Friday, Oct. 17, 2025, in Washington. (AP Photo/Alex Brandon) President Donald Trump, left, greets Ukraine’s President Volodymyr Zelenskyy at the White House, Friday, Oct. 17, 2025, in Washington. (AP Photo/Alex Brandon) President Donald Trump, left, greets Ukraine’s President Volodymyr Zelenskyy at the White House, Friday, Oct. 17, 2025, in Washington. (AP Photo/Alex Brandon) President Donald Trump, second right, and Ukraine’s President Volodymyr Zelenskyy, seated left, sit as reporters ask questions before a lunch in the Cabinet Room of the White House, Friday, Oct. 17, 2025, in Washington. (AP Photo/Alex Brandon) Ukraine’s President Volodymyr Zelenskyy speaks to reporters in Lafayette Park across the street from the White House, following a meeting with President Donald Trump, Friday, Oct. 17, 2025, in Washington. (AP Photo/Manuel Balce Ceneta)               WASHINGTON (AP) — PresidentDonald Trumpon Friday called on Kyiv and Moscow to“stop where they are”and end their brutal war following a lengthy White House meeting with Ukrainian PresidentVolodymyr Zelenskyy. Trump’s frustration with the conflict has surfaced repeatedly in the nine months since he returned to office, but with his latest comments he edged back in the direction of pressing Ukraine to give up on retaking land it has lost to Russia. “Enough blood has been shed, with property lines being defined by War and Guts,” Trump said in a Truth Social post not long after hosting Zelenskyy and his team for more than two hours of talks. “They should stop where they are. Let both claim Victory, let History decide!” Later, soon after arriving in Florida, where he’s spending the weekend, Trump urged both sides to “stop the war immediately” and implied that Moscow keep territory it’s taken from Kyiv. “You go by the battle line wherever it is — otherwise it’s too complicated,” Trump told reporters. “You stop at the battle line and both sides should go home, go to their families, stop the killing, and that should be it.” The comments amounted to another shift in position on the war by Trump. In recent weeks, he had shown growing impatience with Russian President Vladimir Putin andexpressed greater opennessto helping Ukraine win the war. After meeting with Zelenskyy in New York on the sidelines of the annual U.N. General Assembly last month, Trump even said he believed the Ukrainians couldwin back all the the territorythey had lost to Russia since Putin launched the February 2022 invasion. That was a dramatic shift for Trump, who had previously insisted that Kyiv would have to concede land lost to Russia to end the war.  Zelenskyy after Friday’s meeting said it was time for a ceasefire and negotiations. He sidestepped directly answering a question about Trump nudging Ukraine to give up land. “The president is right we have to stop where we are, and then to speak,” Zelenskyy said when asked by reporters about Trump’s social media post, which he hadn’t seen. Ukraine’s President Volodymyr Zelenskyy speaks to reporters in Lafayette Park across the street from the White House, following a meeting with President Donald Trump, Friday, Oct. 17, 2025, in Washington. (AP Photo/Manuel Balce Ceneta)  Trump’s tone on the war shifted after he held alengthy phone call with Putinon Thursday and announced that he planned to meet with the Russian leader in Budapest, Hungary, in the coming weeks. The president also signaled toZelenskyyon Friday that he’s leaning against selling him long-range Tomahawk missiles, weaponry that the Ukrainians believe could be a game changer in helping prod Putin to the negotiating table. Zelenskyy at the start of the White House talks said he had a “proposition” in which Ukraine could provide the United States with its advanced drones, while Washington would sell Kyiv theTomahawk cruise missiles. But Trump said he was hesitant to tap into the U.S. supply, a turnabout after days of suggesting he was seriously weighing sending the missiles to help Ukraine beat back Russia’s invasion. “I have an obligation also to make sure that we’re completely stocked up as a country, because you never know what’s going to happen in war and peace,” Trump said. “We’d much rather have them not need Tomahawks. We’d much rather have the war be over to be honest.” President Donald Trump, second right, and Ukraine’s President Volodymyr Zelenskyy, seated left, sit as reporters ask questions before a lunch in the Cabinet Room of the White House, Friday, Oct. 17, 2025, in Washington. (AP Photo/Alex Brandon)  In an interview with Kristen Welker of NBC’s “Meet the Press,” Zelenskyy suggested the door was not closed. “It’s good that President Trump didn’t say ‘no,’ but for today, didn’t say ‘yes,’” he said. Zelenskyy also said “we need Tomahawks” because “it’s very difficult just to operate only with Ukrainian drones.” Trump’s latest rhetoric on Tomahawks was certainly disappointing to the Ukrainians. In recent days,Trump had shown an opennessto selling Ukraine the Tomahawks, even as Putin warned that such a move would further strain the U.S.-Russian relationship. But followingThursday’s call with Putin, Trump began downplaying the prospects of Ukraine getting the missiles, which have a range of about 995 miles (1,600 kilometers.) Zelenskyy had beenseeking the Tomahawks,which would allow Ukrainian forces to strike deep into Russian territory and target key military sites, energy facilities and critical infrastructure. Zelenskyy has argued that the potential for such strikes would help compel Putin to take Trump’s calls for direct negotiations to end the war more seriously. Putin warned Trump during the call that supplying Kyiv with the Tomahawks “won’t change the situation on the battlefield, but would cause substantial damage to the relationship between our countries,” according to Yuri Ushakov, Putin’s foreign policy adviser. President Donald Trump greets Russia’s President Vladimir Putin on the tarmac at Joint Base Elmendorf-Richardson in Anchorage, Alaska, Aug. 15, 2025. (AP Photo/Julia Demaree Nikhinson)  It was the fifth face-to-face meeting for Trump and Zelenskyy since the Republican returned to office in January, The president said Friday it was “to be determined” if Zelenskyy would be involved in the upcoming talks in Hungary — suggesting a “double meeting” with the warring countries’ leaders was likely the most workable option for productive negotiations. “These two leaders do not like each other, and we want to make it comfortable for everybody,” Trump added. But Zelenskyy told reporters that the animus toward Putin “is not about feelings.” “They attacked us, so they are an enemy for us. They don’t intend to stop,” Zelenskyy added. “So they are an enemy. It is not about someone just hating someone else. Although, undoubtedly, we hate the enemy. Undoubtedly.” Ukraine’s President Volodymyr Zelenskyy speaks to reporters in Lafayette Park across the street from the White House, following a meeting with President Donald Trump, Friday, Oct. 17, 2025, in Washington. (AP Photo/Manuel Balce Ceneta)  Trump, going back to his 2024 campaign,insisted he would quickly end the war, but his peace efforts appeared to stall following a diplomatic blitz in August, when he held asummit with Putinin Alaska and aWhite House meeting with Zelenskyyand European allies. Trump emerged from those meetings certain he was on track to arranging direct talks between Zelenskyy and Putin. But the Russian leader hasn’t shown any interest in meeting with Zelenskyy and Moscow has only intensified its bombardment of Ukraine. Asked Friday if he was concerned that Putin was stringing him along, Trump acknowledged it was a possibility but said he was confident he could handle the Russian leader. “I’ve been played all my life by the best of them, and I came out really well,” Trump said. He added, “I think I’m pretty good at this stuff.” ___ Megerian reported from West Palm Beach, Fla. AP writer Susie Blann in Kyiv, Ukraine, contributed reporting.       Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_19",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/russia-ukraine-war-kyiv-drones-missiles-ff186b035b953470587ae941a4a7fd0d",
    "title": "Russian attack kills at least 3 in Kyiv as Ukrainian drone strikes set Russian fuel stores alight",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. In the early morning of Saturday Russia launched a missile attack on Kyiv’s Shevchenkivskyi district. At least three people have died according to the local government. First responders work the scene following a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) Police officers collect evidence following a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) A destroyed car is seen as firefighters work on the site of a damaged building after a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) A destroyed car is seen as firefighters work on the site of a damaged building after a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) First responders work the scene following a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) First responders work the scene following a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) Firefighters work at the site of a damaged metro station after a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) A Ukrainian serviceman collects evidence following a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) Ukrainian servicemen collect evidence following a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) Police officers guard a building following a Russian missile attack in Kyiv, Ukraine, Saturday, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) Firefighters work on the site of a damaged building after a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky) Police officers rope off the entrance to a metro station after a Russian missile strike on Kyiv, Ukraine, Saturday, Jan. 18, 2024. (AP Photo/Evgeniy Maloletka) Rescuers work the site of a Russian missile strike on Kyiv, Ukraine, Saturday, Jan. 18, 2024. (AP Photo/Evgeniy Maloletka) A rescue worker crosses a flooded street after a Russian missile strike on Kyiv, Ukraine, Saturday, Jan. 18, 2024. (AP Photo/Evgeniy Maloletka) A rescue worker stands in a flooded street after a Russian missile strike on Kyiv, Ukraine, Saturday, Jan. 18, 2024. (AP Photo/Evgeniy Maloletka)                                KYIV, Ukraine (AP) — Russia attacked Ukraine’s capital with a barrage of drones and missiles Saturday, leaving at least three people dead, while industrial sites in Russia were set ablaze by Ukrainian strikes. Russia launched 39 Shahed drones, other simulator drones and four ballistic missiles in the early hours of Saturday morning, according to Ukraine’s Air Force. Ukrainian air defense forces shot down two missiles and 24 drones. A further 14 drone simulators were lost in location, the statement said. Police officers collect evidence following a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky)  The Kyiv City Military Administration said three people were killed and three more injured in the attack. A fourth victim had been assumed dead but the administration said later the case has yet to be confirmed. The known victims are two men aged 43 and 25, and a 41-year-old woman, officials said. The office of Ukraine’s general prosecutor said in a statement that the casualties included a security guard at a food establishment and people who were in a minibus on the street. AP journalists at the scene saw a man lying dead amid the debris in a pool of blood. Water flooded the streets as firefighters put out the blaze from the attack. Kyiv’s mayor, Vitali Klitschko, said windows were broken in the city’s Shevchenkivskyi district, and there was smoke at the entrance of a residential building. A water supply pipeline was also damaged, he added. The Lukyanivska metro station was closed after the attacks damaged its glass entrance, but was later reopened. First responders work the scene following a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky)  Firefighters work at the site of a damaged metro station after a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky)  Ukrainian servicemen collect evidence following a Russian missile attack in Kyiv, Ukraine, Saturday, Jan. 18, 2025. (AP Photo/Efrem Lukatsky)  Drones and missiles were also shot down across numerous regions in Ukraine, including Poltava, Sumy, Kharkiv, Cherkasy, Chernihiv, Kyiv, Khmelnytskyi, Zhytomyr, Kirovohrad, Dnipropetrovsk, Kherson and Donetsk.  Ten people were injured when a Russian missile struck the regional center of Zaporizhzhia, damaging residential buildings and private vehicles, local governor Ivan Fedorov said. Eight people aged between 28 to 69 were hospitalised, including a 48-year-old woman in a serious condition, he wrote in a statement. Elsewhere, industrial sites in Russia’s Kaluga and Tula regions were set ablaze by Ukrainian drone attacks, local officials said Saturday. Russia’s Defense Ministry said that 46 Ukrainian drones had been destroyed across the country overnight. In the Kaluga region, a drone strike sparked a fire in the town of Lyudinovo, Gov. Vladislav Shapsha wrote on Telegram. Residents said on social media that the attack had targeted a local oil depot. A fire was also reported in Tula region, where Gov. Dmitry Milyaev said a fuel storage tank had been set alight. He warned residents to stay away from fallen drone debris. No casualties were reported in either case.      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_20",
    "corpus": "ukraine"
  },
  {
    "url": "https://apnews.com/article/zelenskyy-ukraine-war-ramstein-russia-f6e591c4494e6a1e8560cbd86ab5693e",
    "title": "Ukraine presses attacks in Russia’s Kursk region",
    "text": " Copyright 2025 The Associated Press. All Rights Reserved.  Copyright 2025 The Associated Press. All Rights Reserved. In this photo taken from video distributed by Russian Defense Ministry Press Service on Saturday, Jan. 4, 2025, Russian servicemen attend a combat training for assault units in an undisclosed location. (Russian Defense Ministry Press Service via AP) In this photo taken from video distributed by Russian Defense Ministry Press Service on Saturday, Jan. 4, 2025, Russian servicemen attend a combat training for assault units in an undisclosed location. (Russian Defense Ministry Press Service via AP) In this photo taken from video distributed by Russian Defense Ministry Press Service on Saturday, Jan. 4, 2025, Russian servicemen attend a combat training for assault units in an undisclosed location. (Russian Defense Ministry Press Service via AP)       KYIV, Ukraine (AP) — President Volodymyr Zelenskyy says he will urge allies to boost Ukraine’s air defenses at a meeting this week in Germany, while both sides said Kyiv’s forces pressed new attacks Sunday in Russia’s Kursk region. Russian shelling, meanwhile, killed at least one person and wounded another in Ukraine’s Dnipropetrovsk region, local officials said. Dozens of partner countries will participate in the meeting of the Ramstein group at Ramstein Air Base in Germany on Thursday, Zelenskyy said, “including those who can help boost our capabilities not only to defend against missiles but also against guided bombs and Russian aviation.” “We will discuss this with them and continue to persuade them,” Zelenskyy said in his nightly address on Saturday. “The task remains unchanged: strengthening our air defense.” U.S. Defense Secretary Lloyd J. Austin will attend the meeting, which originally had been scheduled for October with U.S. President Joe Biden present. The session was postponed in the aftermath of Hurricane Milton striking the state of Florida. The Biden administration is pressing to send as much military aid as possible to Ukraine before Trump is sworn in Jan. 20. Trump claimed during his election campaign that he could end the nearly 3-year-old war in one day, and his comments have raised questions over whether Washington will continue to be Ukraine’s biggest — and most important — military backer. Zelenskyy said last week that Trump is “strong and unpredictable,” and those qualities can be a decisive factor in his policy approach to the war. In this photo taken from video distributed by Russian Defense Ministry Press Service on Saturday, Jan. 4, 2025, Russian servicemen attend a combat training for assault units in an undisclosed location. (Russian Defense Ministry Press Service via AP)    Russia controls about a fifth of Ukraine and last yearadvanced slowly in eastern areasdespite high losses of troops and equipment. The war’s trajectory isn’t going in Ukraine’s favor, with the country shorthanded on the front line and in need of more support from its Western partners. In Ukraine’s incursion in the Kursk region, Zelenskyy said Russian andNorth Korean troopshad suffered heavy losses in fighting in Russia’s Kursk region. “In battles yesterday and today near just one village, Makhnovka, in the Kursk region, the Russian army lost up to a battalion of North Korean infantry soldiers and Russian paratroopers,” he said. “This is significant.” Zelenskyy said last month that 3,000 North Korean troops had been killed or wounded in Kursk, where Ukrainian forces launched an incursion in August, dealing a blow to Russia’s prestige and forcing it to deploy some of its troops from eastern Ukraine. In this photo taken from video distributed by Russian Defense Ministry Press Service on Saturday, Jan. 4, 2025, Russian servicemen attend a combat training for assault units in an undisclosed location. (Russian Defense Ministry Press Service via AP)  The incursion didn’t significantly change the dynamic of the war, and military analysts say Ukraine has lost around 40% of the land it initially captured. Russia’s Defense Ministry said Sunday that Ukraine launched a fresh offensive in the Kursk region. It claimed its forces pushed back Ukrainian troops, but some reports from Russian military bloggers indicated that Moscow’s forces faced significant pressure. A ministry statement said Ukrainian forces attacked about 9 a.m. local time (0600 GMT, 1 a.m. EST) near the village of Berdin with two tanks, a mine-clearing vehicle and 12 armored combat vehicles with paratroopers. Two Ukrainian attacks were repelled, it said. Ukrainian presidential adviser Andriy Yermak said there was “good news” from Kursk and that Russia was “getting what it deserves,” while Andriy Kovalenko, head of Ukraine’s official Centre Against Disinformation, said on Telegram that Russian troops were attacked in several places. The Associated Press was not immediately able to verify the reports. In other developments, local officials said one person was killed and another wounded in Russian shelling of the city of Nikopol in Ukraine’s Dnipropetrovsk region on Sunday. Downstream along the Dnieper River, at least six people were wounded when Russian troops shelled the city of Kherson, capital of the region of the same name. Settlements along the west bank of the river come under regular shelling from Russian-controlled territory on the opposite bank. Nine people were wounded in a Russian guided bomb attack on the border town of Semenivka in Ukraine’s northern Chernihiv region on Saturday evening, local officials said. Moscow sent 103 drones into Ukraine overnight Sunday, Ukrainian officials said. According to Ukraine’s air force, 61 drones were destroyed and 42 were lost, likely due to electronic jamming. The Russian Defense Ministry said that 61 Ukrainian drones were shot down overnight Sunday in western Russia. No casualties were reported but Rostov regional Gov. Yuri Slyusar said residential buildings and cars were damaged by falling drone debris. ___ Morton reported from London. —- Follow AP’s coverage of the war in Ukraine athttps://apnews.com/hub/russia-ukraine      Copyright 2025 The Associated Press. All Rights Reserved.",
    "id": "ukraine_21",
    "corpus": "ukraine"
  }
]